hʐZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:819;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2015-01-24 11:27:35";s:13:"post_date_gmt";s:19:"2015-01-24 03:27:35";s:12:"post_content";s:12227:"<section><section class="Powered-by-XIUMI V5"><section><section><section><section><section class="Powered-by-XIUMI V5"><section><section><section><img src="http://img.zcool.cn/community/0215f056974ef732f87574be9f69d7.jpg@800w_1l_2o" alt="4f4056974ef732f87574bed16198.jpg" /> </section></section></section></section></section></section></section></section></section></section>Kevin chao是来自纽约的一位平面设计师，目前他工作于karlssonwilker.inc，也是good measure项目联合设计团队中的一员。

Designboom(以下简称DB)：最初是什么让你想成为一名平面设计师的？

Kevin Chao(以下简称KC): 像许多其他设计师一样，我开始学平面设计时，并没有完全理解平面设计是什么。我要感谢我高中的死亡金属乐队让我开始这一切，当时为了有演出的资格，我们被迫必须卖出一定数量的门票，同时为了成功吸引那些对乐队并没有多大兴趣的年轻人，我不得不设计各种乐队标志、海报及周边商品，甚至，还重新设计了门票。那时，为了设计出MySpace主页，我还特意学习了一些HTML语言,别无他法。后来当这些东西受到追捧的时候，我觉得如果乐队不能继续下去，做设计也许是项不错的选择。

我的设计生涯很棒，但不得不承认的是，都是在小团队中。从一开始我就知道，我会享受小工作室那种节奏快，关系却紧密的工作环境，直到现在我仍持这种想法。算下来，我待过的最大的团队也不超过12个人。但说实话，正是在小团队这种人数不多，关系密切的环境里，我学会了如何在联系紧密的团队里工作。

<img src="http://img.zcool.cn/community/0298a156974d4932f87574bec25e94.jpg@800w_1l_2o" alt="e06556974d4932f87574be444f83.jpg" />

Kevin就职于karlssonwilker inc.时的设计作品，为“wolf-gordon”墙纸设计的手册——展览于2015年美国芝加哥室内设计及办公家具展览会（neocon 2015）

DB：你会如何描述你的设计方法？

KC：我试着用诚实的眼光来进行设计。如果你要为一个产品塑造品牌形象，就应该把人们所有可能想买它的原因（比如说实用性强、符合人体工程学、文化内涵丰富、富有美感等等）给表现出来，而不是营造出一种假象，假象里充满着根本不存在的东西。市场上已经过度充斥着打上了“生活品质”标签的商品，奢侈如碳纤维手纸架。请牢记，我们不是在做骗人的勾当， 所以只要我们在工作方面做得很好，我们就能够表现出项目中最独特的闪光点。用固定思维是无法做出“好设计”的，不应该把一个追求成功的产品设计交到那些才28岁——就满脸络腮胡，总是站在布鲁克林街区某个车库门前的男人手中。

<img src="http://img.zcool.cn/community/02ed6256974d596ac725af23a06589.jpg@800w_1l_2o" alt="f77256974d596ac725af23bb2264.jpg" />Kevin为电影制作公司vagabond productions设计的宣传海报

DB：哪个人或者哪件事对你思考的方式影响最大？

KC：当下而言，我必须说karlssonwilker这个工作室是对我的影响最大。和许多其他工作室不同，我觉得他们有一个具有前瞻性的长期目标，从一开始，这个目标就能让他们在设计过程中找到答案。如果要用一个符号来形容的话，我会用一个大大的问号。好像从始至终，这个工作室都一直面对着一系列挑战和挫折，但就算是犯了再大的错误也没有关系，因为这是一种认知自身能力水平的途径。所以，在与他们一起工作之后，我的确接受了一些“不怕犯错”的理念，并且学会了在工作中运用这些理念。

<img src="http://img.zcool.cn/community/02b03c56974da76ac725af233c7d35.jpg@800w_1l_2o" alt="d9ad56974da76ac725af2331c726.jpg" />

Kevin为冰岛雷克雅未克的loksins bar设计的标识-供职于karlssonwilker.inc时设计作品

DB：你觉得你的强项是什么？这么多年来，你是如何磨练这项技能的呢？

KC：很久以前，我不知道我是否应该尝试在各种问题上表达自己的意见或立场。因为我我在这方面有些迟钝，但我坚信，如果人们能够不吝啬自己的赞美之词，人与人将会相处得更好。毕竟，无论对别人还是对自己而言，悲观地看待诚实如同用海绵抵抗危险一样，都是消极的。

<img src="http://img.zcool.cn/community/02031656974dbb32f87574bee1a11f.jpg@800w_1l_2o" alt="d61f56974dbb32f87574beca60b9.jpg" />

Kevin为health band 设计的海报

<img src="http://img.zcool.cn/community/02db1a56974dcb6ac725af23121d4f.jpg@800w_1l_2o" alt="cf6b56974dca6ac725af23eb9db0.jpg" />

Kevin为health band 设计的专辑封面

DB：工作中你最喜欢什么类型的简报或者项目？

KC：我喜欢有明确目标的人或者团队——不过目标的大小倒是无所谓。目前，我和一些杰出的人一起工作，他们通过美国市场，在第三世界重新进行农业工业化和经济化的改革。另外，我也正在着手帮助老邻居开始他的说唱生涯，他想通过音乐来把我们当地的青年群体聚合起来，我认为这是一个很赞的梦想。

能够为实现这些目标而努力，让我感觉非常棒，而这些目标不必非得是你自己设立的。选择这样的合作关系，让你不必将你所有的时间全部花在一个目标上，而是保持一直可以同时做很多很棒的事情。于我而言，这也许是做平面设计最有吸引力的地方。

<img src="http://img.zcool.cn/community/02042156974ddd32f87574bea2aa56.jpg@800w_1l_2o" alt="cd1a56974ddd32f87574be30598b.jpg" />

对spare change news报纸的品牌重塑——与johnny lee和michelle wang共同设计

<img src="http://img.zcool.cn/community/027a3e56974dec6ac725af2347b341.jpg@800w_1l_2o" alt="613956974dec6ac725af2323e672.jpg" />

spare change news的网页设计——与johnny lee和michelle wang共同设计

DB：你对专业化和大众化有什么看法？

KC：对我来说这个问题可以转换成“专业的”和“个性的”之间的问题。当你专门研究一件东西的时候，你可以把所有的时间都投入到上面，尽可能地把它做好。毋庸置疑，比起博而不精，术业有专攻显然更加有用。但站在更个人的立场，我发现自己总会遇到一些凭借一己之力无法解决的事情，这种时候我就什么都想学。但这样做真的可行吗？当然不是。所以重要的是，把时间花到自己真正想做的事情上，而不是空想着自己能成为所有领域的专家。

<img src="http://img.zcool.cn/community/02ee6756974dfd6ac725af23cbc15c.jpg@800w_1l_2o" alt="d14556974dfd6ac725af2360dfd4.jpg" />

save it for later展览视觉识别——供职于franklyn时期的设计作品

<img src="http://img.zcool.cn/community/02f02656974e0d6ac725af2371bb38.jpg@800w_1l_2o" alt="081756974e0d6ac725af23937512.jpg" />

save it for later展览海报——供职于franklyn时的设计作品

DB:你认为网络设计资源对平面设计有哪些影响呢？

KC：很明显，同质化的现象是随着设计博客和教程等的出现而凸显的，它们削弱了设计的创新性，也造成了风格的重复化，但我认为这并不是一种毒药。如果有人说网络资源没有让设计变得更加大众化，没有对设计风格产生自己独特的影响，那一定是在胡说八道，设计行业明显增长的受众就可以作为反驳的论据。现在，传播作品变得前所未有的容易，而那些曾经独家的作品也通过多渠道，变得越来越触手可及。

“创造”的能力永一直区分设计师优秀与否的核心标准。而且这一点从未改变。今天的作品或许有些同质化，但真正的客户及消费者也前所未有地接受了它们。如果抛开作品中那些影响到整个标准的“稀奇古怪”的东西，我很想看看那些优秀的设计师们会如何努力来维持。毕竟，那些对此抱怨的设计师们只是在抱怨自己的工作变得更难了而已。不过，我倒是想看看谁敢站出来面对这样的挑战。

<img src="http://img.zcool.cn/community/02088856974e266ac725af2339b275.jpg@800w_1l_2o" alt="3a9a56974e266ac725af23cbaf6f.jpg" />

Kevin为世界建筑节设计的海报

DB：最近有没有让你特别着迷的东西？如果有的话，它是怎么融入你的作品中的？

KC：在我上学的时候，我的教授曾经给我介绍过有关“心选小路”（desire path）的概念。这种小路不是由人为设计，而是由行人或自行车频繁经过所形成的。它是指一般情况下，正式修建的道路绕远，或者路中间有沟，甚至压根没有正式道路的时候，随着时间的推移，就会逐渐出现一条距离最短且最易找到的“心选小路“。后来，人们便可以根据小路的宽度，估算出通行人口的数量。因此，这个概念给我留下了深刻的印象，让我至今仍在思考。

“心选小路”在很多方面都非常出色。它不仅是一个自然事件问题与方法的实例，也证明了我们无论多么想在设计时以某种方式掌控一切，都总会有一种与之相对的回应。这也证明了设计是无法违背自然，并且易受影响的，这种属性让我们有了更强的责任感，去把每一件事正确明智地做好。

<img src="http://img.zcool.cn/community/02426556974e326ac725af23e9e923.gif" alt="a6c556974e326ac725af239085c5.jpg" />

betaworks视觉识别——供职于franklyn时的设计作品

<img src="http://img.zcool.cn/community/02e59a56974e416ac725af23874a0d.jpg@800w_1l_2o" alt="750f56974e416ac725af2353b82c.jpg" />

图像扭曲应用beta works——供职于franklyn时期的设计作品

DB：你有哪些业余爱好？

KC：我对激进主义很有兴趣，一般而言，只要我有时间，我都会去尝试解决一些社会问题。但我觉得把这点从我的工作中区分出来有点难。我想这应该就是专业和个人项目间的分界线吧。尽管我的个人项目不仅仅局限于平面设计，但我必须承认它们与我的设计是处在同一个屋檐之下的，它们存在类似的思考及理念。

即使是我在为赚钱工作时，我也在努力地通过设计作品，来减少那种每天围绕在我们身边，对社会存在的偏见与不公平现象持视而不见的盲目满足感。作为少数民族，我的成长过程中伴随着各种因为种族带来的歧视和肢体冲突。但我把我的经历看做是一种荣耀，一种只有日常生活在布鲁克林的人才能体会到的荣耀。如果说我所做的有任何目的的话，我希望是对前面所说那些问题的一种对抗。

<img src="http://img.zcool.cn/community/02b4f856974e7e32f87574be63ba53.jpg@800w_1l_2o" alt="8c5056974e7e32f87574bee75d29.jpg" />

为导演史蒂文•索德伯格（steven soderbergh）执导电影《毒品网络》（traffic）设计的海报

DB：你生活中有没有什么迷信的想法或者习惯？

KC:迷信是在试图解释不幸事件发生的原因，而我觉得不幸的事发生就是发生了，没有什么理由。

<img src="http://img.zcool.cn/community/0237b056974e8e6ac725af236557a0.jpg@800w_1l_2o" alt="c00b56974e8e6ac725af234cbc0c.jpg" />

为语音解析应用textualize设计的海报

<img src="http://img.zcool.cn/community/0280ee56974eb26ac725af23a109a7.jpg@800w_1l_2o" alt="0ae456974eb26ac725af238a8947.jpg" />

语音解析应用textualize

DB：你听的而且也给过别人最好的建议是什么？

KC: “一个人之所以很棒的原因，是他没有试图去成为别人”-Jan Wilker

“多看新闻“-妈妈告诉我的

DB:你的座右铭是什么？

KC：做事专注。

以上就是一些干净网页设计的基本技巧，可能我遗漏了一些，之后我还会在另外的帖子上发布更多的技巧。

祝所有有创造力的设计者们好运！";s:10:"post_title";s:61:"专访平面设计师Kevin Chao－悟思 voossi(翻译理论)";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:143:"%e4%b8%93%e8%ae%bf%e5%b9%b3%e9%9d%a2%e8%ae%be%e8%ae%a1%e5%b8%88kevin-chao%ef%bc%8d%e6%82%9f%e6%80%9d-voossi%e7%bf%bb%e8%af%91%e7%90%86%e8%ae%ba";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-24 11:28:51";s:17:"post_modified_gmt";s:19:"2016-07-24 03:28:51";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=819";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}