4��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"2222";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-09-05 16:32:39";s:13:"post_date_gmt";s:19:"2016-09-05 08:32:39";s:12:"post_content";s:9737:"<div class="article-text">

@ChiNa_威海_山岩 ：很多朋友把合成想得特别复杂，一想到做合成就觉得特别高端，难以完成。其实只要了解基本的方法，后续制作起来并不难。今天这篇好文，用3个方法把复杂的合成图拆分离析，揭开这些大作背后的秘密。最后附有实例操作，简单易懂学起来！

合成简单去理解其实就是拼图，只是我们需要对素材通过放大缩小、位置移动、叠加镂空、抠图融合等各种处理让它们尽量符合我们的需求。

部分案例来源网络，请多多包涵。

要知道，不是所有的图片都可以做合成，我们要满足一些基本的条件，首先要保证图源足够的清晰度，这样我们做一些后期的处理才会有更多灵活的空间，如果是一张质量不高的图片，放大缩小会产生锯齿、变模糊甚至影响最后整体图片的档次和效果，就好比一个不错的电影，全程给猪脚打马赛克一样让观赏者憋屈。

其次我们要满足基本的角度问题，你给我一个侧脸的照片，非让我给你合一个证件照是不可能实现的，尤其是做融合性的合成，第一个考虑的就是角度。如下图：

<img src="http://bbs.uigreat.com/uploadimgs/201609021008000_1357964495.jpg" alt="" />

如果使用了两张脸部偏转角度有过大出人的素材，最后的合成会非常吃力。

最后我们需要考虑光，光的塑造中包含光源位置、高光位置及亮暗、阴影走向及虚实、环境光颜色等等，光塑造的成功，作品中的诸多元素就会统一；我们做合成肯定会经历怎么看怎么假，但是找不到原因的阶段，这期间大部分情况下就是因为没有朔造合理的光造成的。光的朔造类似于素描中的明暗关系，有美术功底的朋友可能更易掌握，下图为例，一个美女扔进一个环境中：

<img src="http://bbs.uigreat.com/uploadimgs/201609021008001_1282682033.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/201609021008012_663622805.jpg" alt="" />

在光的朔造中，尤其环境光是容易被大多数人遗漏的部分，而缺少环境光的辅助即便高光与阴影做的再完美也会令图片看起来有些瑕疵；环境光的朔造在应用周边颜色的基础上也会相应添加物体颜色的补色。
<h4><strong>01、遮盖篇</strong></h4>
搞明白了一张合成中需要的基本条件，我们再来聊聊我的教材中必须出现的东西——方法。

我们先从一些简单上手的方法开始，我管这种方法叫做阻挡去除法，首先我们看一下关于这种方法的例子。

<img src="http://bbs.uigreat.com/uploadimgs/201609021008013_567778872.jpg" alt="" />

从一张电商banner制作时间来算，我们有时候没有那么长的时间去精细朔造某些图片的关于，阻挡去除的方法就很适用，我们要知道，阴影的形成是与承接面有关，如果我们去掉了脚部就省去了做阴影的麻烦——话说晓明童鞋着眼神，太风骚了~

除电商外一些海报合成中也会应用到这种方式。如下：

<img src="http://bbs.uigreat.com/uploadimgs/201609021008014_1935691832.jpg" alt="" />

这里特别提示，有时候我们做图片除非有特定的要求，不要过分想要展示人物的全貌，由于人体是长条形，如果显示全貌就会给画面带来大量的空白，而在电商banner中如果没有特定的需求，有时候也是可以舍去人物的头部，头肩部分是一个三角形，从构图来讲，头部两侧有时候往往会是图片中的空白区域，如果banner高度有限，空白部分又很多的情况下，我们可以果断的把头部去掉，保持画面饱满感。当然如果跟摄影师沟通好在拍摄的是还可以让模特将手臂弯曲抬起做些动作或者保持斜身站立、头部侧歪等造型保留模特头部是极好的。（毕竟模特大部分都是美女嘛~）

<img src="http://bbs.uigreat.com/uploadimgs/201609021008015_1662022003.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/201609021008016_366063541.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/201609021008017_1019331078.jpg" alt="" />

我们在做合成的时候经常会遇到某些衔接部分做的不舒服但是修改起来不容易的情况，其实最简单的方法不是如何在这两个素菜间下功夫而是使用其它元素或颜色遮盖。

<img src="http://bbs.uigreat.com/uploadimgs/201609021008018_1050660626.jpg" alt="" />

↑红框部分士兵，旗帜与地面之间的衔接问题作者应用黑色加暗的方式轻松解决。

<img src="http://bbs.uigreat.com/uploadimgs/201609021008029_1546051461.jpg" alt="" />

↑云的应用即美化图片又将一些衔接生硬处轻松遮盖掉

<img src="http://bbs.uigreat.com/uploadimgs/2016090210080210_519290600.jpg" alt="" />

↑云的应用即美化图片又将一些衔接生硬处轻松遮盖掉

遮盖的方法在图片合成中是非常常见的，这并不是什么偷工减料，是实实在在的一种技法，往往会给你的创作带来更多的可控性。
<h4><strong>02、影子篇</strong></h4>
既然上文提到了影子，我们说说影子的做法，一般来说，物体的影子是有两个部分组成的，即物体与承接面相邻的那个部分的实影（往往都是轮廓稍微明显的暗色），然后是延伸的虚影，一般是接近物体底部延伸的灰色（虚影可能由于环境和光源的问题同时产生多个）。影子的走向肯定是与光源所在的位置是相反的，不要在这种问题上犯错误。

<img src="http://bbs.uigreat.com/uploadimgs/2016090210080211_341393303.jpg" alt="" />

&nbsp;

知道了影子的基本构成，我们制作起来只需要思考两件事就可以了，光源来自哪里，影子什么形状。光源的位置决定了影子的走向，物体的形状决定了影子的形状及体积。我们不做精确的科学计算计算性的东西是值得提倡的，但是不太受用在设计领域的，严格按照公式去算影子到底该多长不是设计师该做的东西。我们只需要理解一个简单的图解：

<img src="http://bbs.uigreat.com/uploadimgs/2016090210080212_1488475011.jpg" alt="" />

如果光源离物体很近并且是强光可能会形成图解中的影子，但是这种情况是不太可能的，正常情况下光源在斜上方，物体的影子是要比这个短的很多的，并且会是大面积的虚影。当然正常情况下光源也不可能这么低。

<img src="http://bbs.uigreat.com/uploadimgs/2016090210080213_579902903.jpg" alt="" />

所以除顶光以外的大部分物体投影都是可以复制原有物体并得到选区填黑轮廓，ctrl+t，按住ctrl点击最上方中间的锚点倾斜黑色轮廓到适当的位置，做一个蒙蔽并在蒙蔽上制造一个黑色渐变，之后对物体与承接面的地方进行一些细节的修复与处理，最后把影子部分做高斯模糊。

<img src="http://bbs.uigreat.com/uploadimgs/2016090210080214_1409175104.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/2016090210080215_1716178709.jpg" alt="" />

&nbsp;

顶光的处理稍微复杂，我们需要做顶光照射下来会有影子区域的轮廓图形（尽量圆润）。如果是用选区做的要记得新建一层。对轮廓进行高斯模糊。最后给影子添加蒙蔽，擦谈一些颜色过重的部分，最后使用画笔工具不透明度10%左右做一些补充绘制（尤其加暗物体与承接面部分的周边区域）

<img src="http://bbs.uigreat.com/uploadimgs/2016090210080216_405081630.jpg" alt="" />

阴影的朔造如果达到一定的水平，自行绘制是最好的选择，这样更灵活，更逼真。

&nbsp;
<h4><strong>03、拼合篇</strong></h4>
只要肯好好找素材，我们完全可以自主的做一些效果很棒的拼合型合成，拼合型合成是合成手法中最简单、易懂、易上手的形式，主要考验排列能力。如下图展示：

<img src="http://bbs.uigreat.com/uploadimgs/2016090210080217_1567706767.jpg" alt="" />

图片是由文字、红色印记、黑色墨痕、两根笔，一个砚台等素材完全拼合而成，其中没有什么高难度技术，只是各元素找到适合它们的位置而已。

<img src="http://bbs.uigreat.com/uploadimgs/2016090210080218_1791756298.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/2016090210080319_1629284150.jpg" alt="" />

上方图片看似复杂，其实也是通过拼合的形式做出来的作品，方法上都是一致的。

举个例子：

1：确立一个背景 2：给背景增加一些装饰元素 3：放入主体

<img src="http://bbs.uigreat.com/uploadimgs/2016090210080320_1442069154.jpg" alt="" />

4：增加更多元素 5：添加文案 6：完善细节增加质感

<img src="http://bbs.uigreat.com/uploadimgs/2016090210080321_1900392819.jpg" alt="" />

完全即兴之作，不要太纠结美观程度，我只是传达一种之作方法，你可以把主体换成其它任何东西，增加的元素也是可以换成其他任何元素，拼合型的乐趣就在于它的完全开放性，不收拘束。

拼合型是简单有趣的合成形式，做的很好可以体现很强的时尚感和律动感，只是前期的素材收集可能会稍微费一番功夫，下一期我们继续了解其他的合成形式，给大家更难一层的合成制作思路跟方法。

</div>
<div class="well">

文章来源: <strong class="mll">ChiNa_威海_山岩</strong>

</div>";s:10:"post_title";s:67:"有了这3个方法，再复杂的合成图你都可以临摹出来";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:199:"%e6%9c%89%e4%ba%86%e8%bf%993%e4%b8%aa%e6%96%b9%e6%b3%95%ef%bc%8c%e5%86%8d%e5%a4%8d%e6%9d%82%e7%9a%84%e5%90%88%e6%88%90%e5%9b%be%e4%bd%a0%e9%83%bd%e5%8f%af%e4%bb%a5%e4%b8%b4%e6%91%b9%e5%87%ba%e6%9d%a5";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-09-05 16:32:39";s:17:"post_modified_gmt";s:19:"2016-09-05 08:32:39";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=2222";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}