�ǐZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1319;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-06-28 16:53:27";s:13:"post_date_gmt";s:19:"2016-06-28 08:53:27";s:12:"post_content";s:4956:"<section class="headimg"><img src="https://pic.36krcnd.com/avatar/201607/28050904/5ccgbwhecdv8iwbn.jpg%21heading" alt="Benedict Evans：智能手机平台之间的战争结束了" /></section>
<div><section class="textblock"><strong>编者按：今天，苹果公司发表声明称销售出了第 10亿部 iPhone。智能手机平台之间的战争差不多已经结束了，苹果和 Google 在众多平台中胜利了。a16z 著名风投 Benedict Evans 通过对比双方的“最终得分”，让其他平台输得心服口服。</strong>

从全球范围来看，超过16周岁的人口数量共55亿，大约有50亿人口在都在使用移动手机（有些人有不止一个SIM 卡）。随着人口的不断增长，手机的不断普及，几年后这一数字将达到60亿。

2016 年1月，苹果公司表示，激活的设备（Mac、iPhone、iPad、iPod、Apple TV 和 Apple Watch）共10亿部（真是漂亮的四舍五入），其中Mac 9000万部（2014年初，Tim Cook 说8000万台）、Apple Watch 1000万部、Apple TV 和 iPods 分别 2000万部，iPhones 和 iPads 约9亿部。苹果卖了3.18亿部iPad，如果我们假设 iPhone 的使用期限是3年，iPad 的使用周期是4年，2015年12月，iPhone 的使用量是6.3亿部，iPad 的使用量是2.5亿部，共计8.8亿部。假设iPad 和 iPhone 的销售额从此维持在这个水平，那么总数应该改变不太大。

中国移动称，2016年第一季度共有8.3亿激活用户，其中使用iPhone用户占 15%，共1.25亿台。中国移动用户的数量占中国整体手机用户数量的60%，其中73%的人使用4G，这表示在中国三大运营商中共有1.75亿人在使用 iPhone，比美国使用 iPhone 的人数多。

接下来，我们谈一谈 Google 的安卓系统（有别于中国的某些安卓系统）。Google 在安卓方面的统计数据一直不透明，最近一次公布相关数据是在2015年9月，宣布Google 安卓用户数为14亿人，据安卓开发者的仪表盘显示，10%的用户使用的手机都是大屏幕或特大屏幕，这也暗示了，大约有12.5亿部手机，1.5亿部平板电 脑。自此以后，发展趋势如何？据大多数人估计，最近几个季度以来，智能手机销量整体趋平，低端手机（价格在50美元以下的安卓手机）销量所有提高。预测这 个销量会提高1亿部，但是可能没有这个数字高。2016年3月，Google 的安卓用户达到15亿人，预计有13.5亿部手机。

截止到2016年3月

•    6.3亿部 iPhone，2.5亿部 iPad，共计8.8亿台。

•    13-14亿部 Google 安卓手机，1.5-2亿台 Google 安卓平板电脑。

•    在中国，没有使用 Google 服务的设备可能有4.5亿台安卓手机和2亿台平板电脑。

上周，我在Twitter上发起了一个并不完全科学的民意调查，让大家猜测如今全球范围内使用 Google 安卓手机的数量是 iPhone 的多少倍，得到了以下结果：

<img src="https://pic.36krcnd.com/avatar/201607/28044715/j8qmsdjpfm89h8jo.png%21heading" alt="Benedict Evans：智能手机平台之间的战争结束了" data-img-size-val="493,325" />

这 些数字说明，科技行业向移动设备的根本性转变。每年的智能手机销量将上升至20亿部，PC 销量下跌，约2亿部，而智能手机上安装基数将上升到50亿部左右， PC安装基数将从今天的15亿部下降到10亿部。这就是为什么所行业内的资金从WinTel生态系统转移到ARM /iOS/ Android生态系统的原因。

然而，现在已经很清楚地知道，苹果系统和安卓系统的规模都足够大，可以支撑他们的生态系统，而其他系统则不 行。一旦达到了这个规模，未来市场份额的变化意义则不大了。对美国大型银行的产品经理来说，在中国有多少安卓用户已经不再重要了，对印度的产品经理来说， 美国加州有多少部iPhone也不重要了。重要的是：你的用户在哪里，你想获得什么样的用户，哪些用户在哪件事情上花了时间或金钱。

也 就是说，平台之间的战争结束了。智能手机的使用量会从25亿部上升上50亿部，但是手机数量的增长并不会影响生态系统的变化。苹果可能会获得更多的用户， 但接下来的25亿部手机中可能大部分使用的是安卓系统，之后购买智能手机的人大部分会出现在欠发达国家，他们购买的智能手机的价格会低于100美元，甚至 低于50美元。

接下来我们应该考虑到的变化来自其他的方向：一个是VR\AR，另一个是AI 和机器学习。这两者可能会打破苹果和Google 之间的平衡，但是这样会让两者之间的对比非常无聊。我已经很久不使用诺基亚、RIM 和微软的系统了，我的安卓手机和苹果手机也逐渐变得没那么重要了。

&nbsp;

</section></div>";s:10:"post_title";s:59:"Benedict Evans：智能手机平台之间的战争结束了";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:149:"benedict-evans%ef%bc%9a%e6%99%ba%e8%83%bd%e6%89%8b%e6%9c%ba%e5%b9%b3%e5%8f%b0%e4%b9%8b%e9%97%b4%e7%9a%84%e6%88%98%e4%ba%89%e7%bb%93%e6%9d%9f%e4%ba%86";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-28 16:54:02";s:17:"post_modified_gmt";s:19:"2016-07-28 08:54:02";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1319";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}