���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:788;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-23 15:41:11";s:13:"post_date_gmt";s:19:"2016-07-23 07:41:11";s:12:"post_content";s:53543:"当我们开始谈论设计时，必然是关于设计的历史。

这句话中的两个词——“谈论”和“设计的历史”——是需要说明的。我觉得不只是在设计领域，在中国，其他专业可能也是如此，就是对“谈论”的轻视，提倡所谓的“实干”，也不知何时起，从日常的语言到思维，总会有类似“务实”和“务虚”这样的区分，而这种“朴素”的实用主义的思维带来的结果就是对思考的抵制，而像设计这样与经验直接相关的活动，可以把门关得死死的，然后加入操作工形成的秘密工会。这种封闭不仅让“实践”固步自封，同时也让“谈论”远离实质，成为聊天性质的吹拉扯弹，那么说起“设计的历史”，无非是关于那“谁谁谁”以及“谁谁谁设计了这个”，还可以用上一个专业名词诸如“什么什么主义”来关上沟通和调查的大门，加入闲谈者形成的秘密工会。

设计的历史不是关于那“谁谁谁”以及“谁谁谁设计了这个”，以及“现代主义”之后是“后现代主义”。

我们会去研读过去的设计师设计了什么，这个设计又是怎样具有代表性，或许很多人会拿它作为一种符号来崇拜。但是，改变、决定或者书写历史的不是某一个具体的设计师或经典设计，也不是关于所有已作记录的设计师或经典设计，那么设计的历史的关于什么，它是关于设计，关于设计这个行为，这个行为就似一个物种一样在不断地进化，或短期内的适应性改变。如果以此视角去重新审视那些著名设计师和他们的设计，就会发现它们既是谦虚又是荣耀的。

当我们以经典设计的视角去认识设计历史时，就像很多教科书安排的那样，我们就完全抛弃了设计俗世性的一面，而另一方面，尤其是进入消费时代之后，我们完全沉浸于俗世之中，我们都是现世享乐主义者。即时享乐带来一个很有意思的现象，那些过时的产品，那些淘汰的设计，更不用说是几年前的产品，它们在现在看起来是如此的丑陋不堪，为什么当时我们会认为它们是美的呢？

在这一大堆突然变得丑陋不堪的设计中，仍然有一些我们在今天仍然可以称赞的。<span id="more-2802"></span>
<h2>不久之前的历史</h2>
我认为每个接受过历史教育的中国人都会有这样的疑问，为什么历史的讲述总是停在我们八杆子还打不着的年代，为什么不连续地一直说到昨天呢？

对于设计史相关的书的延时则更容易理解些，毕竟作者研究、书写和出版需要时间，但是我们对设计史不能与当前相连的抱怨除了时间段截取之外，还包括书籍的概括性对现世的摒弃，我们很难看到设计书是关于一般的设计甚至大众的市场上流行的设计。

而互联网改变了我们阅读历史的方式，不仅有维基百科这样的网站，更有大大小小数不尽的个人或机构网站，将你能想到的任何内容发布于网上，而我们需要做的就是从这些散落的内容中勾勒出符合自己的一张地图。而且，这些内容都是普罗的，没有中心，没有典型，没有代表的。

我们对“不久之前的历史”如此渴求，是因为我们需要找到与现在相连的节点，以史为鉴是阅读历史的主要目的，这种连接越紧密，比如我们亲身参与其中，目睹了这一段变化，我们就越能发现发展轨迹中可用来作鉴的价值，更重要的是，内容的普罗性，我们就有条件与史学家一样面对一段全谱系的材料，而不是由他们摘取的几个典型，我们可以从这些非典型的平民材料——在过去它们会被史学家忽视而消失在作记录的历史之外——发现更具代表性的价值以及与典型的对比给现时带来的启发。 比如我们去阅读和调查某一个产品的近几年历史，如果我们只看到具有代表性的几个设计，或许是因为市场或许是因为媒体而获得了这个代表资格，而忽视掉其他一般的设计，那些形成这个产品历史的基体的一般性设计，那么我们只能从那几个代表性设计上挖到一丁点有价值的东西，甚至都无法搞清为什么它们就成为了典型的原因。
<h2>Good DESIGN is timeless，好设计是永久的</h2>
要去了解一个产品或一类产品“不久之前的历史”，也不是件轻松的事，即时在互联网上可以找到几乎所有的材料，比如说我们要去了解数字消费品此前的发展历史，虽然像 Gizmodo 和 Engadget 这些网站作了很详细的记录，但是我们如果一页页去翻阅是一件不太可能实现的事，或许今后会有各种辅助工具的诞生。阅读历史当然需要压缩时间，否则我们就跟绘制 1:1 地图的寓言一样（博尔赫斯《Dreamtigers》），陷入无止境。但如果我们有针对性的去了解某一种产品，可以找到很多可作快速回顾阅读的线索，有了线索之后可以再作针对性的深入调查，实际上对数字消费品总体作回顾阅读的线索也有不少，比如像 <a href="http://www.monsterdesign.co.kr/">mONSTER dESIGN gROUP</a> 这样的网站，从 2000 年开始记录，几乎覆盖数字消费品的发展时间跨度，虽然是个人网站，但他选择记录的产品很具有代表性。

在 mONSTER dESIGN gROUP 上一年一年往回翻阅，唤起我们的亲身经历，这种经历不是指当时你也关注或详细了解了这个产品，或许现在是第一次见到，但是已经可以意识到其中的历史沧桑，这种沧桑不只是情绪上的，而是似乎我们能看到背后一条条可循的轨迹，事后的发现，因为在阅读过程中会疑问“为什么我当时不这么认为”，“为什么这个东西现在看起来这么丑”等等。

数字消费品是最容易变丑的产品，年代越久就感觉越深，每当你翻起一张老的广告，就会感慨它们在现在看来是如此的奇异，而那些年代越久远的，比如有关随身听之类的，会觉得这种产品在广告画面中如此的突兀，简直来自外星球一般，而其中广告画面中的产品比如家具却没有什么不适之感。

里面也有不少数字消费品的设计，在今天看来设计仍然是优秀和出色的，有的产品或许部分的设计或某个细节的处理，在现在看来仍觉得是考究的。

应了一句老话：Good design is timeless，好的设计是不会过时的。

但是，这句话是需要讨论的。

Good design is timeless 这句话最常见于人们对一些经典设计的称赞，潜在意思是放在如今它同样是出色的，在很多语境下还包含对当前一些设计的批判。这些经典的设计是怎样的呢？通常是教科书里的，上过设计史书的，那些经过各种媒介介绍已经符号化的设计，另外较少但也会提及的是一些佚名的类似标准化了的设计，那些已经具有一定“Archetype”（原型）形象的设计。

人们对经典设计的赞赏通常是一种符号崇拜，尤其是那些想拥有这些设计的人，我们在设计类以及生活方式类的杂志和书籍中最常见的情形是，充斥着各种教科书上的经典设计，比如那些著名的椅子，我认为里面很少可以用来作为好的例子，通常只是肤浅的符号崇拜。

那些只能从经典设计中认识到设计的人，他们并不了解设计，因为设计很重要的一面就是它的世俗性，如果剥离了一个设计的时代性，绝大多数产品就没有存在的基础了，设计的此时此地的属性如果能凑上 timeless 那也是运气。

所以 Good design is timeless 里的 design 不是指这一个具体的东西，具体的产品，而是剥离掉世俗性的部分，剩下的属于抽象的源自于设计师思想和行为的那部分内容，这部分内容脱离了功用，而是认知和智力上的共振和启发。如同那些设计和生活方式类杂志宣传的那样，将一些经典的设计应用到当前的生活场景中，主要是关于这个经典符号具有的象征性功能。

好的设计是长久的，为什么？

我们来看 mONSTER dESIGN gROUP 里的内容，主要是关于手机的，这是快速数字消费品的典型。大多数手机看起来都是“原来这么丑，那时怎么没意识到”，其中有一些仍让人感到设计出色，潜在的对比就是放在如今它的设计也是出众的，只不过人们已经不需要这个产品了，认可的是它包含的设计。当然也有一些，现在我们虽然不会这样去设计了，但在当时情形下，它也有出色的设计。

被我们厌弃的是那些太过于强调功能性的手机，比如每一个特征恨不得在外形设计上有一个特征与之对应，还有那些对流线型，比如汽车引擎盖曲线借用的那些设计，还有就是在形态上喜欢玩各种粗浅的句法的，比如渐消面的使用（washout，凸起逐渐融合到其下的表面），很多这些句法的使用后来被认为是山寨机的识别特征了。总得来说，它们给现在正在阅读的人来说，这些产品和设计，太杂乱，没有形象，感觉用眼睛去概括它都无从下手，我们都无法将各个形态组织起来，留不下印象也就记不住。

那些被我们认为仍然漂亮的设计，或许它们也有一些缺点，我们看到的一刹那，就有了一个清晰的完整的形象，比如 Sony Ericsson Z200，也不一定要形态简洁纯粹，看到 Nokia 7610 这样的手机也是立刻用眼睛可以概括出它的形象。

只要设计简洁或者容易勾勒形象就足够让一个设计长久了吗？显然不是，设计简洁的并少，比如 LG KG320 之类，有时反而因为过于简洁而无法概括起其形象，尤其是那些陷入平庸的设计，我们需要一些识别性的符号特征（signature），这个识别性符号特征不是说弄一个不对称不居中的屏幕设计就可以，或者故意强化某个几何特征来吸引人，它是关于整个形象的。

只要设计独特新颖就可以了吗？像 BENQ Qube 这样，虽然有一些类似的设计在前，但看到那一刻仍会意识到它的别出心裁，但是我们仍然很难勾勒出它的形象，或者说在我们的认知中，无法将它放心地摆放和归类，因为我们对手机的形象已经有一些条条框框，这些条条框框是无法明确描述的，但它们在制约我们对手机的认识是基于一定的理性之上的，而不是手机可以是任何形状的，任意的。

通过比较我们大约可以几个可供探索的主题，比如可以持久（timeless）的设计与形态以及人们对形态的认知有关，与产品的形象以及人们对产品形象的认知有关。
<h2>设计师与结构</h2>
不仅在工业设计领域，在建筑设计，甚至在现在的界面设计领域，关于设计师与实现设计这部分工作的关系讨论不断，比如工业设计师要不要了解结构，或者说要不要涉及结构，类似界面设计师要不要涉及前端编程等。

社会分工是不可逆的，今后也不会出现工业设计师与结构（机械）设计师结合，或者设计师完成部分结构师的工作，分工是工业化带来的细化导致的，在工匠时代，设计师与工程师以及制作者都是一体的，而将那个时期的各部分工作与现在做比较，工匠时代的设计与现在的设计，工匠时代的结构与现在的结构，工匠时代的制作与现在的制作，会发现工作的内容及其复杂程度已经无法要求单一的工作来完成了。

这种分工在工业设计上也经历了一百多年的发展，从个人英雄主义时代进入到分工合作时代，那些历史上出彩的片段都是来自于合作。包豪斯时期车间就在学校，学校在车间。丹麦现代主义时期尤其是家具设计，背后很重要的一项促进就是建筑师设计师和木匠的合作。随着工业化的发展，设计教育对工厂实践的重视，诸如乌尔姆造型学院以及 Dieter Rams 在 Braun 形成的设计师与工程师的合作，合作成为必然。

从反面看，分工也在不断加剧，就更加对合作提高了要求。如果此时设计教育认识不到现实的问题，造成的结果就是设计师在设计与工程这个关系中主动退后，而将这两项工作的合作单纯靠工作流程来支撑，或者靠设计师和工程师的私人关系来维持（可以听到很多这样的故事，比如设计师如何“贿赂”工程师让某个设计特征得以实现之类），它影响的不只是合作以及最终的结果，甚至改变了一代代设计师对设计的认识。

这正是我们面临的一个重要问题。

如果不介入设计的构造，就不能称这是设计工作。

设想一种极端情况，设计师全然不关注设计的构造，那么设计就成了一个 stylist 工作，而设计需要被制造出来，那么最终平衡的结果，就是更加保守，比如依赖与已有结构的基础上，更加朝着 stylist 方向退缩，越来越走向表面，甚至走到仅仅去改变一些装饰元素或者配色的地步。

这种与构造脱节从而走向单纯的 stylist 的情形并不少见，在设计草图上很容易看出来，有的设计草图看上去并不是为了表现一些想法，而是就为了展示手绘的技艺，这一类草图中的造型元素以及组织这些元素的句法都是直接的借用，从已有的成熟的产品中或者来自自己的记忆库之中，草图也就成了操作而不是思考。

使用三维软件来作设计并不能在构造思维上带来多少改变，即使工业设计师使用的是机械设计师的软件，以及用结构设计师操作这些软件的流程一样来塑造自己的设计，比如自顶向下还是从分件到装配。这一点与 CAD 之前时代设计师的工作有很好的对比性，在 CAD 软件应用之前，设计师依赖与手绘或模型，而手绘除了草图，还有重要的一项就是三视图等制图与效果表现的结合，而现在很多操作着三维软件的设计师恐怕很难画出自己正在做的这个设计的三视图。在所见即所得的三维环境中，不再需要费脑力去思考设计的最终形态，而在制图上如果没有事先明确的形态思考，就无从画起。

那么，构造和结构的区别在哪，为什么既然设计师和工程师的工作进行了分工，设计师还要去关注结构，或者说构造？
<h2>设计师的构造和工程师的结构</h2>
这两者是完全不同的东西。

构造是属于设计师的本职工作，它并不是属于工程师的。

构造能为设计师同工程师的合作提供广阔直接的沟通平台，让衔接更加自然。

在此前 [ i D 公 社 ] 的文章中强调了设计是关于一个物品如何制作而成的，这里面涉及的内容经过删繁就简之后可以归结到两方面，一个方面是关于物品制作和加工，生成过程中的工序，涉及的材料的状态改变等等，关于“制作而成”的物质性一面，而另一方面是关于物品从无到有这个生成过程中背后的思考、逻辑以及对物品生存形态的预计等等，关于“制作而成”的精神性一面。

设计师的构造是覆盖这两方面，设计师与工程师的沟通则通常集中在第一方面，关于设计物质形态的生成，尽管设计师与工程师在这一方面长生了交集，但在工作上没有太多的重叠，即设计师的构造在设计物质形态生成过程中的体现，与工程师的结构是两方面的内容。

工程师的结构是关于一个产品一个设计得以制造、生成和实现的具体的详细的内容，设计师的构造像是这些具体和详细内容往回推而得到的初步纲要，这些初步纲要并不能成为生产指引，甚至可能不符合工程师的结构要求，有待于工程师纠正或者细化的，之所以设计师不能放弃构造，是因为它事关设计的生成逻辑。

就是 Thonet No. 14 椅子，作为设计师，你不能只是看到它的形象，那些经过蒸汽弯曲加工而成的曲线形态，当你看到一张 No. 14 椅子的照片，就应该思考它是如何组装而成了，椅腿与座位是如何配合的，而不是想当然认为贴在一起就可以了，而且必须思考组装过程中有没有用到螺丝，如果更深一点还要大概估计螺丝的大小，认识到螺丝的存在是了解这个设计非常关键的一步，同类型的椅子有没有不用螺丝的，或许会牵扯到 Horgenglarus 椅子或者 frankfurt 椅子，可对比的还有丹麦等北欧国家的椅子设计，比如 Arne Jacobsen 的 Series 7 椅子也使用了螺丝固定，有什么不同，顺便亦可比较美国的 Eames 夫妇如何处理螺丝连接。

椅子或家具是结构较简单的例子，通过简单的例子可以看到一个产品一个设计不只是我们正常视角能看到的那个几何形态，它的逻辑它的意图它的思想等是需要由构造来支撑的。

复杂的东西，设计师就无法靠自己的构造完成结构上的具体任务了，但思考仍然同这些简单的东西一样。
<h2>设计师的构造思维</h2>
列维·施特劳斯在《野性的思维》一书中提出了两种相对的工作或思维模式，即修补匠和科学家。修补匠与掌握专门技艺的人不同的时，他总是运用一些拐弯抹角的手段，可以完成各种各样的工作，并不使每项特定的工作依赖于特定的原料和工具，而总是依赖于手边的现成之物，修补匠手边的工具与材料并不是与眼前的计划相关，与任何特殊的计划都无关，收集和保存他认为“它们终归是有用的”的零件，他投入工作的第一步是回顾性的，转向已经存在的一组工具和材料，反复清点其项目，在选择工具和材料前对它们所有提供的可能解答加以编目，然后找到一组组合。在此列维·施特劳斯借用了索绪尔的能指所指概念，指出修补匠靠这些记号来工作，所谓记号就是某件工具或材料它可以指向很多中功用，修补匠就在这些组和关系中挑选某一组来完成眼前的工作。而工程师或科学家并不依赖这些记号，而是通过概念来工作，当他接受一项既定任务时并不会比修补匠来得随心所欲，他必须先把由理论和实践的知识以及技术手段所构成的一套先前确定的组合加以编目。

在设计中这两种思维经常是并存的，而设计这项工作的属性通常在思维上会倾向修补匠式，与工程师面临的问题不同，工程师由非常具体的问题驱动，比如功能性的需求，而设计师面对的问题有时非常模糊，那么需要从已有的经验中去寻找适合当前的组和（记号和记号指向的功用），这种寻找有点像不断适配的一个过程。举例说，面对一个缺盖的圆筒，修补匠会看手边现成的材料，有一块差不多大材料也合适，他就拿着这块材料是不断适配这个圆筒，修配到尺寸合适然后可能增加一些其他考虑比如把手之类，而工程师会去先量好尺寸，根据尺寸作出盖子然后恰好可以盖上。传统的工匠的工作方式像前者，而设计尤其是工业化时代的设计要求像后者，设计师甚至可以不在现场，因为现在设计师的对象不是单一某一件物品，而是批量化的。

如果设计师没有从构造的思维来思考问题，很有可能陷入修补匠方式，修补匠思维本身并没有好坏，但如果在设计中完全依赖于这一种方式是危险的，如回到了工匠时代解决问题的情形了。修补匠模式总是在寻找合适的组合关系，适应当前情况的，依赖与丰富的经验以及材料工具的积累，这种寻找并不费时，但带来的解决方案是轻易的。不像工程师那样通过仔细测绘分析设计和制作，然后将盖子拿到现场的圆筒，充满信心的盖上，就等着“啪”的一声响，“严丝合缝！”

设计师的构造思维脱离了修补匠而走向的工程师，摆脱了对一些初级记号的摆弄而走向了借助于概念来思考，比如面对一项新的设计任务，不是对着任务说明书的几个形容词去翻自己收集的材料工具库，找到可与之对应的应用包而后直接使用，而是去梳理这个产品的生成脉络，分析权衡各种成因。

构造思维就要求设计师去理解产品的原理，结构工程师是从原理和功能出发的，设计师当然需要了解原理，我们以前文章有过讲述，大多数产品从简单的机械发展到复杂的机械到自动化到现在的数字化，产品的功能实现已经模块化，更重要的是抽象化，对于设计师来说，对原理的理解只需停留在这些集成的抽象化的模块之前，不需要再去进入这个模块去找次一级的原理，所以设计师对原理的理解是必须的。设计师对原理的理解不只是来作为规划设计的一项重要参考，更重要的是从内而外去理解将要设计成的产品，因为工作原理是这个产品的骨骼框架。

理解产品的原理，另外一层是指产品外部的生成原理，这个产品与人形成的关系，与它旁边产品形成的关系，与环境的关系，与市场同类产品的关系，等等。这些关系不是我们的设计去适配的场景，而是这些关系有迹可循，找到同产品内部原理一样明确的逻辑关系。

养成这种构造思维并不一定靠一次次的设计经验的积累，其实无时不刻都能进行，因为我们任何时候都被人造物包围着，这些产品都是既成事实，那么它就具有了生成经历，我们可以通过方方面面的线索去追寻这个产品这个设计后面的生成原理和逻辑，就像<a href="http://www.hi-id.com/?p=2716">《设计的踪迹》</a>一文中说到的那些接缝等。

我们理解了一个产品的原理，并不是说这就决定了唯一一条道路，“原理决定它必须这样”， 我们去了解原理并不是为了找到这一条道路。看看我们周围的这些人造物，它们并不是一项功能的包装物，它们处在一个系统之中。如果说我们了解原理是为了找到那一条唯一的道路，那么所有的产品就如同一个功能机体，然后一个紧密包裹这个功能机体的外壳。

对原理的认识和尊重并不会限制我们的设计句法的使用，句法就是组织元素和模块的规则，就像几个形态的组成排列关系一样，虽然有时会远离内部机理体现的那条最便捷的路线，但是操作句法是设计师的手段，是属于将功能物品化的范围之内的。比如手机如果从它那高度概括的功能入手，最自己的形态就是一个盒子加一个屏幕的表面，但像 iPhone 4 这样就使用了三明治构成形态，最终塑造了一个出色的设计。从这个例子可以看出对原理的了解不仅不是限制了设计师的发挥而是让设计师从形态的底层开始构筑。
<h2>大众并不像设计师那样认识设计</h2>
有时你可以称大众是无情和愚钝的，无视这些设计师经过努力探索取得的成果而只感兴趣于那些被认为是皮毛的东西，他们无法清晰地意识到设计的精彩之处，或者通过一些介绍引导或者偶尔的比较体会到设计师的用心之处，但这种体会不会像设计师想象的那样伟大。

这再正常不过了，因为设计师也是用户，当他是用户的时候，他也不会那么敏感，有时看到一些设计师的个人喜好或者工作室的样貌非常普通反而让人感觉到舒适，甚至对其设计更具期待性，而如果他的用户角色也和设计师角色一样，身边充斥着各种经典设计，偶像崇拜一般，就会感到一些紧张。

在前面我们提到过一个词就是“俗世性”，这是设计工作之所以精彩的一个原因，如果只在一个构想的纯粹世界做设计，估计是最无聊的一件事。如果去回顾 20 世纪设计的发展，一条明显的时间线就是德国设计与美国设计的相互对峙和交流，可以看作是纯粹与俗世之间的平衡状态的不停变化。

俗世性是关于一个设计如何被纳入一个物品与人的系统之中，如何被接受，如何被认知，如何被欣赏，如何被评价，如何失去焦点，如何被隐匿如何被再次发现。

通常会把俗世性看成设计师为了投好大众而作出的妥协，比如违背设计的纯粹性去做设计师自己不喜欢但认为大众会喜欢的设计，这里面的妥协隐含的意思是设计师主动降格，这种倾向的背后仍然是以设计师自己的视角为参照的。设计师要秉持自己的专业视角，同时需要去理解大众如何看待这个产品，这个产品如何被纳入物品与人的系统，也就是说去探索它俗世化的一面。它与降格投好、追随流行等并没有多大关系，它们只不过是进行俗世化一些直接粗暴的手段而已。

每一个人对某一件物品或设计都有自己的看法，我们关心的不是这些所有的个人看法，而是将大众看作一个整体，有时或可以约分成一个代表人，而他的看法是最具参考价值的。
<h2>不断抽象和符号化的物品</h2>
在<a href="http://www.hi-id.com/?p=2753">《设计本体性寻踪》</a>一文中已涉及这个问题，物品的抽象和符号化来自两方面的原因，一方面是物品自身的发展，有时是高度自动化之后，功能模块抽象化，物品的存在意义更多偏向了它所指的涵义；另一方面是信息社会人们认识视角的改变，进一步分散了物品的物质性，而把注意点也导向了它所指的部分。

鲍德里亚的《物体系》中有很多内容与这一问题相关。书的第一张解释了家具从传统形态转变到了现代是因为功能的解放，传统的家具受制于时代家庭关系和社会结构，对比现在，功能早就不是我们对物品要求的唯一属性，而将越来越多的注意力集中到物品形成的系统具有一定的个人（或家庭）的分身属性，私有的拥有观更加强烈，因为要让分身更加清晰，恋物的程度更加深，以消费来 curate 个人博物馆。可以视作鲍德里亚那个传统到现代转变过程的一个反向进程，不过这个反向进程是围绕着个体意志，尽管这种个体意志多少会受到社会结构的影响。而这种对个人拥有的物品系统进行打理，它与收藏是有区别的，因为物品的本质基础是其功能性。

对于物品的抽象化，《物体系》中也有一个很好的例子，是鲍德里亚引用自 Gilbert Simondon 的，说的是汽车启动从手摇手柄启动进入到电池控制的启动，书中说从纯粹的科技的角度来看，取消了手柄启动后机械工作过程反而更加复杂，这种演变是技术上的复杂化和抽象化，但却代表着进步和现代性。类似的例子我们可以举出很多，尤其是数字时代的产品同机械时代的产品做比较，对产品功能的理解，在机械时代可以一步一步完全看清楚，而数字时代的产品，需要通过一张抽象的图表来理解，在这张示意图中，有的模块根本不需要去解开，只需要关注输入输出的状态，这一点也反应到了整个产品上，除了输入输出需要关注外，其它都交给自动化了。

信息时代的发展如何改变我们对物品的看法，这里我们将物品局限于实体物品，实体物品本身并没有随着信息时代的发展而去物质化，而我们上面说的物品的抽象化是源自功能模块的集成，是因为我们花在屏幕上的时代太多了而改变了对实体物品的看法了吗，不至于这么神奇，我们指的改变，不是想当然的，而后背后有坚实的理由来支撑的。
<h2>人对物品的认知</h2>
人如何感知物品，这几乎是认知心理学的整个内容，在这我们只能就与设计相关方面作一些粗浅的讨论。

当你意识到人是如何感知物品这个问题时，就会立刻会察觉到里面充满谜，也因为这个感知过程的复杂性，也就带来了此前我们遇到的一个问题，就是大众对一个设计的认识与设计师自己对其认识的差距是如何产生。与认知心理学侧重于感知部分，我们谈论的这个主题智力参与部分同样重要，设计的认知需要经验、知识支撑的识别和分析力。

当两个人看到一件物品，他们对其认识是一样吗？肯定不一样，那么两者的认识能够重叠的，就是一样部分是怎样的内容，而不同的部分又是源自哪里？我们说看到这个物品，具体指的是什么，是它投射到视网膜上的图像吗？我们大脑又是如何对其加工，然后形成一个认识的？

对设计及相关领域影响最大的是格式塔学派，这一学派心理学是建立在对几何认知的的探索的基础上的，格式塔心理学得出了很多规律，但最重要的一条，就是对整体性的强调，所谓“完形”也就是格式塔 Gestalt 的意思，“整体不只是部分之和”，人们认识一个物品是整体性的，而不是一部分一部分然后在加起来。格式塔派认为知觉到的东西大于眼睛看到的东西。直接与设计等相关的著作最著名的就是鲁道夫·阿恩海姆的《艺术与视知觉》，完全围绕着人对几何的认知展开。

我曾看到过一些文章，就是将格式塔学派梳理的那些原则，生搬硬套与设计实践结合起来，我觉得这太过大材小用了，它启发我们自己对认知的思考，而不是如何去组织排列几何图形。

《艺术与视知觉》在第二章开始就展开讨论人是如何看到形状的，而第一章是探讨人视觉感知的一个基本点就是平衡，与相机做比较人的视觉有高度选择性，能够从复杂的事物上选择出突出的标记和特征，能够唤起记忆，能够仅凭这些突出的标记和特征形成完整的形象。区别于其他认知心理学很重要一点，就是阿恩海姆将这种选择突出的标记和特征来形成完整形象，是脱离理性和智力等高级的抽象思维的，而是一个视觉感知过程。通过这一点，我们能意识到一些形状识别的优先性，当然接着对形状的辨识和理解，那么记忆和经验也参与进来了。接着谈到认知过程中追求简化的趋向，使知觉对象看上去尽可能简单。

《艺术与视知觉》第四章是关于“发展”，从儿童画讲起，这部分内容也非常具有启发性。儿童早期绘画与儿童实际看到的东西为什么不一致，阿恩海姆对几种观点提出了反对，比如认为儿童画的是他认识到的基于理智的，比如因为技术不够或者兴趣不够等，他认为儿童画出的形象就是他看到的，从视觉经验不同于视网膜上的投影出发，比如对“三角形”的认识是不需要加工能得到的概念，儿童画是简化的一般结构特征的作品，就是他说看到的，当然看到的不只是他所画的那些。

阿恩海姆认为知觉是形成知觉概念的过程，是对物体一般性结构特征的把握，比如看到人头是就能认识到圆形了。

《艺术与视知觉》关于儿童画的很多内容都能勾起我们的回忆，能过记起当时画画时的一些困惑，以及如何一步步进步到会画清楚重叠关系，刚开始尝试画立体时是如何不适应等等。而在这，可以启发我们对自己认知事物的思考，以及回到我们的主题，如何认知设计。

当我们有意识地去注意时，我们会惊奇于我们眼睛认识物品是如此之快，而且准确，对熟悉的事物更是如此。如上所说，人的认知过程中有一个简化的过程，把它从背景中提取出来，识别出它的轮廓，通过一些标记和特征来形成完整的形象，而且记忆和经验参与其中，帮助快速认识这个物品。
<h2>信息左右认知</h2>
信息时代让人对物品认识这个组合中的物品更趋向符号化。

一方面，我们注意力的改变，更多的时间花在信息的获取上，占用了对实体物感知的时间份额，更重要的是，触觉体验的降低，进一步丧失了对物品物质性的感触，使得物品在这组关系中更加平面和抽象化。

更重要的是，信息直接作用认知。

可以分成两种情况，一种是长时间性的认识，正因为我们放弃了自己的感知而转向信息，这个信息可看作是人类智慧的结晶，它是正确可靠的。我们说到物品符号化的另一个内在原因是功能的抽象和集成，使我们对物品的关注只在乎输入和输出两方面，而我们放弃对物品的亲身体验也推动了我们对物品原理认识的放弃，我们不仅不再拆卸物品，而且工业时代制品的可靠性让我们完全忽视其工作原理。在这种情况中，可以将信息看作是一股分离人与物接触的力量。

另外一种情况是更隐蔽但同时也是信息左右认知最主要的力量，在上面阿恩海姆说到过记忆和经验参与进认知参与我们看到某个物品的当时，当我们看到一个物品，我们视觉上的对标记特征等的获取并形成一个完整的形象是我们对其认识的最初一部分，而随之而来的是我们有大量的基于信息的经验。而更进一步的是，当我们接触物品之前，我们头脑中对某个物品已经有了认知，有了轮廓。并且还可以再往前进一步，在我们接触某个物品之前，我们头脑中虽然还没有这个物品的清晰的轮廓，但是已经有了这个轮廓的负型，等着把这个空缺的轮廓填充上，形成这个空缺的轮廓是什么，它可以是各种信息，也包括观察者个人的愿望等。

信息给认知带来的改变，只要比较一下两代人之间的认识差异就可以看出，我们上一代关注集中在物品轮廓内，而随着信息时代中成长的一代，在这个物品的轮廓外有太多的内容，以至于有时能完全忽略掉轮廓内的东西。
<h2>一种新的构造思维</h2>
当我们将目光聚焦于实体物品的物质性，探讨它的生成逻辑时，我们需要构造思维去从底层开始构筑这个设计，而不是仅凭着经验描绘一个然后想办法合理化再拿到用户那去碰运气。那么当我们意识到物品的符号化之后，以一个更广阔的角度来构思这个产品时，我们仍然需要构造思维，而不是以猜谜式的答案去适配。构造思维源自对设计过程中理性的探索和分析，它并不是可直接套用的方法和工具集，而是一种认识视角和思维方式，它的基础来自物品的人造属性。

构造符号同构造实体一样是一个基于理性的生成过程，符号是客观的，不管支配作用它的因素是如何之多，都无法将人的主观意愿加于其上，好比人们看到的事实是基于认知，你可以为人们提供一个新的认知角度，但无法生造一个没有立足点的视角。

符号的构造并没有远离物质性，因为那时符号的基体，只不过符号的构造将重点放在它的识别及涵义指向等工作内容上。

实体的构造的一个具体的内容就是结构，而符号的构造的针对的是人的认知，它的理性并不存在内部，而是存在于对外部生成环境的分析上。提到生成的外部环境，可能会和传统的设计流程中的诸如市场调查这一类工序混淆，符号的构造思维与这完全不同，它并不能靠市场人员等来完成，市场人员有信息但是他们并不介入符号，符号是设计的内容，它和油泥模型一样具体。

或者有人会将符号的构造与平面设计比如 VI 及品牌设计等同起来，可能是受“符号”这个词的影响，这里的符号不是指一个图标，也不是指一个外轮廓，而是物品的认知形象，甚至它可以是不具形的，因为如上所说，信息时代已经可以让人们在没看见一个物品时产生认知。但是，因为在符号学上的共通性，有很多平面设计中的经验值得借鉴。

因为物品的抽象化，与人相关的只有输入输出，所以让一部分产品设计看起来如果包装盒子，而这一点能够与品牌设计相关联，类似 fuseproject 等的设计，有非常强的品牌识别性，但有的对品牌识别方面的强化让人容易和包装设计联系起来，不仅设计连产品都让人感到没有重量。在包装设计中常见的一种手法，就是通过一些设计中几何呈现的手段或句法，比如在简洁的背景中对某一个几何图形进行强化，如果没有其他很强的背景成因支撑，这种手法不是来自构造思维，如果在产品上出现，它将会冲散产品的形象，让产品不够具形化，那么这对于人们的认知来说，反而增加了困难，即使它在第一眼被看到时候具有视觉吸引力。具有识别性不是符号构造的真正目的。

符号如果借用索绪尔的词语有能指（符号本身形式）和所指（符号指向的涵义），我们构造的是符号，这个符号能指向涵义，我们能勾勒出这一条条指向，而我们并不构造涵义，涵义是我们发现的，我们借用这个发现发过来生成这个符号。设计师的流程不是这样：情绪高涨开始画草图，画着画着发现这个形状不错，或许用来做某某很合适，然后去找生产这个某东西的厂家。并不是说这样就一定设计出坏的设计，而是说这种思维方式是不符合“设计”这个词的。

我们关注符号的本身形式（能指），那是我们的原点，是与实体看待物品的传统视角相连的桥梁，而“构造”这个词强调符号的生成过程，就和实体物品视角一样，物品的内在逻辑决定物品的形式，而符号也是如此，所以先有符号再补充生成逻辑是不能成立的。
<h2>轮廓、整体性和 iconic</h2>
一个物品要被人感知到，它需要能从背景中分离开，关于图和底的关系是格式塔心理学探讨的其中一个重要主题，如果我们从大自然中动植物的伪装术来看，物品要被人感知就必须具形，诸如 Edgar Rubin 的研究说明一个封闭的形状容易让人将它与背景区别开，面积小的作为“图”大的作为“底”。从上面介绍的《艺术与视知觉》中关于儿童画的发展，以及我们感知中通过突出的特征和标志来识别来形成罗阔，我们可以说，至少站在认知者的角度看，轮廓是物品被认知最直接和最重要的因素。

轮廓有简单的，简单的轮廓不需要费力去概括，但或许因为在特定环境中缺乏识别性而难以被人察觉，比如在其他物品甚至同类物品的映衬下，这个映衬并不一定要在现场的，比如市场上同样的产品具有的不同设计，那些轮廓简单的或许因为平庸而难以被人认出，那么这个不易被识别性在它独处的时候仍然存在。轮廓也有复杂的，可能很难描绘，但或许因为它整体形成的张力可以让人用其他特征来代替轮廓，比如颜色，甚至可以用别的东西的轮廓来指代，比如“流线型”等。

识别性是作为物品或作为符号使其能让它不仅能从背景中分离出来，以及同其他产品区别而开的决定因素。如果单纯地追求识别性，则是非常容易的一件事，我们可以在设计的形式上稍加变化或者彻底变化，都能一下在提高它的识别性，保守一点的，类似那些以品牌设计立足点切入产品设计的方式，在设计中添加一些可提高识别的标志或形态，甚至还可以将这个形态与功能结合对自己“轻浮”的身姿稍加掩饰，类似 Nook Tablet 的左下角的设计等。这种有意识的识别性增添设计随处可见，比如像开头说的 BENQ Qube 这样的设计，尤其是右上角这个形式的过渡，早已经是被滥用的一个形态，但很多设计师钟爱摆弄这些形态句法，是因为这些手段是获取识别性的便利手段，在这中情况中，识别性的元素就代表着设计，虽然现在已经不流行像 BENQ Qube 右上角这样的形态了，但它们会变成另外一种形式风行一阵接着再变。如果带着寻找这些“设计”的意图去看像 mONSTER dESIGN gROUP 这样的网站，会很有收获，可以马上就收集一堆，然后应用到自己的设计中去，可行吗？或许，但很有可能过时了。识别性不是我们最终目的，否则设计成为争奇斗艳的节目了。

我们在回过头去看看像 mONSTER dESIGN gROUP 这样的网站，从这些年的产品历史中选择出一些优秀的设计，去分析它们因为什么而优秀，在这我们只是针对设计，而且侧重于视觉认知部分。

拿这些出色的设计去对比剩下的那些，很明显的感觉就是清晰明确，所谓清晰明确指的是我们眼睛可以一下子对它进行概括是识别，它们有清晰的形象或者轮廓，可以从背景中分离出来，识别性是来自于整体形象，而不是那些为了识别而添加的识别性元素。

格式塔心理学强调的是“整体不是部分之和”，完整的形态，要使一个物品具有清晰的轮廓，它就必须受一个向内的力牵制而绷紧轮廓，也就是我们称的“具形”，那么这个内向的力来自什么，来自于内外一体性，也就是《设计本体性寻踪》探讨的主要内容，一个内外逻辑合一的产品（通过构造思维）呈现而出的是它的整体性，而不是部分之和，或者是一个内部结构加上刻有识别性符号的外壳。这个内向力是这文章生造的吗？其实如果从机械结构的角度去分析，它当然有这种内向力，否则就散成部件了。这里所说的内向力并不是凭空而造的，它是源自人们的认知积累，正因为有了这种积累，而且在认识这一物品的过程中它在不断积累，我们才有条件可以去认识一个物品，而如上分析随着信息时代的到来，这种认知积累达到了新的层面，所以当一个人去购买一个物品时，他是已经空出了一个轮廓（差不多具形了）。所以，这个内向力不是这里生造的，而是来自人们（整个社会）的预先认知基础，从字面意思上来说，内外一体性指的是外在与结构，但这组关系是包含在预选认知基础之下的。通常人们第一眼察觉不到一个东西的外部和内部是不是一体，是紧绷的还是敲上去会空荡荡的，但是人们认为内外必须一致，必须紧绷，在他接下来的接触时间中，这条要求会一直在作用，直到被证实后再去评价它的紧绷程度。

<a href="http://www.hi-id.com/?p=2340">Hans Wegner</a> 一生设计的椅子超过 500 多条，而我们看到的和讨论的只是其中少数几条椅子，而其他椅子甚至在网上很难找，你可以在一些拍卖网站比如 <a href="http://www.lauritz.com/">Lauritz.com</a> 上找到一些（可使用 Google 的<a href="http://goo.gl/zJJ5Z">站内图片搜索</a>也查找那些已终止的拍卖），会发现很多我们可以用“普通”一词来评价的产品，是因为这些“普通”的设计不被媒体报道而让我们认为普通吗，对于这个问题可以通过事先不认识这些设计的人来调查测试，其实这个调查测试已经完成了，那就是市场。那么这些普通与优秀的作品之间区别是什么？与工艺和内外一体性关系不大，因为在椅子身上对内外一体性要求并不是很广，而工艺在这我们不用作任何怀疑。那么，看上去这是完全关于形态。

一个词来形容 Hans Wegner 的那些著名的设计，就是“iconic”，日常使用中这个词的意思指的是著名的、流行的代表作，但在评价一个设计是 iconic 的时候可以指那些并不著名的，所以在这是它更原始的意思，像符号一般。符号（icon）的特征是极高的识别性，正因为识别性之高，它具有独一无二的原真性。

iconic 这个词容易让人认为它是出挑的，不够谦虚之类，而曾提出 Super Normal 以及将谦逊贯穿其设计中的深泽直人是如何描述自己的设计的，在这个<a href="http://www.dezeen.com/2013/05/14/naoto-fukusawa-muji-bb-italia-milan/">视频访谈</a>中深泽直人说到他努力去设计 iconic 的东西。而 iconic 这个词非常适合来描述深泽直人的设计，因为现在的 icon 设计师都拿它们来作为描摹对象。icon 设计是描摹对象不只是深泽直人还有 Dieter Rams 以及很多经典的设计，这些设计的共通点就是 iconic，并不是因为他们有名，而是因为它们的形态。

iconic 是关于形态的，如果来研究深泽直人和 Dieter Rams 的设计，从形态学的角度去分析，会发现很多相似点，清晰的轮廓和边界，考究的圆角，就像一幅简洁干净轮廓线草图一样，平面的，没有体积感，就是 icon 一样的。而 Dieter Rams 的草图就是这样的，他为什么不用排线会阴影，因为<a href="http://www.icsid.org/feature/current/articles849.htm">他的老师 Rotfuchs 对他说</a>：“Forget that nonsense, you just need to make the line a bit thicker, you can achieve spatiality that way, too !” Dieter Rams 的发表草图或许并不是设计之初的草图，但是反映了他的形态思考方式，而且和那一代的设计师一样，基本都是绘制三视图，而很少有透视图。那么深泽直人了，他的草图虽然很少见，但是他的产品都非常强调三视图，透视角度的照片只是辅助。假如再回去探讨绘画的发展，古埃及壁画中侧面与正面的综合使用，到儿童绘画的发展，在结合我们自身的实际经验，不难发觉，我们对轮廓的认识是有方向性的，而正面和侧面是最能概括轮廓的。

我们对物品的认知过程中是相当概括的，它不是类似相片的视网膜上的图像，而是一种图形，一个设计的内容也不可能一下子被人认知到，对一个物品的认知是一个持续的过程，但类似图形的那个符号一直担负着我们头脑中指代某物品的代理者的角色。界面设计中的 icon 也是如此，icon 的存在意义不是本身是否美味可食，而是它指向的准确无误性，iOS 7 的图标设计无疑降低了前者的份额，对比一下前后“电话”的图标变化，用眼睛掌握这个电话的图形明显是 iOS 7 快多了，iOS 7 的<a href="http://www.flickr.com/photos/nielsboey/9024109783/sizes/o/in/photostream/">电话图标</a>并不只是变简单了，诸如减少了听筒和话筒上的一个形态转折（对于一个系统的图标来说，不需要这些没有符号价值的残留实体痕迹），如果要从设计上来说，所要付出的设计考虑 iOS 7 的要多不少。

对于 iOS 7 的电话图标来说，这个轮廓就直接指向了电话应用（及这个应用的界面），但在产品之中没有如此简单和一步到位的指向关系，因为对物品来说，这个轮廓是观看者提取出来的，而不是物品就是这个轮廓，所以轮廓的指向，尤其在观看的当时，是到达更具体的形态的，而在离开那个物品时，我们在记忆中将描绘轮廓的那个图形指向那个物品所指向的。

那么 iconic 的产品指的在被认知的过程中容易被人们识别并提取概括一个符号，而这个符号是排他性地指向这个物品。

以上我们在讨论符号的本身形式，那么如何来构造这个符号，什么是符号的构造思维。
<h2>设计类型学研究</h2>
所谓符号的构造思维，是指反向构筑符号的轮廓，好似将一个物品从背景中去掉，留下空白部分和轮廓，而构造思维就是对背景作研究和分析来找到这条轮廓，有了轮廓也就构造了这个设计。

物品实体部分的设计，我们有各种要求和限制（它们就是轮廓的外侧），所以反倒容易入手，而符号的构造看上去无迹可循，难道我们是通过市场调研人员的一些数据来勾画一个模棱两可的结果？市场人员的数据对于我们构造符号所需的材料是很小的一块。我们的分析和研究是站在设计这个立足点上的，可能我们了解一些市场数据诸如某款产品的销量，但我们不了解专业的市场数据，因为它们之于设计并没有多大意义，对设计有意义的是人与物的关系场。

对于设计师来说，类型学研究是最好的工具。

构造思维反对设计师想当然的工作方法，认为单靠经验以及类似修补匠式靠平时积累的那些材料、工具和模板是不够的，而是对生成环境进行理性的探索和分析，这种理性和逻辑来支撑设计但好不干扰设计的创造性，因为物品的符号化让它的生存环境更加宽广和复杂，我们需要通过构造性的思维来应对新形势。

类型学研究的基础是案例分析，调查同类产品或者去拆解或者逆向在平常的设计过程中也是日常工作，虽然多数情况这份工作的质量不受重视比如逆向并不是为了追求 100% 复制而去，这些日常性的工作还不能称是案例分析，如果以市场调研人员式去作案例分析，那么内容是关于这个产品的一切数据，但设计师的案例分析的中心是设计，对每一个形态每一条线都去作分析，分析不是为了猜测设计师的当时心中所想，而是对一个既存形式及其意义指向的调查。分析组成元素分析结构是一部分工作，另外一部分是通过对整体形象分析去确立这个产品在人与物之间是怎样的关系，人们怎样来认知这个物品，它给人们头脑中留下的轮廓是怎样，等等。

类型学研究指的是案列的并列对照分析，当将两个及更多的同一产品的不同设计放在一起分型，并进行对照分析时，我们能够整理出背后的很多脉络，如果是具有历史先后顺序的，我们可以得到一个历史发展的维度，如果是同时期的，我们可得到一个社会认知的大概。当对照分析时，可能会认为选择样本的差异会影响分析的结果，但如果仔细是解开这些产品，会发现背后充满的逻辑和理性，甚至我们可以忽略掉设计师的个体性努力和表达（除非是为学习和累计一些小技巧）。

类型学研究并不一定是已有案列的研究，它还可以是方案研究。我们设计一个产品，可能从某种程度来说是全新的，没有同类的旧有产品供研究，但人是不会改变，所以我们仍可以通过类似行为类似产品的分析中去摸清部分的轮廓背景，然后同方案结合去描绘剩下部分。保持开放性是避免落入生硬的制式的保证，这也是我们研究类型研究多个案例，不是为了去彻底搞清楚这个产品，而是为了背景，这也是这里所说的类型学研究与其他类型学不同之处，我们寻找的是轮廓的外侧。
<h2>物品符号化时代的人文精神</h2>
弗兰姆普敦在《现代建筑：一部批判的历史》中写 Henry van de Velde 一章时，介绍了 Velde 对两种装饰的区分 ornamentation 和 ornament，前者是外加的与对象无关而后者是由功能结构决定的，与对象结构是一体的，Velde 将后者即“功能性装饰”同手工艺中由工匠手势决定的工艺线相对比，是人制作物品的必要痕迹，承载了创作者的力量和能量，弗兰姆普敦写道对 Velde 来说，这些线条是没有字母的文学。

现在我们身边手工艺制品已经几乎不可见了，我们失去了这种没有字母的文学了吗？无论你持有怎样的观点，有一点可以确定的时，物质性的实体是人类文明的守卫者，无论我们怎样去构造符号，设计的物质性及其<a href="http://www.hi-id.com/?p=2753">内外一体性</a>是物品符号化时代的人文精神。";s:10:"post_title";s:30:"一种新的设计构造思维";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:90:"%e4%b8%80%e7%a7%8d%e6%96%b0%e7%9a%84%e8%ae%be%e8%ae%a1%e6%9e%84%e9%80%a0%e6%80%9d%e7%bb%b4";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-23 15:58:04";s:17:"post_modified_gmt";s:19:"2016-07-23 07:58:04";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=788";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}