�ːZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1057;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-05-26 19:26:37";s:13:"post_date_gmt";s:19:"2016-05-26 11:26:37";s:12:"post_content";s:11586:"<div id="article_con" class="article_con">

有时会很后悔，当初刚毕业决定进入广告行业时没有这样深度的思考，没有形成自己的一套学习体系和知识架构，走了很多年弯路。不过还是那句话，当你发现为时已晚，其实是最早的时候。初中时最喜欢的一句英文：Better Late Than Never与你共勉。

来源：<a href="http://mp.weixin.qq.com/s?__biz=MzA4ODY3MjM1Ng==&amp;mid=2650593018&amp;idx=1&amp;sn=1dce3c10bc4069a10aa0453ea2a8f51a&amp;scene=24&amp;srcid=0722t5ZjIe7B8OAHx7n5p5GZ" target="_blank">们店</a>（ID：men_dian）
作者： NJ安可
原标题：别废话！文案策划到底如何学习提升

今天来聊聊无论是文案策划的从业者还是相关专业学生都适用的自我学习方法，其中有几项是我在广告公司工作时就一直保持的习惯，对我来说受益匪浅。如果是刚毕业，马上针对自身情况进行系统学习，不至于像我如今这样惋惜后悔，如果你还没毕业，在课堂外有一套自我的学习方法，形成学习习惯，在毕业后也能够迅速在职场找到自己的定位。
<h2>我将其归为三步：</h2>
<img class="load" title="我用5年经验告诉你，写文案就这3个步骤..." src="http://file.digitaling.com/eImg/uimages/20160722/1469188207674347.jpg" alt="我用5年经验告诉你，写文案就这3个步骤..." width="640" height="236" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160722/1469188207674347.jpg" />
<h3>1、Learning 学习</h3>
<h4>①  制定学习计划（按年、季、月、周）</h4>
并不是所有文案策划都是广告、中文或营销专业毕业的，即使占了其中一个专业，另外两个专业的很多必修课也是其并不擅长的。一旦选择了文案策划这条路，就注定活到老学到老，也算是条不归路。那么，如何利用晚上时间有规划的进行学习呢？

我的方法是：像上学制定课表一样，制定你的学习计划。同时，这个计划也像大学的教学大纲一样，由低阶到高阶进行晋级，有学习有实践，还能进行自我考核。

通常，根据个人的职业目标，制定一个三年的学习计划。假设自己大学刚毕业初入职场，做文案策划工作，三年后计划成为市场部经理，或成为一个以文案策划为主要技能的优质斜杠人。那么，先来了解这两个角色所需要掌握的知识和技能。

（PS：为什么是三年不是五年呢？人家政府部门的计划都是五年一定的呢？因为呢，互联网时代变化太快了，今天你以为的目标，过几天出个新行业、新岗位、新定义，之前定的方向可能会立刻被搅乱。比如以前我在音乐论坛做音乐节目，但是现在谁还逛音乐论坛；比如过去我做过电子杂志，但现在更多的内容通过H5展现，那么我们的目标也要紧跟时代发展步伐。）

有了学习的大方向就可以按时间来进行计划了，按照年度、季度、月度和周度来计划。一年达成什么样的目标，然后逐次拆分细化下去。

<strong>比如我近期给自己定的季度命题是广告。</strong>
<ul class=" list-paddingleft-2">
 	<li>看8本广告书；</li>
 	<li>出街3篇硬广和3篇软文；</li>
 	<li>写三篇与广告写作有关的公众号文章；</li>
</ul>
目前都在按部就班地进行中。
<h4>

②  学什么</h4>
有了目标知道自己要如何列学习计划，接下来就要知道自己学些什么？

<strong>按领域来分：</strong>

以我个人为例，（也算是这两年才清晰自己的职业目标，没办法，世界变化快，斜杠人这个名词不也是今年才大火的么~）我希望自己在三年内能够拥有这样的标签——

商务PPTer+广告文案+公众号原创作者+个人管理培训师

那么以此标签来看，我需要学习的领域包括：
<blockquote>广告、写作、演讲、PPT设计、营销、管理、个人管理、消费者心理学、行为学、新媒体营销、公众号营销、个人品牌营销、粉丝营销、平面设计、培训、媒体、创意、逻辑、市场营销、编辑出版……

太多了就不一一拆分了，比如写作还可以拆分成书评、影视脚本写作、广告文案写作、汉语修辞、语言学、新闻写作、软文写作等。</blockquote>
<strong>
</strong>

<strong>按内容来分：</strong>

以广告领域为例，一般分为理论、方法、经验或案例、趋势这四大类（其他领域也基本差不多）。那么如果通过读书来学习的话，你基本可以知道要买哪些种类的书来读了：
<ul class=" list-paddingleft-2">
 	<li>理论类：《广告学》、《设计心理学》、《广告词的语言魅力》</li>
 	<li>方法类：《广告文案》、《文案训练手册》、《你的创意逊毙了-解开广告创意的72道枷锁》</li>
 	<li>经验或案例：《一个广告人的自白》、《设计师不读书》、《小丰现代汉语广告语法辞典》、《文案发烧》</li>
 	<li>趋势类：《DT时代》、《人工智能狂潮》、《狩猎式创新：如何让你的创新思想源源不断》</li>
</ul>
<h4>③  在什么渠道学</h4>
<ul class=" list-paddingleft-2">
 	<li>微课：如果你有心，你每天都可以找到平台类或社群类公众号办的网课，大部分免费。选择自己喜欢的内容来听，像大学时参加各行各业大咖来做讲座一样。比如我常听的：馒头商学院、插坐学院、轻松冥想、选择自己、橙子school……</li>
 	<li>网课（慕课）：网课不同于微课，如果说微课像大学时候的讲座，那么网课就像选修课，大多为成体系的课程。网课平台也有很多，我只在网易云课堂听过课，MOOC也不错。贴一个我收集的慕课平台，大家可以都了解一下，有的针对的方向比较专业，所以挑适合自己的来学。</li>
</ul>
<img class="load" title="1469188594493471.png" src="http://file.digitaling.com/eImg/uimages/20160722/1469188594493471.png" alt="2.png" data-original="http://file.digitaling.com/eImg/uimages/20160722/1469188594493471.png" />
<ul class=" list-paddingleft-2">
 	<li>公众号：关注和自己专业对口或和自己工作相关的公众号。</li>
</ul>
广告类我关注的公众号且每篇更新我必看的有：广告文案、广告狂人、华与华、老金扯谈。其他还包括4A广告门、4A广告提案网、文案君、顶尖文案、销售与市场、小马宋、六发子弹……

PPT方面我关注的公众号有：幻方秋叶PPT、我懂个P、旁门左道、曹将PPTao……（目前公众号没有分类管理和浏览的功能很不便啊~）
<ul class=" list-paddingleft-2">
 	<li>书籍学习：这是最简单易行且不受时间限制的学习方法。知道了自己要学什么，只需要找专业类的书来读就可以了。选书就参照上文所述的：理论、方法、经验和案例以及趋势这四个方面，做到全面并具有前瞻性。</li>
</ul>
<h3>2、Accumulation 积累</h3>
<h4>①  建立自己独有的灵感库</h4>
无论你做什么工作，都建议你建立属于自己的灵感库，它可以帮助你在接到新工作的时候可以马上拿来参考，不至于不知所措。

<img class="load" title="1469188612984749.jpg" src="http://file.digitaling.com/eImg/uimages/20160722/1469188612984749.jpg" alt="3.jpg" data-original="http://file.digitaling.com/eImg/uimages/20160722/1469188612984749.jpg" />

以文案策划来讲，我建议按如下内容进行分类：

<img class="load" title="1469188625932676.png" src="http://file.digitaling.com/eImg/uimages/20160722/1469188625932676.png" alt="4.png" data-original="http://file.digitaling.com/eImg/uimages/20160722/1469188625932676.png" />
我一般会把词、句、段子、方法这样的文字内容记在本子上，图片类的放在电脑里，杂志上看到的觉得可能会有用的内容要么裁剪放在文件袋里，要么手机拍照同样存在相应文件夹里。
<h4>②  建立品牌的案例库</h4>
案例库可以按照四个方面来建立——
<ul class=" list-paddingleft-2">
 	<li>各行各业：采集不分行业，是好的就收入囊中，包括文案、排版、设计、方案等；</li>
 	<li>大品牌：品牌战略案例。我大部分通过《第一财经周刊》、《销售与市场》、《新营销》等行业杂志获取，另外就是书籍上的。</li>
 	<li>竞品：多参加行业展会，现场拍照。关注服务品牌竞品的公众号、微博等自媒体渠道获取更多资讯。</li>
 	<li>2-3个你特别喜欢的品牌整套案例：这部分内容是依照自己喜好了，比如我比较关注NIKE、锤子、杜蕾斯、麦当劳的文案、宜家的图片、中信出版的所有作品、华与华策划的所有品牌的案例。我会从各个渠道搜集他们的相关内容，等着他们的自媒体更新。所以在很多自己服务品牌的内容策划或设计上会马上举出他们的例子来作为说明示意。</li>
</ul>
<h4>③  建立灵光一闪的念头库</h4>
脑袋里充满奇思妙想，这种东西怎么能轻易让它飘走，必须果断存下来，没准什么时候就能用到呢。一般我看书和杂志的时候，逛微博的时候和逛街的时候比较容易产生点子。所以我要么马上记在灵感库的本子上，要么记在手机里，回到家再做具体整理。

当然，你做的梦、一句电视剧里的台词都可能成为以后会用到的一句标题，一个产品名称，一个画面设计，所以，马上记下来啊。
<h3>3、Practice 练习</h3>
学习最重要的是学以致用，如果你目前有服务的品牌，通过多种形式进行演练那最好了。如果你是在校生，就可以模拟你正在服务某品牌，并根据所学进行演练。

<strong>练习的四个方法：</strong>

<img class="load" title="1469188719838032.png" src="http://file.digitaling.com/eImg/uimages/20160722/1469188719838032.png" alt="5.png" data-original="http://file.digitaling.com/eImg/uimages/20160722/1469188719838032.png" />
<h4>
① 模仿练习</h4>
<ul class=" list-paddingleft-2">
 	<li>关注热播广告，挑特别喜欢的形式，为自己服务的品牌改编一个广告；</li>
 	<li>选择自己喜欢的一个品牌活动，为自己服务的品牌按照这种模式做一场活动，看如何细化它，并满足该行业特色；</li>
 	<li>找一个个人品牌做的好的人作为榜样，分析他的CIS，建立自己的CIS。</li>
</ul>
<h4>② 挑刺练习</h4>
<ul class=" list-paddingleft-2">
 	<li>关注热播广告，挑觉得不好的改写它；</li>
 	<li>看一本书的书名，假设自己写这本书目录如何写，每个篇章如何架构。</li>
</ul>
<h4>③ 创意练习</h4>
<ul class=" list-paddingleft-2">
 	<li>逛超市，给货架上新添置的产品写一句广告语。</li>
</ul>
<h4>
④  互通练习</h4>
<ul class=" list-paddingleft-2">
 	<li>了解你身边的朋友（普通消费者）对近期热播广告的看法，和他一起讨论；</li>
 	<li>将你写完的文案读给你身边的朋友（普通消费者）并听听他的建议。</li>
</ul>
方法具备了，最重要的就是坚持，专注于你的目标，坚持不懈，总会收获。

</div>
<div class="mg_t_30"></div>";s:10:"post_title";s:56:"我用5年经验告诉你，写文案就这3个步骤！";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:164:"%e6%88%91%e7%94%a85%e5%b9%b4%e7%bb%8f%e9%aa%8c%e5%91%8a%e8%af%89%e4%bd%a0%ef%bc%8c%e5%86%99%e6%96%87%e6%a1%88%e5%b0%b1%e8%bf%993%e4%b8%aa%e6%ad%a5%e9%aa%a4%ef%bc%81";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-26 19:27:09";s:17:"post_modified_gmt";s:19:"2016-07-26 11:27:09";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1057";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}