�ːZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1432;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-06-01 15:54:04";s:13:"post_date_gmt";s:19:"2016-06-01 07:54:04";s:12:"post_content";s:21875:"<a href="http://weibo.com/u/1833937113" target="_blank">@C7210</a> ：任何从事互联网设计工作的同学或许都听说过Jeffrey Zeldman的大名。作为现代互联网标准的最大贡献者之一，他在Web这个行当里做事的时间怕是比我的活过的年头都长。

能对他进行访谈，并将他对职业、生活及互联网设计的深挚热情分享给各位，对我来说是非常幸运的事。

本文即面向新人，同时也会使多年的老手感到共鸣和启迪。Jeffrey的回答不仅在设计方面具有教育意义，而且充满了个人化与直率的色彩，内容值得反复阅读和回味，对Web设计及其历史发展轨迹富有真挚情怀的设计师们不可错过。

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2015/11/05-ux-ui-designer-interview-list-apart-circa-1999.jpg" alt="05-ux-ui-designer-interview-list-apart-circa-1999" width="700" height="700" data-bd-imgshare-binded="1" />
<h4><b>Q：您是什么时候进入Web领域的，为什么会对这个行当感兴趣呢？</b></h4>
我1995年的时候正在广告行业当中做事。我们的客户，华纳兄弟的Donald Buckley希望推广他们即将上映的电影“永远的蝙蝠侠”。我当时想，或许可以在那个叫做万维网的全新信息媒介上做这部电影的主力推广工作，感觉很合适的样子，而且挺有意思，让人想想就兴奋。

毕竟，蝙蝠侠本身就是geek类型的超级英雄形象；还有什么媒介会比这样一个新兴的、神秘的、似乎只有电脑狂人和大学生才掌握的数字化平台上向蝙蝠侠的影迷传递信息来的更酷呢？

Donald当时问我们会不会做网站。我们骗他说会。三个月之后我们完成了batmanforever.com。当时来看这个站还不错，有着大幅的全屏背景图片以及动画闪屏（三年之后Flash动画才真正成了气候），主题化的界面元素以及基于故事情节的导航结构和内容，包括字体选择和元素之间的间距关联等等也都在设计考虑的范围内。

要知道，客观来讲，在1995年的Web行当里你很难认真追求这些东西，但是我们就是无知无畏到会去做这些。

那一年，全球互联网用户人数是三百万，其中有一百五十万人会访问我们的站点。我本人当时属于那种，常年试图通过自己的音乐、文字和插画来吸引人们的目光却始终不得志的艺术家，所以看到这样的访问量我真的惊呆了 – 它竟然能吸引到如此量级的高质目标群体。此外，我着迷于万维网这个平台将设计、写作和科技这三种我挚爱的事物融汇在一起的强大能力，于是我义无返顾的全身心投入其中。
<h4><b>Q：能否请您概括一下从上世纪九十年代直到今天，Web设计领域当中发生的重大变革有哪些？或者换一种说法，在您看来，Web/UI设计是否一直在朝着某种终极方向发展着？</b></h4>
在那个年代，我们一直生存在某种对立的局面当中 – 一方面是对于精彩丰富的互动性及视觉外观的渴望（只能在一部分浏览器当中实现），一方面是对于能适应各种平台环境的界面的诉求（当时即便能在一定程度上实现，也无法同时兼顾外在表现，致使样式方面极度乏味）。

而如今，我们有力量为所有人创建更具适应能力的Web了，不管他们使用着怎样的设备平台或网络连接。无论你以怎样的形式联网，都可以访问到这个Web当中的丰富内容，而你在互动和视觉方面的体验也会随着所持设备的不同而动态调整。

过去，我们谈论的是“优雅降级（graceful degradation）”：在相对标准的浏览器环境中，页面会以“完美”的形式呈现出来，而在差一些的的浏览器当中只提供“可以接受”的体验，确保可用。

现在，我们信仰“渐进增强（progressive enhancement）”：界面在任何设备环境中都能带来最符合设备特性的优质体验，不再以表现形式上的约束来换取兼容性。

那时候，我们习惯于为某个特定的规格（例如640×480）或规格区间（例如从640×480到800×600）来设计，如果页面布局在目标规格下都表现正常，我们的工作就完成了。

今天，我们知道内容会被规格多到令人发指的不同类型的设备访问到。

换个角度来诠释一下：Tim Berners-Lee（万维网发明者）将Web带给这个世界时，将它形容为某种功能精炼、朴实无华的双向信息发布平台，任何人都可以在任何地方通过这个平台与他人进行联系。而上世纪九十年代的设计师们受制于理念和技术上的局限，将其发展成了某种在设计和体验上力求饱满，但对用户参与方式有严格制约的平台。

当年的Web标准项目（<a href="https://en.wikipedia.org/wiki/Web_Standards_Project" target="_blank">Web Standards Project</a>）所要解决的就是这种体验和兼容性的冲突问题，而如今的移动设计及响应式设计理念则在这条大道上走的更远。如今，在正确设计与开发实现的前提下，我们已经能够使界面在不同的平台环境下都能带来最佳体验了。
<h4><b>Q：A List Apart对于设计师和开发者来说早已成为最具影响力的资讯来源之一。您当时创建这个网站（最初只是邮件列表）的主要目标是什么？现在看来那个目标是否实现了呢？</b></h4>
有这样一条DIY原则：如果你想要的某种东西在这个世界上还不存在，那么不妨自己去创造出来。

1998年的时候，在<span class="wp_keywordlink_affiliate"><a title="查看 网页设计 中的全部文章" href="http://www.uisdc.com/tag/%e7%bd%91%e9%a1%b5%e8%ae%be%e8%ae%a1" target="_blank">网页设计</a></span>、开发和内容创作这三个方面，各自有一些邮件列表和网站在教人们怎样去做，但还没有哪个媒介会覆盖到全部三个方面；当时似乎还没人意识到这三者之间密不可分的关系 – 它们实际上都从属于“21世纪设计”这个整体概念之下的。

<a href="http://alistapart.com/" target="_blank">A List Apart</a> 要做的就是将这三个方面的内容进行整合，所面向的就是那些和我们自己一样对“设计”、“开发”、“内容”这三者之间的重要关联有所认知的读者。

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2015/11/01-ux-ui-designer-interview-list-apart-circa-1999.jpg" alt="01-ux-ui-designer-interview-list-apart-circa-1999" width="700" height="440" data-bd-imgshare-binded="1" />

A List Apart 1999

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2015/11/02-ux-ui-designer-interview-list-apart-circa-1999.jpg" alt="02-ux-ui-designer-interview-list-apart-circa-1999" width="700" height="440" data-bd-imgshare-binded="1" />

A List Apart 2008

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2015/11/03-ux-ui-designer-interview-list-apart-circa-1999.jpg" alt="03-ux-ui-designer-interview-list-apart-circa-1999" width="700" height="440" data-bd-imgshare-binded="1" />

A List Apart 2015
<h4><b>Q：从一个简单的邮件列表，到如今拥有自己的出版部门（A Book Apart）并有能力在各地举办设计师大会（A Event Apart）的公司，看着A List Apart这样一路走过来，您有何感想？</b></h4>
花了将近20年去培育一个品牌，感觉像是培养自己的孩子，苦辣酸甜尽在其中。

最初的日子里，你会将自己的个性全部倾入其中，毕竟她的出现和生长离不开你的意志。慢慢的，你要学着让她拥有一定的独立性，无论孩子还是网站或是你创造的其他东西，他们都要有能力更加独立的适应这个世界。

找来一些合作伙伴，适当放掉一些控制权 – 对于设计师来说，这类事情会让你时而极度兴奋，时而异常痛苦。看到A List Apart在大家的努力下保持在正确的方向上不断前行，我非常开心，但有时也会觉得有些难过，因为如果我能一直以正确的方式来做这件事的话，她最终将不再需要我的存在而独立发展下去。不过不管怎样，如果我创造出来的东西能比我本人存在的更久远，这就足够令人开心了。
<h4><b>Q：当初是什么激励了您去创建自己的Happy Cog工作室？1999年刚刚起步时，您会想到在十多年后它依然在发展壮大吗？</b></h4>
我当时正在一家互联网公司担任创意总监，就是互联网泡沫破裂之前的一段日子。虽然挂着这样的title，但我当时几乎没有话语权，甚至连指导设计开发工作执行的自由也没有。

有一天，这家公司用我花30分钟做的一个logo换来了500万美金。

我对自己说：“是我的才能让这家小公司生存下去的；我应该自己干了”。这种想法显然是将自己的价值凌驾于公司之上了，但在当时我确实需要通过这样的信念来推动自己。

于是我在被授予公司股权之前的一个月辞职了。三个月之后所有那些股票都变成了废纸。

临走时，我打包了自己所有的<span class="wp_keywordlink_affiliate"><a title="查看 网页设计 中的全部文章" href="http://www.uisdc.com/tag/%e7%bd%91%e9%a1%b5%e8%ae%be%e8%ae%a1" target="_blank">网页设计</a></span>案例，对于自由设计师来说在当时的价值超过了6K美金。那年的圣诞节前，Happy Cog就成为正式的公司了，我也从自由设计师变成了“老板” – 一个穿着大背心的一根接一根抽烟提神的自己做设计和开发的“老板”。

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2015/11/04-ux-ui-designer-interview-list-apart-circa-1999.jpg" alt="04-ux-ui-designer-interview-list-apart-circa-1999" width="700" height="440" data-bd-imgshare-binded="1" />

Happy Cog办公环境 – <a href="http://technical.ly/philly/2014/03/19/happy-cog-new-office-photos/" target="_blank">照片来源</a>
<h4><b>Q：您觉得是什么使Happy Cog取得成功并从其他众多创意工作室当中脱颖而出的？</b></h4>
我在很小的时候就发现自己有那么一些与众不同。曾经试图融入到更多人当中，但很失败。在当时这种状况让我很难受，甚至使得自己有过好几年的自残行为。不过现在想想这些又很开心，毕竟，你不同，你所带领的公司才能做出一些与众不同的东西。此外，正是一些很独特的地方让这个公司本身也充满了令人兴奋和欢乐的东西。

我们看重原创性，我们输出原创性 – 我们就是这样的人。也正是这一点使我们能够吸引到一些本身就懂得think different的客户。

另外很关键的一点，在起步初期，我们就给自己定下了一条规矩：永远不去做那些我们自己无法认同的项目。

我在Happy Cog接的第一个咨询项目，每天能帮我赚到1K美金，我从来就没挣过这么多，而当时自己的状态又非常拮据。但是最终这个项目没有完成，感觉不对，对于他们来说我不是合适的人选，我无法帮他们实现目标，因为我们对于项目和用户的观念不一致。项目开始的三天之后我结束了合同。

我记得那天还下着雪，我女朋友当时也没工作，我们都在发愁下个月的房租如何解决。我住在纽约，租金真正不便宜。不过想想看我还是笑了，因为我发现自己还不会为了钱而做任何事。

从那之后我们在Happy Cog订了条规矩 – 即便在经济状况不理想的时候，我们也绝不要只为了报酬而做事。如果我们要花几个月的时间来通力合作，那么必须确保我们自己对客户要做的东西是认同的。我的几个合作伙伴都认同这一观点，这使我很安心。同时，我们的员工也做的很开心，因为没人会逼迫他们去做我们都不认同的项目。

我们从那时候开始就懂得关注用户和内容本身。我们可没等到若干年之后某些人发明了“可用性”这个词之后才明白不该去设计华而不实的东西。对于Web标准和可访问性的高度聚焦也使我们从一开始就与其他那些设计工作室有着明显的区别。当然，慢慢的大家都开始理解了这些设计原则并逐渐赶超了上来。

如今，我们对于内容策略的关注度丝毫不亚于在设计和开发两方面的投入程度。总而言之，我们从来都将“用户体验”理解为一个整体概念，小到界面细节的设计，大到功能流程的取舍。很多设计决策会对产品体验带来显著的提升，但很少有人真的会注意到 – 这就像没人会留意空调正在卖力的工作，直到我们觉得太热或是太冷了。这样很好，很自然。

我们只雇用那些真心在意设计的人，那些合作起来会让你觉得自己能得到激发和推动的人。做这行就是这样，无论对产品目标用户还是日常合作的队友们都要有共情的认知，享受团队协作的快乐也是设计工作的基础之一。

我们的多数客户都是回头客，这一点对我们非常重要。从某些方面讲，做设计就像谈恋爱，你认真的去爱了，便可能得到爱的回馈。大量回头客的意义在于，我们知道了自己确实做了一些正确的事，并且得到了认同。
<h4><b>Q：您能以某个典型项目为例来描述一下Happy Cog的设计流程吗？从创意概念到最终交付，这当中的流程大致是怎样的？</b></h4>
不是故意隐瞒 – 对我们来说确实没有所谓的“典型项目”。每个项目都是不同的，每一类目标用户都是不同的，每家公司的目标也是不同的。

所以，最典型的其实是我们在任何一个项目实际开始之前所做的大量的研究和沟通。和客户一起坐下来之后，我们会不断的问问题。我们不会像组装配件的小店铺那样只是简单的应允交出多少成品，然后干活签单，接下来马不停蹄的着手下一个项目。我们要和客户建立合作性的关系，确保项目和产出禁得住时间的考验。

也许听上去有些悬乎，不过我们的项目通常就像和客户之间进行的持续的对话，一轮接一轮，直到某个时候，方案很神奇的自己就呈现在那里了。
<h4><b>Q：有哪些里程碑式的事件或学习经历曾经推动您成长为更加优秀的设计师？</b></h4>
读中学时的一段日子里，我的自然课老师留起了胡须，然后某一天突然全部刮掉了。那天到学校之后所有人都在问他胡子的事。后来开始上课，大家安静下来，他问我们有谁注意到他把头发染黑了。压根没人留意到。

他过去是灰头发。开始蓄须之后，他阶段性的将头发一点点的染成了黑色。我们都太过于关注他的胡子了，以至于完全没有察觉发色的缓慢变化。而他刮掉胡子的那一天，头发已经完全是黑色的了 – 如果他没说起来的话，怕是真的完全没有人知道这件事。他的实际目标是将灰发染黑，而他故意将我们的注意力吸引到了错误的关注方向上。

这件事我永远不会忘记，实际上直到今天它仍然影响着我在交互设计方面的思考方式。

我母亲是音乐家，父亲则是一名爱好艺术的工程师。他会在晚间和周末画画，在家乡还组织了一个艺术小组。我家里到处是工艺品和艺术类书籍，我很小的时候就对卡通和字体产生了兴趣。

10岁的时候，我已经画出一系列以一位名叫“Rick Purvis”的间谍为主角的漫画。每画一部，我的绘画技能都有明显的长进。所以，为了让那些我想象出来的读者不至于因为每两部之间绘画风格的明显差异而犯迷糊，我编了一套理由，例如Rick一直在做面部整容以便躲避他的敌人等等。
<h4><b>Q：您觉得设计新人们怎样才能尽快提升能力？</b></h4>
向你接触到的每个人学习，无论他们的职位在你之上还是之下，或是平级同事。

早到晚走，勤奋做事。

读书，看博客，听播客，订阅资讯邮件。

保持学习。这个行业每个六个月就会发生一次重大变化。如果你停止学习，就代表你不再关心。而一旦你不再关心，你的设计师职业生涯在本质上就止步于此了。
<h4><b>Q：在您看来，“好”的设计与“优秀”的设计之间的差异是什么？</b></h4>
真的要视情况而定。其实有很多种取巧的方式能回答这个问题，不过那些答案未必永远正确。

比如，我可以说，当人们看到好的设计时，会说界面看上去好赞，当他们看到优秀的设计时，会感到你提供的服务很赞。这是实情，但并非在任何情况下都正确。

或者我也可以说，好的设计会让人们在用的时候觉得界面很酷，而优秀的设计会让人们在用的时候觉得自己很酷。

这些说法都正确，除了在不正确的时候。有时优秀的设计是隐形的，有时它又是令人难以侧目的。有些类似于电影，比如有些伟大的导演能让我们留意到所有惊艳的镜头，而另外一些伟大的导演则不会让我们感觉到有镜头这种东西存在。

在我们的行业里，太多人太过绝对化了。“伟大的设计是隐形的”，他们这样告诉你。但你要知道这种话有时是对的，有时则是错的。

优秀的设计都是有效用的设计，但有时有效用的设计未必就是优秀的设计。

持续的进行设计，你会离优秀越来越近。一名优秀的平面设计师可以不断摆弄着画布上的元素，寻找新的可能性，而此时普通的设计师可能已经定稿了。对交互设计来说也是同样的道理。
<h4><b>Q：在您看来譬如扁平化这样的视觉流行趋势有着怎样的重要意义？视觉方面的流行趋势与技术方面的流行趋势，例如响应式，比较起来有着怎样的不同？</b></h4>
外观样式方面的流行趋势没什么意义。它们从拥有自己的名字并被人们注意到的那天起就开始过时了。

追逐流行趋势是新人们乐于做的事情。我曾经那样做过，我们都曾经那样做过，这也是学习曲线当中的一部分。流行趋势能够给新人设计师们带来一些依靠，你不必过于担心譬如设计方案不成功的话会导致多少人失业，或是隐私设置的模式有问题的话会导致多少家庭被拆散等等这样的问题。这些问题可以留给交互设计师去考虑。

模仿流行趋势确实可以使新人设计师们少些顾虑，不过与此同时，那些更有经验的设计师则是在考虑怎样的风格最适于当前特定的产品、内容及品牌。

而响应式设计并不完全是技术层面的话题，也绝非流行趋势。它的出现代表着我们终于开始理解内容与样式介质的体验多样性问题。

Ethan Marcotte为我们的A Book Apart写Responsive Web Design时，最初只是聚焦在布局及前端技术方面，使人们有时间去试着理解和消化这个新概念。很正确的做法。

而在Ethan将响应式设计介绍给世人的五年之后，我们都开始明白这个概念更关注于内容与功能的多设备体验问题，而不只是简单的布局技术。
<h4><b>Q：如果有人想学习Web设计，您会建议他们首先关注哪些领域？</b></h4>
我建议从最基础的地方入手，包括语义化的HTML使用方式及渐进增强的理念等等。你还应该学些CSS，并至少对JavaScript的使用方式及背后的原理有所了解。然后你可以试着自己动手写一些最基本的页面，并使它们在任何设备上的任何浏览器当中都表现正常。

接下来可以通过读书来了解一些现代网页标准及字体运用方面的知识。

要像新大陆的探险者那样对与Web设计相关的一切事物保持关注，进行敏锐的观察和思考。如果看到某个网站觉得不错，那么尽可能去钻研一下细节，看看具体是哪些要素让你觉得有爱的。

比如某个电商网站让你觉得体验不错，那么就花些时间看看他们的设计、开发和内容团队做了哪些特别的事情 – 是清晰的信息层级？还是显而易见、易于操作的按钮及表单？界面上的信息元素是不是能帮助你对接下来的流程产生正确的预期？

每当你觉得某个产品很容易使用的时候，你该知道这往往意味着它背后的设计师们进行了一系列正确的设计决策。很多人笼统的将其称为“设计”，也有人会更有针对性的使用“可用性”这个词。不管怎样，阅读Steve Krug的 <a href="http://www.amazon.cn/%E7%82%B9%E7%9F%B3%E6%88%90%E9%87%91-%E8%AE%BF%E5%AE%A2%E8%87%B3%E4%B8%8A%E7%9A%84%E7%BD%91%E9%A1%B5%E8%AE%BE%E8%AE%A1%E7%A7%98%E7%AC%88-Steve-Krug/dp/B0011BTJV8/?_encoding=UTF8&amp;camp=536&amp;creative=3200&amp;linkCode=ur2&amp;tag=c7210-23" target="_blank">Don’t Make Me Think</a> 是必须的。

持续学习，保持对各种内容资源的关注，包括A List Apart、CSS-Tricks和Smashing Magazine等等。
<h4><b>Q：如果您有机会给年轻的自己一些忠告，您会说些什么？</b></h4>
事出必有因。";s:10:"post_title";s:60:"元老级大咖！WEB设计先驱Jeffrey Zeldman经典访谈";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:144:"%e5%85%83%e8%80%81%e7%ba%a7%e5%a4%a7%e5%92%96%ef%bc%81web%e8%ae%be%e8%ae%a1%e5%85%88%e9%a9%b1jeffrey-zeldman%e7%bb%8f%e5%85%b8%e8%ae%bf%e8%b0%88";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-01 15:55:05";s:17:"post_modified_gmt";s:19:"2016-08-01 07:55:05";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1432";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}