@�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:72;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-17 22:51:37";s:13:"post_date_gmt";s:19:"2016-07-17 14:51:37";s:12:"post_content";s:15089:"<strong>前言</strong>

随着技术的不断更新，智能设备和硬件的革命已经打响。然而，伴随这场革命的背后，对于我们新的挑战也跃然纸上，如何去“重新定义用户体验”，在这个各种智能产品泛滥的时代就显得尤为重要。在北京“IXDC2016国际体验设计大会”上，我们采访了和硕设计的台北区设计总监，看他对未来的用户体验是如何看待的！

<strong>设计师简介</strong>

<strong>林宗正 </strong><strong> ，</strong>现任和硕设计台北设计中心总监。多次带领团队参与意大利米兰家具展，以交互设计结合家具的创新概念作品, 为和硕拿下设计界魔术师之称号。他以建筑背景跨足工业设计逾13年, 具丰厚的创新产品开发经验。熟悉物联网及软硬件整合开发之产品设计趋势。并多次受邀至学术机关分享产业经验、参与国际论坛、主持设计工作营等。并曾带领团队拿下iF产品设计奖、日本Good Design, 中国红星奖等。最新团队得奖纪录为2016法兰克福消费品展，获大会趋势导览团评选参展作品冠军 (作品:POOH打气灯)。

—————————————————————————————————————————————————

<strong>站酷网：从建筑系毕业高材生到产品设计师，我想知道当初为什么会有这样一个选择？是因为产品设计更有趣吗？</strong>

&nbsp;

<strong>林宗正：</strong>进入建筑系之后，我隐约发现产品设计更符合我的个性跟理想，因为相较于建筑, 产品的种类更多元, 产业节奏也较快。虽然后来还是把建筑念完，但毕业后决定顺着自己的志向，转换跑道，也就这样往产品设计领域发展。

&nbsp;

<strong>站酷网：13年过去了，当时对于产品设计的概念和现在有何不同？</strong>

&nbsp;

<strong>林宗正：</strong>这么长时间过去了<strong>，</strong>理解是一定会变化的。不同的设计领域所处理的目标、运用的工具和技能是不同的。但是就相通的设计原理来说, 随着我们所接触到的事物越来越多，会变得更完善。一开始你累積的只是手头上的技能，渐渐会变成你的一种表达，变成一种策略性思考和问题解决的方式。随着时间跟经验的累积，还有就是设计的主流方向的转变，设计的内涵会越来越丰富，对我来说是这个样子。

&nbsp;

<strong><img src="http://img.zcool.cn/community/02c7dd578877290000018c1b3c6914.jpg@800w_1l_2o" /></strong>

POOH打气灯

<strong>站酷网：此次你受邀参加IXDC的分享会，主题是“化繁为简”，这个主题是基于怎样的一个思考产生的呢？ </strong>

&nbsp;

<strong>林宗正： </strong>其实设计师的工作之一就是在化繁为简，比如说看到东西很杂乱，你就想要把它整理的整齐；看到颜色搭配的太杂乱，设计师就想要把它重新配置一下，这本来就是设计师的天性。而这一次之所以定这个题目，是因为我们渐渐发现，用户他们人机互动的过程越来越频繁，互动的管道越来越多，物件也越来越多，每天生活被这些事情占据，这样继续多下去真的不是办法。

&nbsp;

这样的情景让我们开始反思，我们目前的用户体验是一定需要進化的，但是更新更好的功能也在不断的研发和出现，如何去权衡？从设计的角度，有没有机会在增加的同时，让用户的体验变的更为纯粹，回到它的原本需求？加跟减到底如何融合在一起，起到一个平衡点。

&nbsp;

<strong>站酷网：那现在找到加法和</strong><strong>减</strong><strong>法融合的方法了嘛？或者平衡点？具体到产品上功能如何去取舍？能否举个例子？ </strong>

<strong> </strong>

<strong>林宗正：</strong>我们渐渐累积出一些原则，就是将生活中的现有行为，延伸到产品的使用上。例如: 我们将量身高这样的動作, 运用在智能磅秤; 或是另一个作品吸色灯，它是透过挤压的动作把物件颜色吸起来, 再转换成灯光。另一方面來說，合理的交互手段应当有阶层安排，不见得执行一项很简单的动作都需要拿出手机，我们或许把手机视为最进阶的做法，放在最后。有很多其他可能的交互手段都可以拿来运用，像手势、自然语言、甚至人的出现这么简单。

&nbsp;

那产品功能上如何取舍呢? 相较于软件可以是在一个框架上慢慢迭加功能，硬件开发往往是在过程中一步步让功能趋于简化，在取舍的过程里，能否清楚定义最核心的价值，也就是用户最核心的需求，就显得更为重要。

<strong> </strong>

<strong><img src="http://img.zcool.cn/community/0244155788772e0000012e7e599adf.jpg" /></strong>

智能管家

<strong>站酷网：智能管家是和硕最近推出的产品，这个产品的设计理念是出于之前你说的，想要让用户体验变得更纯粹吗？ </strong>

&nbsp;

<strong>林宗正：</strong>智能管家是挂在墙上的一个智能硬件，类似家庭布告栏, 它通过智能摄像头就可以知道你是谁，及时提供给你当下需要的信息, 並且依照距离改变内容。当你离它很远查看天气或者时间的时候，它会给你一个比较大的画面，靠近的时候则会给你更进一步的信息。运用这样子的交互手段来设计，对用户来讲也是更轻松的。你的私人信息可以通过你的手机，但是一些属于全家共同的资讯，比如说我想要留言给我的家人，或者说全家要分享某些行程或活动时候，就需要通过这样一个工具去更好的实现。而这其中的化繁为简，是来自于我们让用户他们互动的更自然，更加直觉。

&nbsp;

<img src="http://img.zcool.cn/community/027215578878340000012e7ed14a43.jpg" alt="2c57578878340000012e7ee874c8.jpg" />

友谊贩卖机

<strong>站酷网：</strong> <strong>2013年的的台湾设计周，你们展出的“友谊贩卖机”很有意思，当时为什么产生这样的设计理念？</strong>

&nbsp;

<strong>林宗正：</strong>其实人使用产品，除了功能操作性的需求，还有很多社交、情绪上面的需求，像是安全感、自我成长、社会认同，这些需求也是要被顾及的。友谊贩卖机这样的一个作品，是随着社交、智能硬件以及移动互联的兴起，我们开始去思考这几个趋势到底对人的行为会产生什么样的变化。

&nbsp;

渐渐的我们发现了一些有趣现象，过去我们一直认为能够碰触的东西才有价值。但是随着虚拟环境的快速发展，每个人的资料，甚至是一些很有名的明星发了一则短讯的内容，这些都可以值很多钱。突然我们有了几个设想，这些摸不到的东西可以拿来交换吗？并且除了网络这种模式，还有什么其他形式是更有趣的？可不可以通过一种交换的过程产生一个作品？基于这样的想法，我们制作出了这样的一台机器，你把自己的信息投进去，就能得到另一个陌生人的信息。虽然软件的确可以做到我们现在这样的交换，但是透过软件和我们这样真实的交换是完全不同的体验。

<img src="http://img.zcool.cn/community/02559d5788772d0000018c1bbacf2d.jpg@800w_1l_2o" />

&nbsp;

吸色灯

而像今天我在工作坊分享的吸色灯系列，也是我们从体验出发去设计的。因为比较早期的电脑设备，你能跟它交互的唯一方式就是按开关按钮，人和机器只能是这种生硬的互动方式。但是现在我们人和机器，有了更多样的交流方式，所以我们才会去探索更多交互的可能性，比如说吸色灯是颜色的传递，如果往更深层次说，更像一种情绪的传递，我放了一个火种，整个地方都被我点亮。我们人跟物件通过这样一个惊喜瞬间的创造，为我们生活创造了一些不同于寻常的乐趣。

&nbsp;

&nbsp;

<strong>站酷网：现在和硕的设计团队有多少人？</strong>

&nbsp;

<strong>林宗正：</strong>和硕有台北和上海两个设计中心，设计师大约有80位左右。和硕内部设计师也有不同的专业分工，分别是产品设计、交互设计、视觉传达、多媒体互动、材质研发等等。和国内大多的设计团队不太一样，国内从软件开始切入的比较多，而我们那边是从硬件开始的。和硕的设计师和工程师结合得非常密切，你做硬件设计需要懂很多，不管是后端还是量产的开模等等，设计的时候都要考虑到。

<img src="http://img.zcool.cn/community/02ccb15788772c0000018c1b4bda15.jpg@800w_1l_2o" />

开发中的吸色灯

<strong>站酷网：智能产品的开发流程是怎样的呢？经过了哪些流程？</strong>

&nbsp;

<strong>林宗正：</strong>产品的开发流程大致上都差不多，如果是一个创新专案的话，一开始会去看有什么机会点，先分析目前的趋势和目标用户。比如说橘色经济，那些退休后五六十岁的人，他们的经济能力很好，但是他们渐渐开始要从职场退下来，他们的心态发生了哪些转变？我们从中找到一些机会，去聚焦成几个我们可以着力的点，去思考这些需求的解法是硬件、还是软件、或服务。

&nbsp;

发现可能性之后，我们会快速的做一些原型去测试，因为我们一开始对用户的理解不是那么透彻，我们只是基于一些基本的二手信息，或者是我们想象和观察到的一些碎片化的内容。做出来原型以后快速对用户进行实际测试得到反馈，这样反复的进行，渐渐的我们的方案就具体化了。

&nbsp;

方案具体化后就可以进入到量产阶段了。我们的产业比较特别，不直接面对终端消费者。因为我们是设计制造服务，所以我们直接和客户对接。也许这个客户负责的是某个日本品牌，或者是特别针对老人的产品，我们则提出想法和他们对接，针对他们的用户把想法变成更适合他们的产品。

<img src="http://img.zcool.cn/community/0230005788772c0000012e7e2572fb.png@800w_1l_2o" />

能进行脸部辨识、一键自拍的智能飞行器

<strong>站酷网：在这个过程中设计师大多不太了解硬件，合作的时候会出现什么样的问题？</strong>

<strong>        </strong>

<strong>林宗正：</strong>很多经验不足的设计师对于一些硬件的限制不够了解，常常喜欢画大饼，没有考虑它的可行性。因为硬件设计师后面合作的是机构工程师，还有电子工程师。通常我们基于用户的需求会希望体积小，希望产品在市场上有卖相，而他们工程师的工作，就要考虑的比较多，包括散热的安放位置等等，需要的空间就大，这中间就会产生很多需要协调、沟通的地方，然后最终形成一个平衡点。我们这边大部分是硬件设计师，和一般定义的设计师不太一样。

&nbsp;

<strong>站酷网：硬件设计师和其他的设计师有哪些差别呢？ </strong>

&nbsp;

<strong>林宗正：</strong>第一个使用工具不同，第二个我们的对象不同，硬件设计师接触到的都是摸得着的东西，软件设计师基本上更偏视觉上的。所以硬件设计师对实体对象的基本造型能力 (型态、线条、比例、质感) 以及美感要更着重，再来就是生产制造流程的认识。

<img src="http://img.zcool.cn/community/02849a5788bb7a0000018c1b3f0831.png" alt="39465788bb7a0000018c1b2e6c83.jpg" />

让你享受城市漫游的智能导向仪

<strong>站酷网：那经过这次IXDC的碰撞之后，产生了哪些新的想法吗？</strong>

<strong>林宗正：</strong>我观察到一个有趣的现象，我们从硬件的角度出发，探讨的是人跟物的交互与关联，思考用户的需求要怎么透过硬件来满足; 但从软件的角度切入, 更多思考的是人与人之间的行为本身。以服务设计来说，设计的对象 (也就是商品) 跟用户一样都是人, 就是这个意思。

&nbsp;

我的想法是, 如果把软件与硬件的思维迭加在一起，那硬件的存在也可以是一种, 在人与人的交互中扮演像催化剂一般的角色，让整个生态系变得更完整的一个平台，任务一旦完成，就升华、抽离了。

&nbsp;

&nbsp;

<strong>站酷网：国内硬件设计师的招聘很难，对于台湾来说，存在这样的人才缺口吗？</strong>

&nbsp;

<strong>林宗正：</strong>设计的内涵是一直累积的，有不同的阶梯。对于设计师来说，需要有一个能够让他横跨多个领域的工作环境，以至于软件交互或者硬件都有所涉猎，这本身都需要蛮长时间的培养，不见得是能够短时间培训起来的。

&nbsp;

&nbsp;

<img src="http://img.zcool.cn/community/029745578877260000012e7ee8c30a.jpg" />

和硕设计工作区

<strong>站酷网：你们录用设计师的时候有哪些偏向吗？比较看好他哪些方面？</strong>

<strong>    </strong>

<strong>林宗正：</strong>我们会更希望他在创意想法和逻辑方面兼具，这本身就不太容易。因为左脑负责逻辑，右脑负责创意，有很多人的天性是偏理性思维的，有的人是属于跳跃性的，这两面如果都能够兼具就很理想。

&nbsp;

沟通能力也非常重要，刚才提到跨专业领域的沟通，其实设计师的工作就是在表达，一个人想要当设计师，我觉得很大一个原因是他想要表达对于某些事件的想法，他希望自己设计的东西引起共鸣。而如何让用户去喜欢，则考验的是你的表达方式和技巧了。另外，听用户的心声也是沟通的一个层面，尤其是跨领域的合作，能够把你的想法用一个说故事的方式让别人理解，我比较看好这些能力。

&nbsp;

<strong>站酷网：对于智能家居未来的大趋势，建议设计师学习哪些方面的知识？从哪个方面切入？</strong>

&nbsp;

林宗正：我建议设计师从硬件的一些基础开始了解，包括硬件的整个开发流程，初期你要能够把你的想法通过图面呈现出来，接下來要知道需要通过哪些技术去实现。技术不见得是你自己要完全掌握，但是必须要能够和负责那一部分的人沟通合作，原则和流程是必须要理解的。当然，硬件开发流程还有很多的限制，现有科技的限制，理想产品跟终端售价之间要权衡等等的，这些知识我觉得都是慢慢需要累积的。";s:10:"post_title";s:33:"优化体验，为功能做减法";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:99:"%e4%bc%98%e5%8c%96%e4%bd%93%e9%aa%8c%ef%bc%8c%e4%b8%ba%e5%8a%9f%e8%83%bd%e5%81%9a%e5%87%8f%e6%b3%95";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-18 14:33:17";s:17:"post_modified_gmt";s:19:"2016-07-18 06:33:17";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:23:"http://qisumu.com/?p=72";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}