���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:2007;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-08-16 18:13:24";s:13:"post_date_gmt";s:19:"2016-08-16 10:13:24";s:12:"post_content";s:10604:"<blockquote>最近在一边工作一边读书的同时，也在思考交互设计是什么以及互联网交互设计师在团队中的定位等一些问题。谈到交互设计仿佛就是“一千个读者就有有一千个哈姆雷特”的感觉，每个人都会说出一套它们自己对于交互设计的理解。</blockquote>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/08/jiaohushejishi.png"><img class="size-full wp-image-394534 aligncenter" src="http://image.woshipm.com/wp-files/2016/08/jiaohushejishi.png" sizes="(max-width: 680px) 100vw, 680px" srcset="http://www.woshipm.com/wp-content/uploads/2016/08/jiaohushejishi.png 680x, http://www.woshipm.com/wp-content/uploads/2016/08/jiaohushejishi-404x190.png 404x" alt="jiaohushejishi" width="680" height="320" data-original="http://image.woshipm.com/wp-files/2016/08/jiaohushejishi.png" /></a>

本来“交互设计”这个名词就是来源于国外并且传到国内也就三四年的时间。看了看国外各个在交互领域有些名气的大学关于该方向的研究都不同，对于交互设计的教育都没有一定的标准和体系，更何况国内对于它的定义了。所以，不同的行业、公司和团队都有各自对于交互设计的理解，从而分派给交互设计师的工作也就不同。

“交互”字面意思是用户操作，设备产生反馈的过程。最先起源于互联网领域的传统软件和网页，逐步被人们认知并推广开来。先看看这些名词就足以把人弄晕：
<ul>
 	<li>UI（User Interface）指用户所看到的界面，包含的范围很广，不仅仅包括视觉上的，更有信息层级关系等交互上的内容，而现在国内大部分人称为的UI其实是GUI；</li>
 	<li>GUI（Graphic User Interface）指界面上更多平面设计的元素，包括icon、字体、配色等等；</li>
 	<li>我们常说的UE在国外更多表示为UX（User Experience）指体验上的设计，除了界面上的也有界面后的东西。包括页面中的信息层级，页面间的关系逻辑，无论是实现一个功能还是阅读一个内容，设计用户使用过程中的体验；</li>
 	<li>ID（Interaction Design）直接翻译过来是交互设计，但在国外更多指动效设计（交互设计的一部分），国内使用的便没有标准了。</li>
</ul>
就连国外的一些大师在书中所总结出的交互设计的概念也都不同，但这几个重要的关键词是共有的：<strong>体验、情感、对话、逻辑</strong>。交互设计也逐渐从UI，界面设计中脱离出来逐渐形成一门独立的学科。

无论何种设计师都要在纸上或屏幕上出图、出文案，但干活要干得明白。<strong>首先对于评价标准有着清晰的认识和理解；其次交互设计怎样与业务结合；最后知道要交付哪些输出物物并与哪些人对接。</strong>

作为互联网领域的交互设计师对于上面三个问题说一些自己的思考：
<h2>交互设计很少会被注意到</h2>
当用户顺利完成一件事情，进行一个行为，用户很少会注意到这个过程中的交互。<strong>好的交互设计使用户浏览界面产生的认识和做出行为得到反馈都是符合心理预期的</strong>，而只有当用户找不到想要的内容和使用其中一个环节出现了用户不理解、不知道怎么进行下去的情况才会发现这个设计真差劲。

与平面设计和工业设计领域不同，交互设计有着在时间维度上设计的属性（《Thoughts on Interaction Design》）。平面设计、工业设计是在看到的一瞬间在二维或三维上产生一种视觉上的冲击，运用符号、颜色、材质和造型让用户产生不同的体验情感，更关注结果（工业设计现在也细分出了交互设计，《About Face 4》提及了很多传统设计与交互的结合）。

随着时间的推移冲击力减淡，替代品的出现，不会再产生第一次那么强烈的情感，所以那么多的产品会被扔进垃圾桶。而<strong>交互设计是设计一种从开始到达到结束过程中的流程体验，更关注过程。</strong>从最开始的会用、好用，逐渐产生愉快的使用体验。随着时间的发展在不同任务中、每个阶段中都产生不同的情感。经历过简单地学习过程，逐渐被用户认知为“理所应当”。随着产品的慢慢迭代逐渐将好的交互设计沉淀成了达到结果目的的最佳使用习惯。

优秀的平面设计、工业设计作品也有被奉为百年不衰败的经典，在时间维度上得以延伸。这些产品已经不仅仅是有漂亮的“结果”，而是用户看到它们产生情感，产品成为可认知的习惯符号。时间的推移和技术的成熟使设计结果变了，不断被取代。但用户想要达到的目的没有变，情感、心理没有变，达到目的的过程会随着技术进步而优化并不会被取代。

也许在交互设计过程中会有一些愉悦用户的小点子、小创意，但这并不是交互设计的精髓所在。对比一下苹果原生短信APP、微信APP和Same APP就明白什么是交互设计中的加分项，什么是交互设计中的核心价值——一切都是为用户舒心自然的使用、观看而服务。

用户更多关注的是过程后的结果和目的达成的效果，所以交互设计师的成就往往并不是来自用户的一句“你这个交互设计真好”这样的话。
<h2>交互设计需要支持业务数据</h2>
交互设计需要支持业务数据，数据并不是仅仅由产品经理和分析师所关注的东西，设计师也要通过数据来反思自己的设计。虽然交互设计最多的是研究人、研究用户，更多采用定性的研究方法，但作为在项目组中服务项目的岗位，更要清楚自己的工作让用户满意的同时为业务带来了哪些好处和数据上的变化。如，阿里巴巴1688UED《U一点》相比于其他公司UED出的书籍很着重强调了设计与数据的关系。

比如，恰当的布局使重要模块的点击率得到了上升；恰当的改变使用方法和使用过程路径，有效地增加或减短使用时间；通过设计出优秀的交互流程和结果反馈为业务争取到更多用户的回访和整个产品的粘性等等。有些数据在很大程度上设计并不能决定，比如新用户数量；其他因素也会影响数据，如果用户活跃度逐步提升是否有运营的因素在其中，活跃度下降是否是竞品有了新功能或者比你设计的更好。

设计师要习惯“戴着着镣铐舞蹈”。在Dribble上有很多酷炫的设计，其他平台也有针对现有著名产品的Redesign。但大多没有用到实际的项目中去主要是，技术与时间不支持如此前瞻的概念设计，更重要的是不符合业务诉求，超出其他因素限制，单纯为设计而设计作品。当设计师挖空心思想出的酷炫设计在经过领导、产品经理指点江山后改成符合业务线、符合当前情况的设计，内心愤愤不平将原设计稿优化后传上去。一些设计师会抱怨著名产品设计不合理之处，然后自己Redesign一版。作为迭代这么多版本的成熟产品，“不合理之处”的存在一定有它的道理，都是权衡之后的结果，设计师要多去挖掘“不合理”原因所在，能否可通过其他方式解决。所以要清楚在什么情况下为什么业务服务，要为达到什么效果而设计。

通过设计师们的研究与服务，帮助数据提升，帮助业务不断成长。
<h2><b>交互设计产出物</b></h2>
由于不同公司和团队对于交互设计的定位不同，所以对其输出物要求也不同。通过我的了解，国内几个大平台的交互设计基本将产品经理交付的PRD（产品需求文档）、产品说明文档作为输入、业务逻辑图，将功能逻辑图、交互Flow、不同保真度的原型图以及交互文档作为输出。而有些小团队会把产品需求文档、产品说明文档、产品交互文档统一打包成PRD交给视觉设计师，这些工作均由产品经理一人包办。再小一些团队根本不用文档，通过低保真原型和当面交流将需求传达下去。

《the Element of User Experience》书中将产品划分为五个层级：战略层（Strategy）；范围层(Scope)；结构层(Structure)；框架层(Skeleton)和视觉层(Surface)。分别对应的是：战略发展会议、战略规划文档；产品需求会议、产品需求文档、业务逻辑；产品功能逻辑图、交互Flow；交互原型图、产品交互文档；产品视觉设计图、标注图。产品经理会对全部层级负责，但更多是关注前三个部分（国内外对于产品经理定义有区别）；交互设计师侧重结构与框架，会参与小部分视觉内容；视觉设计师注重设计层也会参与到框架层中。不同的职位在相同层级上负责的内容会有重叠，这将使团队联系紧密，讨论争辩的同时将产品做到更好。

现在也有很多观点认为交互设计职位未来不会存在，因为产品经理和视觉设计师都往前进一步就没有交互的位置。其实这个结论表述反了，是产品经理和视觉设计师各退一步，将分工更细化才出现交互设计师，这样有人会专职研究这一方面内容。人类进步正是产生于分工细化，分工细化是将每一领域做精做好的前提。即使未来没有交互设计师岗位，那也一定是以另一种方式存在于团队中，存在于产品生产的一个环节上。

为用户体验而设计这个概念从互联网领域展开，现在已经渗透到了各个行业。从电脑屏幕、手机、可穿戴设备和其他屏幕上的操作体验，到工业产品的使用体验，再到地铁站、展览馆博物馆内部的导视和装饰的体验，甚至是在餐厅、咖啡馆消费都谈到了体验这个词。我很有幸成为交互设计师这个离体验最近的职位，以用户角度去观察思考，掌握方法去分析思考出结论并通过工具表达最佳方案这是交互设计的根本。希望未来可以扩展到其他领域的交互体验研究中去，可以通过自己之所学为人们生活带来优化。

好吧，我只是个画图的，把头埋在mac里继续画图好了.....

&nbsp;

作者：米亓

来源：http://www.jianshu.com/p/32dbf8ba4a6c#";s:10:"post_title";s:48:"一千个从业者就有一千个交互设计师";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:144:"%e4%b8%80%e5%8d%83%e4%b8%aa%e4%bb%8e%e4%b8%9a%e8%80%85%e5%b0%b1%e6%9c%89%e4%b8%80%e5%8d%83%e4%b8%aa%e4%ba%a4%e4%ba%92%e8%ae%be%e8%ae%a1%e5%b8%88";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-16 18:13:24";s:17:"post_modified_gmt";s:19:"2016-08-16 10:13:24";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=2007";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}