�̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1326;s:11:"post_author";s:1:"3";s:9:"post_date";s:19:"2016-02-28 17:03:17";s:13:"post_date_gmt";s:19:"2016-02-28 09:03:17";s:12:"post_content";s:4795:"

从《霹雳游侠》里的汽车KITT到《美国队长2》里局长尼克的雪弗兰战车，再到最近的热播剧《他来了请闭眼》里的安迪，影视作品从来没有停止过对智能汽车的想象。会思考，会说话，感应主人的想法，能独立行动，甚至有一点幽默感，这正是我们所期待的智能。如今，其中一些曾经不可思议的功能正逐渐转化成现实：触屏、声控、甚至自动驾驶。汽车似乎真的越来越智能，然而这些技术真的满足了人们的需求吗？

用户想要的，是更好的利用时间

随着经济高速发展与城市规模扩大，交通拥堵成为都市人出行的常态。尤其在一二线城市，高峰时段每出行1小时，就会有27分钟耗费在严重堵车上。人们在车内的时间变得更多，渴望在车内实现的事情也变得更多。唐硕对人车关系的研究显示，在漫长的行车过程中，用户期望随时能通过装置或系统取得必要的资讯，完成恰当的任务。不同类型、不同级别的需求在车内汇集，对智能车载系统提出了更高的要求。

&nbsp;

&nbsp;

将个性化体验做到极致

为了能更好的了解用户对于智能车载系统的需求，我们深度访谈了30位车主用户，倾听他们与车之间的故事。研究发现，家庭观念、消费观念、互联意识与社交行为，左右了用户与车的关系。不同人群在与车的互动中，都存在不同的需求与痛点：持家型用户注重对汽车的养护，同时也精打细算；事业型用户常常在车内阅读新闻、处理工作；保守型用户对导航功能与电子狗功能需求强烈，却往往因操作复杂而放弃。

<img title="web_配图(1000-336)_002.png" src="http://www.tang-consulting.com/Public/ueditor/php/upload/20160106/14520629458178.png" />

如何满足不同用户的需求呢？通过车载系统与手机互联，为用户提供个性化服务。目前中国智能手机拥有率高达86%。智能手机成为了最了解用户的智能设备。当手机与车载系统融合，汽车即能实时感知、忠实记录、积极反馈。如在行车过程中针对个人驾驶习惯，适当的提醒如何降低油耗；如通过车载系统同步手机重要信息，甚至为其语音阅读手机收到的最新新闻；如在用户连接手机后，就自动调整至该用户常用的座椅高度与后视镜角度，为其播放爱听的音乐，导航优先显示其常去的地点。

&nbsp;

安全与高效仍是第一位

车在40km/h行驶时，每秒钟可以前进11米。也就是说，当人们低头看一眼手机或者换一个广播频道的2至3秒间，汽车就已经向前移动了30多米。最常使用车载系统的用户，是驾驶员。使用场景也多是在移动状态中。当用户手握方向盘，注意力几乎都集中在前方道路，只能将有限的精力分去操作车载系统。因此，车载系统的设计需从移动场景出发，站在驾驶的角度进行思考，在设计上尽量减少用户的思考，简化用户的行为。精简信息，让重要的功能靠近驾驶座，便于用户操作，从而保证车载系统的安全与高效。

<img title="web_配图(1000-336)_003.png" src="http://www.tang-consulting.com/Public/ueditor/php/upload/20160106/14520625413313.png" />

用服务体验思维改变移动体验

什么才是更好的人车互动体验？上海的内环高架在高峰时期，不允许外地牌照和实习车辆上高架。如果用户在初次使用车载系统时即录入驾照信息，系统自动识别其驾照实习期的期限，在期间规划导航路径时能自动规避内环高架线路，就能有效避免用户违规。如果在用户发生严重的交通事故后，数据直接同步到用户常去的4S店，4S店专员主动联络用户，协助用户完成后续的流程，就能改善目前繁琐的汽车维修服务体验。

<img title="web_配图(1000-336)_004.png" src="http://www.tang-consulting.com/Public/ueditor/php/upload/20160106/14520629569366.png" />

随着用户的使用行为与偏好被车载系统记录、分析，用户数据逐渐丰满与深入，也就为人车互动带来了更多的可能性。未来唐硕与合作伙伴希望构建的，是一个跨触点、跨渠道、资源整合的汽车服务生态。以用户为中心，融合个性化、弱社交与大数据等元素，打通用户买车、驾车、停车、养车的全流程，实现更好的移动体验，探索创新的移动方式。

未来，智能设备的互联将带来极致的移动体验。

未来，拥有跨触点、跨渠道、资源整合的汽车服务生态。

未来，其实并不遥远。";s:10:"post_title";s:30:"出发，移动的智能空间";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:90:"%e5%87%ba%e5%8f%91%ef%bc%8c%e7%a7%bb%e5%8a%a8%e7%9a%84%e6%99%ba%e8%83%bd%e7%a9%ba%e9%97%b4";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-28 17:04:03";s:17:"post_modified_gmt";s:19:"2016-07-28 09:04:03";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1326";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}