�̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1673;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-08-04 16:24:16";s:13:"post_date_gmt";s:19:"2016-08-04 08:24:16";s:12:"post_content";s:6165:"<blockquote>题，我只说说其中几个点，一点是现在的很多运营人员普遍在用户身上花的时间不够多，接触的用户太少，甚至很多人打着用户的名义，其实骨子里并不情愿跟用户交流，等等。再就是说几个很多公司容易忽略的错误，纯粹都是从用户角度去谈的。其实这个话题不太好写，而且这篇也未谈及全部，可以扩展的太多，希望大家谅解！</blockquote>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/08/YONGHU.jpg"><img class="size-full wp-image-385916 aligncenter" src="http://image.woshipm.com/wp-files/2016/08/YONGHU.jpg" sizes="(max-width: 680px) 100vw, 680px" srcset="http://www.woshipm.com/wp-content/uploads/2016/08/YONGHU.jpg 680x, http://www.woshipm.com/wp-content/uploads/2016/08/YONGHU-404x190.jpg 404x" alt="YONGHU" width="680" height="320" data-original="http://image.woshipm.com/wp-files/2016/08/YONGHU.jpg" /></a>
<h2>1、主动接触用户对运营人员是条件反射</h2>
对于运营人员来说，接触用户是每天必须要做的，而且不是公司要求，而是你自己打心底里就觉得这是应该做的。

我们遇到的用户形形色色，有很多用户是非常难缠的，哪怕有些用户你恨不得踹死他，也必须耐住性子，跟他好声好气的说话，把问题解决了。性格不是适不适合做运营的硬性要求，很多急性子，做了几年运营工作之后，就变得“任凭风浪起，稳坐钓鱼台”了。这是运营人员的基本素质。

不好搞定的用户非常多，尤其是已经处于塔尖或者有潜力晋级到塔尖的用户，和现实生活一样，但凡优秀的人，都是有棱角有个性的。好搞定就不需要你了，对吧？我之前说到消费能力强、价值高的用户经常出现在晚上的概念，决定了你想成为一个出色的运营人员，就得比别人花更多的时间，这个没有办法。人各有志，我倒不是鼓励大家都做加班狂，但每天准点下班、回家也从不开电脑，能做到优秀的，我这辈子还真没见过，我也不相信会有。我工作11年，一般回家都会随时开着工作平台。我记得我在南宁的时候，问一个同学，你每天这么准点回家干吗？她回答：吃饭。我竟无言以对。但那一刻，我的心已经凉了。

真正优秀、能给社区创造最大价值的用户，要么就是慢慢培养出来的，要么就是从外面的平台拉来的，都需要我们长时间地跟他们接触、磨合。运营人员不能像客服人员一样，被动地接触用户，等着用户来找你，如果那么做，能做好运营，简直就是天方夜谭。
<h2>2、关于“护犊子”的典型心理</h2>
说到用户吐槽，先说一个典型的心理：护犊子。很多人在吐槽别人产品的时候，可以说的头头是道，可以长篇累牍，能把别人说的一无是处，简直就是问题堆积，少有溢美之词，但是，一旦说到自己做出来的产品的时候，反而全是好的，只字不提短处。有些人甚至会这么认为：我们的产品这么好，用户竟然都不用，用户都是傻逼么？

而当别人反唇相讥，被戳中痛点的时候，又会说：我们付出了很多心血，我们非常苦逼。
<h2>3、关于自嗨和YY</h2>
还有一个普遍现象，就是自嗨。这体现在做产品，做市场，做运营，等等诸多环节上，其实特别常见。

比如做运营，做市场，钱也花了，事情也做了，汇报材料整的特别漂亮，领导很高兴，下面的人也很高兴，公司内部一派其乐融融，但其实事情放在整个业界里，连个浪花都没打起来，用户更是毫无感知，毛用都没有。

比如做产品，把产品做成了一款满足某几个产品经理和老板的需求的产品，把自己当成用户，结果大家玩的还很嗨！
<h2>4、接受用户的吐槽，让用户打脸</h2>
敢于接受和直面用户的吐槽，让用户打脸，说起来简单，实际上非常难。工作有时候就是这样，也许我们辛辛苦苦做出来的东西，在用户那里就是垃圾。其实很多公司，真正的民意，公司的管理层是看不到的，也许他们意识不到问题的严重性，也许中层报喜不报忧、基层说了也没用，反正归根结底就是公司没有一个机制，让用户真实的心声，直达天庭。这块做的不好的公司数不胜数，做的好的，我之前经历的公司里，360是最好的一家，他们有一套非常完整且规范的流程。

如果你说建立流程太复杂，周期太长，那么有一个最最最简单不过的办法，我觉得大家可以用一下。我们的很多最核心的用户群（聚集的是平台忠诚度最高的一批塔尖用户），我更倾向于把公司的一些核心人员也拉进去（放心，用户一定会找他们交流）（不是所有群都拉），比如老板、相关的vp和总监们，就是要让他们看下用户在说什么，吐槽什么，他们需要什么，关心什么，就是要让你知道，你做的某些功能，就是垃圾，是你YY出来的，用户根本不care。
<h2>5、接受现实，坦然面对用户</h2>
只有从心底里意识到问题的重要性了，才会真正有勇气接受这个现实，才会更加努力的改善产品，改善服务，这样才能做出一款真正用户喜欢的产品。否则一直自嗨下去，公司哪天黄了，都不知道为什么作死的。

说到底，这个话题其实说的是一个心态问题，不只是个人，更是一个公司的心态问题。有时候，我们对用户能够开诚布公，错了就是错了，大大方方承认了即可，用户会理解的，也许还会起到意想不到的效果。

与其披着一层面纱，不如脱光了示人！
<h3>#专栏作家#</h3>
类类，微信公众号：类类有话说，人人都是产品经理专栏作家，工作10年的互联 网从业者，现任奇酷粉丝运营总监，原猫扑网产品运营总监、酷我音乐产品总监。";s:10:"post_title";s:81:"用户不是幌子！说说我们在用户身上易犯和在犯的几个错误！";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:198:"%e7%94%a8%e6%88%b7%e4%b8%8d%e6%98%af%e5%b9%8c%e5%ad%90%ef%bc%81%e8%af%b4%e8%af%b4%e6%88%91%e4%bb%ac%e5%9c%a8%e7%94%a8%e6%88%b7%e8%ba%ab%e4%b8%8a%e6%98%93%e7%8a%af%e5%92%8c%e5%9c%a8%e7%8a%af%e7%9a%84";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-04 16:24:16";s:17:"post_modified_gmt";s:19:"2016-08-04 08:24:16";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1673";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}