X��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"2315";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-09-20 10:04:34";s:13:"post_date_gmt";s:19:"2016-09-20 02:04:34";s:12:"post_content";s:5479:"<h4><strong>1. 给予明确的创意方向</strong></h4>
对话一：
<blockquote>你说：“我看到成品就知道是不是我想要的了。”

设计师听到的：“ 先创造点东西出来吧，然后我就知道‘这TM根本不是我想要的’了。”</blockquote>
你会不给建筑师任何资料，就让他凭空帮你建造房屋吧？当然不会！虽然说，如果建筑设计师无需任何提示就能设计出你的梦想房屋很棒，但这些天才设计师根本就不知道，你究竟是需要五间卧室？至少两间半浴室？还有一个能停放三辆车的车库？Balabalabala……缺少这些关键信息的话，可是会大幅影响设计进度，让你永远无法搬进新家了哦。

这就是问题的关键：设计师的职责是解决问题。如果你想让他们帮你解决问题，那就需要你清晰地阐述问题，以便让设计师用更好的方法去解决它们。比如：你想通过最后的设计达到什么特定的目的？或者，这些目的的优先级是什么？
为了加快设计进程与明确方向，你也可以提供给设计师相应的设计说明书。比如：

对于印刷品，你应该规定纸张大小，颜色样式，出血限制和适用的文件格式；
对于网页设计，你应该提供像素大小，适用的文件格式和文件大小限制；

如果你想要把设计运用在其他的格式中，应该提前告知你的设计师。

这些贴心小tips都是你可以在设计过程中，和设计师提前沟通好的要素，它们能方便设计师之后调整，从而加快设计进程。

<img class="alignnone size-full wp-image-201470" src="http://image.uisdc.com/wp-content/uploads/2016/09/uisdc-tz-20160919121.jpg" alt="uisdc-tz-2016091912" width="600" height="780" />
<h4><strong>2. 和设计师交流作品的外观和感觉 </strong></h4>
对话二：
<blockquote>你说：“这个，越有feel越好。”

设计师听到的：“是想让这个更酷、更炫、更潮……还是什么别的？”然而想这些并没有什么卵用。</blockquote>
<blockquote>客户：我想要有光泽感的设计……＝光泽感就是贵气加闪亮

客户：让设计变得更吸引人一些……＝完全是一通废话</blockquote>
注意不要用像时尚，科技感，酷，潮流，色彩鲜艳等通用的大词来形容你想要的东西。这些词无法给人一个足够明确的方向，而且每个人对这些词的认识各异。

你可以花些时间去搜集那些有所谓“时尚，科技感，酷” 风格的视觉图。你给设计师提供的例子越多，他就能更好地理解并且尽可能满足你的设计需求。所以尽可能详细地描述每一个例子中你中意的部分——字体，排版，滤镜，色调，功能性，等等。

<img class="alignnone size-full wp-image-201471" src="http://image.uisdc.com/wp-content/uploads/2016/09/uisdc-tz-20160919131.jpg" alt="uisdc-tz-2016091913" width="600" height="600" />
<h4><strong>3. 给设计师提出有建设性的反馈意见</strong></h4>
对话三：
<blockquote>你说：“总感觉有些不对，但我不知道是哪里不对。”

设计师听到的：“ 我还是不知道我要干嘛。你应该知道我的内心几乎是崩溃的。”</blockquote>
以下是“设计师眼里最糟糕客户类型”前三甲：

1. 想法自封型客户
<blockquote>客户：“用这个代替可以吗？”

设计师：……</blockquote>
2. 一头雾水型客户
<blockquote>客户：“这设计看起来太丑了。”

设计师：“您可以再说得清楚些吗？”

客户：“唔那我就不知道了。”</blockquote>
3. 死板型客户
<blockquote>客户：“把这个清单上的好东西都加到设计里。”

设计师：……</blockquote>
一般情况下，大多数设计项目都要经历几轮修改。设计师应该做好准备来收到你真实的反馈。为了让这个过程更高效、划算并尽量不那么费力，你需要发现并精确定位每一个在设计中出现的问题。

首先，先从整体角度来看这个设计。留心攫取你注意力的部分，然后注意你的眼球浏览这些图像的顺序。你可以写一些形容词来描述你一开始的反应。如果你觉得视觉风格看起来不那么好，你也应该再关注下排版和总体架构是否合你的意。

其次，单独分析每一个设计元素——字体，颜色样式，线条等等。他们形成的色调是你想要的吗？哪些可能阻碍你达成所期待的结果？

最后，请务必仔细检查你的副本中是否有错误。即使你发送了完整的文本给设计师，其中的错误也可能对设计形成误导作用。不要让本可以说清楚的要求因为一些小差错，导致设计师无止境的修改。

<img class="alignnone size-full wp-image-201472" src="http://image.uisdc.com/wp-content/uploads/2016/09/uisdc-tz-20160919141.jpg" alt="uisdc-tz-2016091914" width="600" height="599" />
<h4><strong>4. 团队合作成就梦想</strong></h4>
与设计师最好的合作方法，就是记住——你的设计师是你的同盟。他也和你一样，想让最后的作品富有创造力、充满激情以及有效性。如果你努力地和设计师沟通你的目标，说明清楚自己想要的视觉效果，并及时给予他反馈，你就会在尽短的时间内看到更符合你期待的设计大作。";s:10:"post_title";s:61:"设计师不懂你？可能是你没学会这4个沟通方法";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:181:"%e8%ae%be%e8%ae%a1%e5%b8%88%e4%b8%8d%e6%87%82%e4%bd%a0%ef%bc%9f%e5%8f%af%e8%83%bd%e6%98%af%e4%bd%a0%e6%b2%a1%e5%ad%a6%e4%bc%9a%e8%bf%994%e4%b8%aa%e6%b2%9f%e9%80%9a%e6%96%b9%e6%b3%95";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-10-19 19:18:48";s:17:"post_modified_gmt";s:19:"2016-10-19 11:18:48";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=2315";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}