��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"532";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-21 12:01:49";s:13:"post_date_gmt";s:19:"2016-07-21 04:01:49";s:12:"post_content";s:5697:"“设计师文化”其实是一个很含蓄的术语，很多公司都声称拥抱设计师文化，这个词经常被引用，但很少有人能说清楚它到底是什么。你问5个设计师，会得到5个不同的答案。是关于美学吗？过程？哲学？还是所有的都包括?

对不同的组织来说它可能意味着不同的东西。虽然细节可能会改变,但归结起来，主要有以下几个主要特征：

<strong>理解和尊重</strong>

在一个拥有设计文化的公司中，每个人都会理解和尊重设计的价值。

在有些地方,设计往往被误解为“让东西看起来更漂亮”。当设计不被正确地理解或尊重时,它往往会屈居于工程和商业决策之下,结果可想而知。在一个真正的设计师文化下，整个团队（包括没有设计师的部门或小组）都明白设计是必须贯穿于整个组织及各个流程当中的。


<strong>意向性</strong>

设计师文化的基本表现为：每个决定都有它背后的意义。
即使是很小的细节也可以产生巨大的影响,所以在以设计为中心的组织中不会将任何事归结为偶然。设计不仅用于打造公司的产品或服务,而且还被用来组 织公司本身。看似很小的细节，比如照明、沟通工具、咖啡机的位置都是经过深思熟虑的。套用康威定律的内涵来说,一个公司的产品往往反映了公司本身的结构和 特点。因此,一个设计良好的组织也将能提供设计精良的产品和服务。

在一次采访中, OpenTable（美国知名网上订餐平台）的Chloe Park描述了他们被Priceline（美国在线旅游龙头）收购后公司文化上所发生的一些变化：
<blockquote>“我 认为设计增加了公司文化背后的意向性水平。当我跟一个设计师聊起这个话题的时候,她给我列举了一些改变了整个办公环境的细节，虽然很基础，但让整个公司变 得不同，比如，我们的客服人员被统一安排在一个大的办公室，只是分成了几排，特别是在大的开放空间中，员工可以很方便地聚在一起交流。我们的员工没有个人 专属垃圾桶，所有垃圾桶都放在开放区域，我听说这么做是为了让员工多出来走动走动，多聊聊天增进彼此的感情。

像这样的小事情无疑为某些已有事物增添了不一样的意义。当你跟一个以设计为导向的公司或是创业公司谈这些，他们可能会觉得你太大惊小怪了，但当公司慢慢变大之后就没有人特意去关心这些事情了，情况会越来越糟糕。所以我觉得设计在一定程度上改变了这种情况。</blockquote>
<strong>普遍性/整体性</strong>

设计不仅仅是设计师的事儿。

在一个真正的设计师文化中,组织里的每个人都能感受到自己有权参与设计过程,每个人都应该被鼓励运用设计思维去解决一些显然与设计无关的问题。

<strong>失败的自由</strong>

设计师文化对失败有很高的容忍度。员工会被鼓励不断地实验和迭代,所以有时难免会导致一些错误，他们应该能自由的去冒险并从错误中学习，而不用担心被训斥或解雇。真正的设计师文化会让人意识到错误之后所发生的事比错误本身更重要,它的价值观是快速修正而非一直谨慎行事。

<strong>积极主动性</strong>

只有当它处于积极主动的状态时设计才能发挥最大的影响力。

设计更重要的意义在于做出特定的决策而不是不断地响应分派的任务。在一个健康的设计文化中,设计师们花更多的时间在创造新事物或已有事物的创新上，而非做一些修修补补的工作或为公司解决某些烂摊子。

<strong>人性/同理心</strong>

设计师文化是关于重新发现商业中人性的一面。

20世纪的大部分时间里,商业活动完全是由数据和效益所驱动,而这往往会损害他们的员工和客户。只有那些拥有可衡量价值、能够用图表上的某个点来展现价值的事情他们才会去做,其他一切都不重要。

在某种程度上,设计师文化有点反数据驱动的意味。但数据是一种宝贵的资源,事实上，设计应该尽可能地依赖于定量研究。但设计绝对是反对一切以效益为先这点的。设计认为无法量化的东西与可量化的东西一样重要,就像情绪与智力同等重要一样。

也许公司无法从设计品牌指南或遵循相同的设计语言中获得直接可衡量的收益，但它可以让公司的文化和各种输出物让人更愉悦、更有人情味，同时也向世人展现出公司更值得追求的一面。

设计遵循格式塔原理。个别的改变可能不是可衡量的,但当他们累积在一起时经常会导致大幅上涨进而影响公司的盈亏。设计不是无效的投资，而是未来成功的基础。

设计正在成为公司中越来越重要的一部分，不论是小型初创公司还是传统企业。我们正处在一个过渡时期，很多高层管理者知道“设计师文化”是他们需要的东西，但他们不懂那意味着什么，只是沦为一种口号而已。

作为设计师,我们可以选择只在有很强设计文化的地方工作,但是我们也有机会将这些价值带入新的领域。我们的思维方式越来越被认为拥有巨大的驱动价值，越来越多的公司意识到设计是不容忽视的。

我们有机会在这个商业世界中传播设计的价值,让我们的组织更人性化也更成功。这是一个宝贵的机会。";s:10:"post_title";s:66:"设计师文化的内涵是尊重设计的价值这么简单吗？";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:198:"%e8%ae%be%e8%ae%a1%e5%b8%88%e6%96%87%e5%8c%96%e7%9a%84%e5%86%85%e6%b6%b5%e6%98%af%e5%b0%8a%e9%87%8d%e8%ae%be%e8%ae%a1%e7%9a%84%e4%bb%b7%e5%80%bc%e8%bf%99%e4%b9%88%e7%ae%80%e5%8d%95%e5%90%97%ef%bc%9f";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-21 12:01:49";s:17:"post_modified_gmt";s:19:"2016-07-21 04:01:49";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=532";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}