���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:907;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-25 21:26:46";s:13:"post_date_gmt";s:19:"2016-07-25 13:26:46";s:12:"post_content";s:11705:"<blockquote>近期豆瓣上线了4.0版本，曾经被寄予厚望的小事模块，被贬到了三级入口，“我的”里面。豆瓣热门的小组模块则回到了主导航中。小事模块上线10个月来，用户的非议较大，尤其是很多豆瓣资深用户对小事丝毫不感冒。迫于用户压力，此举则是宣告豆瓣放弃了从3.0版本开始主推的小事。</blockquote>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/07/douban-1.jpg"><img class="size-full wp-image-379835 aligncenter" src="http://image.woshipm.com/wp-files/2016/07/douban-1.jpg" sizes="(max-width: 680px) 100vw, 680px" srcset="http://www.woshipm.com/wp-content/uploads/2016/07/douban-1.jpg 680x, http://www.woshipm.com/wp-content/uploads/2016/07/douban-1-404x190.jpg 404x" alt="douban" width="680" height="320" data-original="http://image.woshipm.com/wp-files/2016/07/douban-1.jpg" /></a>

不同于很多资深豆瓣用户，我算是一个小事的忠实用户，豆瓣APP中最常用的就是小事模块。因此结合我本人的使用体会，分析一下豆瓣小事从上线到现在的种种。
<h2>什么是小事</h2>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/07/1-130-576x1024.png"><img class="attachment-large  aligncenter" src="http://image.woshipm.com/wp-files/2016/07/1-130-576x1024.png" alt="1" width="350" height="622" data-original="http://image.woshipm.com/wp-files/2016/07/1-130-576x1024.png" /></a>

小事是豆瓣APP在陌生人兴趣社交领域的一个尝试。小事孵化与小组和即时讨论。小事的产品形态类似于一个个不同领域的独立论坛，每个论坛中再以标签形式聚合一个个话题。小事的内容则是碎片化形式的动态，包含文字图片，有字数限制。

小事的场景，则是看陌生人的动态。我作为小事的用户，通常会有这么一些场景，比如旅行小事中，想约伴，看攻略和现场；比如民谣小事中，聊民谣，约音乐节；比如上班小事中，吐槽老板，找不到工作的发泄，等等。小事社交场景的核心，在于兴趣+实时需求，首先根据兴趣聚集在一个小事中，然后需要有实时需求，上来吐槽、找人。如果缺少这些需求，那就只剩无聊时刷动态了。

小事的陌生人社交效果究竟有多强，我觉得很少。除了有目的性的社交，比如旅行约伴，其他的动态，仅仅凭借闲聊形不成陌生人间的关系。而且小事的内容转瞬即逝，通常聊两句就会转移到下一话题，用户很难形成稳定的关系链。

我觉得最接近小事的产品是same（一款小而美、口碑很好的社交产品），同样是陌生人基于兴趣的社区应用。但是same本身并不以社交为目标，更多是让用户上来吐槽，发心情，强调表达，弱化关系。而小事则希望更多地进行社交。
<h2>3.0版本为什么要主推小事</h2>
小事从3.0版本开始上线。上线初期，小事作为豆瓣APP的主打功能，直接被放到了首屏。后来，小事被调整到了主导航的第二栏，依旧占据着重要的位置，有很多内容被推荐到首页。
<h3>那么豆瓣为什么要主推小事呢？说起来，无非是战略需要。</h3>
豆瓣在10年前，PC时代，是一代人心中真正的“精神角落”。而最近这些年，豆瓣起起伏伏，逐渐被知乎等社区超越，很多90后等新用户对豆瓣不怎么感冒。在商业领域也一直没有很好的商业模式，很久没有拿到新的融资。移动互联网时代，豆瓣一开始一直只有从PC端复制下来各个模块的APP。豆瓣这个大APP从上线开始，阿北一直想做出一些创新型的东西。豆瓣一直给人重内容，轻社交的感觉，因此他的目标，就是兴趣社交。

豆瓣1.0版本，推出了针对书影音的讨论组，这就是一种社交的尝试。但是效果不佳，大部分内容的讨论人气少，即使是热门的书电影等，沉淀不了内容，而且没有粘性。豆瓣3.0版本直接上线一个大模块小事，就是一个很大的社交尝试，一个纯移动端社区形态的尝试。而且刚上线在豆瓣站内大力度推广，企图快速度过冷启动阶段。至于小组，同样是兴趣社交，但很难作为移动端的主打功能，这点后面会写到。

还有一点，则是吸引新的用户群，确切的说是90后。豆瓣的核心用户群体是从10年前，豆瓣最好的时候开始，一直陪伴豆瓣走过来的那些人，普遍是80后。而对于更年轻的90后，如前所写，需要有处于成长期的产品来吸引这些用户加入豆瓣，而不是停留在老的成熟期产品。此外这些用户通常20岁左右，对于社交的需求更加大。就我的使用感受来看，小事中确实有更多的90后用户。

小事发展了10个月，用户、内容和话题的数量确实一直在增长（当然具体数据我不知道），单独拿出来，已经是个较为活跃的社区了。然而，小事还是没有达到预期，更是没有受到豆瓣核心用户的好评，所以在4.0版本中，小事被证明失败了。
<h3>现在为什么要放弃小事</h3>
那么，现在为什么要放弃小事，小事确实被证明失败了吗？如果把这个问题抛给一个豆瓣资深用户，他不出意外会给出一个非常肯定的回答。这就是豆瓣的尴尬了，辛辛苦苦上线一个战略板块，用户却不买账。具体来说，我认为豆瓣小事的失败在于以下几点。

首先，是核心用户群的反对，这是直接原因。如前面所说，豆瓣小事的用户群体更多是一些新用户，那对于豆瓣的老用户，尤其是豆瓣小组的核心用户来说，凭空出来一个功能相似的小事，就会感觉很不爽。此外，豆瓣的核心用户群体已经习惯了书影音和小组下的豆瓣，他们的需求是豆瓣的内容，并不需要社交。现在突然跳出一个社交模块，还在首页晃悠，给老用户看那么多他根本不想看的陌生人聊天内容，他们当然不高兴了。

事实上，一个社区产品，为了吸引更多新用户而损害老用户的案例挺多的，通常这样做比较危险，失去老用户对社区造成的风险会很大。知乎就经历过这样一个过程，现在虽然用户群体大，但早期的老用户流失了一批，造成了高质量内容的下降。因此，如何在新用户的增长，和老用户的利益之间做平衡，是件很值得玩味的事。

此外，用户对豆瓣的认知，比起其他产品，有一种特殊性。豆瓣是“精神的角落”，那些核心用户希望豆瓣保持着自己熟悉的样子，能看到自己想要的内容。如果有一天豆瓣突然变成自己不熟悉不喜欢的样子了，“精神角落”就没了，用户的不爽情绪自然会很高。

第二点，是小事的推广方式和过程过于急躁。3.0版本刚上线时，居然直接把一个新功能放在了首页，这放到几乎任何产品都是件不正常的事，更何况是有着很多积累的豆瓣。小事从上线后，几乎是无处不在，用户在首页等很多地方都能看到，忽略了培养用户习惯的过程。很多用户根本不需要这样一个社交功能，到处推广只会引起他们的反感。豆瓣一直是家慢公司，在这个事件上却显得很急，却没有收到很好的效果。

额外吐槽一下，豆瓣APP一反常态，在很多地方都显得很急，比如slogan，从“汇集一亿人的生活趣味”，到“和有趣的人做有趣的事”，现在又变成“我们的精神角落”。功能上也是一版一变，可见豆瓣APP的发展之路十分崎岖。

第三点，就产品本身来看，小事无法沉淀内容，根本不符合豆瓣的本质。这是小事失败的核心原因。豆瓣的主要功能是书影音，核心竞争力是从中沉淀下来的内容，豆瓣延伸的产品线比如同城、日记、豆列等，也都是内容的产出、发展。而小事，却是一个几乎不能沉淀内容的产品。小事中的话题真的只是聊天而已，极度碎片化，转瞬即逝，由于长短限制无法产生优质内容，又因为动态化的形式无法沉淀内容。即便是小组，还有篇幅较长的帖子和深入的讨论，小事做不到这些。

小事的形态和豆瓣的核心有着本质的矛盾。小事和书影音不互通，没有功能上的联系，小事的需求和使用场景是孤立的，用户只有在想社交的时候才会单独打开小事，而用户想看书影音等豆瓣本身的内容时，没有任何理由、场景去额外打开小事。因此，小事就是豆瓣APP中的一个孤岛。小组虽然也类似于孤岛（不完全是），但小组自己有内容，有生态。而小事，自身不能造血，没有内容沉淀，同时社区发展得一般，在豆瓣这个内容大生态中，很难生存下去。
<h2>小组与小事，各自的好与坏</h2>
熟悉豆瓣的用户，在小事刚上线的时候，都会发现小事和小组很像，都是针对话题的陌生人的社交。因此，为了推广社交，豆瓣APP为什么要额外开发小事，而不直接推广小组呢？

首先，就产品生命周期来看，豆瓣小组是一个已经过了成熟期的产品。豆瓣小组是是个经历了10多年的产品，早在豆瓣最热的那会，就已经有相当高的用户量和粘性。后来豆瓣一直起起伏伏，豆瓣小组也一直维持原状，有些小组渐渐出现了很多广告，人气下降。豆瓣APP上线后，如前面所写，需要一个社交的模块。而豆瓣小组是一个典型的PC端论坛，成熟期的产品不适合大改。于是出现了小事。小事是一个初创期的产品，还没有成型的模式，因此作为豆瓣APP在社交方向的试验品。

其次，是产品形式和功能。在用户间关系上，豆瓣小组更类似于QQ群，因为小组是自己建的，所以每个小组都是独立的，都有自己的江湖。而小事是中央管理的，基于官方的话题标签来聚合用户，用户间没有固定的关系。在产品功能上，小组是典型的PC端传统论坛，小事则是移动端的社区，除了话题标签，还结合了LBS、好友关系，有更多功能拓展的空间。

尽管小事更加创新，但作为成熟的社区，小组有很多小事替代不了的地方。这其中最关键的一点，就是用户粘性。豆瓣小组的用户粘性在一众社区中相当高，热门帖子能有上百页的回复，只要社区的氛围不减，用户粘性就会保持，那么用户的迁移成本相当高。小组发展到现在，有些小组比如穷游天下，现在剩下各种广告。但诸如吃喝组、八卦组等热门小组，人气依然相当高。

现在的4.0版本，小组被提到了主导航中，重新发挥起作用。当然小组现在存在着一些问题，看豆瓣如何解决了。
<h2>结论</h2>
从小事的历程中，可以看出有两点，可以作为豆瓣社交的参考。第一是与书影音的关联，以及内容的沉淀，需要和豆瓣一直以来的核心关联起来，而不能变成一个孤岛。第二是用户社交的场景，豆瓣的用户究竟在什么场景下，会尝试这种陌生人社交。

至于小事还会活吗？不一定。但只要一直放在三级入口，那小事吸引新用户的能力会大大减弱，对于一个还处于成长期的产品来说，这代表着什么不言而喻。

&nbsp;";s:10:"post_title";s:48:"从风光到失落，浅谈豆瓣小事的历程";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:144:"%e4%bb%8e%e9%a3%8e%e5%85%89%e5%88%b0%e5%a4%b1%e8%90%bd%ef%bc%8c%e6%b5%85%e8%b0%88%e8%b1%86%e7%93%a3%e5%b0%8f%e4%ba%8b%e7%9a%84%e5%8e%86%e7%a8%8b";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-25 21:26:46";s:17:"post_modified_gmt";s:19:"2016-07-25 13:26:46";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=907";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}