�A�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"782";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-23 15:28:46";s:13:"post_date_gmt";s:19:"2016-07-23 07:28:46";s:12:"post_content";s:10296:"<img src="http://www.pmtoo.com/uploads/allimg/160721/2255493E6-0.jpg" alt="" />

来，我们谈谈薪 。

薪酬这件事，明明是工作生活中的重要一环，却不知为何，变成和性一样的隐秘话题。

我们不好意思跟上司谈。

不好意思跟父母谈。

不好意思跟交往对象谈。

翻翻账单，一个人愁眉苦脸。

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/2255491350-1.jpg" alt="" /></center>　　什么，你不愁?那我们先来看几组数据。

★ 目前，全国34座主要城市的在线职位 平均薪酬为7233元 。其中北京第一，9240元;上海第二，8962元;深圳第三，8315元;广州第四，7409元;杭州第五，7330元。

★ 2015年全行业 平均薪酬增长率8% ，其中互联网金融涨幅14.2%，互联网整体涨幅11.5%，医疗服务涨幅9.8%，高科技制造业涨幅9.4%，传统金融涨幅8%。

★ 多数咨询公司预测，2016年薪酬增长趋势并不太好，预计比例在7%—7.5%之间。

怎么样，你的第一反应是“我拖祖国后腿”，还是“我是人生赢家”?无论是哪种，我们的目标都一致：2016年，跑赢大趋势!

为此，我们要勇敢谈谈薪。本期M周刊，就从 完善的薪资结构是什么样 、 如何跟上司谈加薪 和找工作如何谈薪水 三方面，聊一聊薪酬的话题。

<strong>　　No.1 完善的薪资结构是什么样?</strong>

“张华考上了北京大学;李萍进了中等技术学校;我在百货公司当售货员：我们都有光明的前途。”

这句如今的笑话，正体现着几十年前的薪酬制度： 区分干部和工人身份，影响相应工资， 大学生和中专生毕业都是国家干部，而百货公司这种 垄断性事业单位的福利高。

可见，无论什么时代， 了解薪酬制度才能谈“光明前途”。

当今这个时代，较完善的薪资结构则是这样：

<strong>　　1 月度结构，一般包括：</strong>

① 基本工资，和岗位、职级、职业技能等级挂钩;

② 绩效工资，和个人主观能动性挂钩;

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/225549CM-2.jpg" alt="" width="469" height="220" border="1" /></center>　　③ 津贴、补贴，和工作特殊性挂钩，常见的包括交通、餐费和话费补贴，或是夜班津贴、有毒有害津贴等;

④ 福利，主要是五险一金。

<strong>　　2 年度结构，一般包括：</strong>

① 12月薪资+第十三薪;

② N月年终奖;

前两项就是一般员工能拿到的年度薪酬，以腾讯为例，招聘部门对外承诺12+1+1，但大都能够实现12+1+3(只要你不在年度考核中被开除)。

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/225549Bc-3.jpg" alt="" /></center>　　③ 年终绩效，即根据年度KPI考核发放的奖金，很多公司将这一项和年终奖合并。

有时绩效奖金并不是年末发放，而是在项目取得阶段性胜利时。但无论如何，这项酬劳反映了，随着职务的升高，许多绩效考核不能再以月度为口径，而要从年度上看。

这也是为什么在一家公司里，员工采取月薪制，而高管采取年薪制。

<strong>　　3 期权与配股：</strong>

这一项主要针对互联网、高科技制造等新兴产业的高管，尤其是创业公司的高管。

以阿里巴巴为例，从P7(技术专家，或对应管理层M2)开始配给2400股，依级别升高而配股递增。不过要工作满两年才能开始拿，第一次拿50%，四年全部拿完。

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/22554923R-4.jpg" alt="" width="500" height="362" border="1" /></center><strong>　　4 涨薪机制：</strong>

一家靠谱、健全的公司，每年应当有两次调薪考核，根据此前的员工绩效决定下一阶段的薪酬。

毕竟，广义货币M2的年涨幅都在12%以上， 如果不涨薪，就是在被降薪。

但必须承认的现实是，在中国企业界，哪怕是内部治理颇为优秀的企业，也常常没有良好、稳定的调薪机制。

这就导致，员工找上司申请涨薪的时候，常常有一种“厚着脸皮去谈”的感觉;或者，跳槽成了最好的涨薪方式。

那么，了解薪酬结构之后，我们究竟应该怎么跟上司申请加薪?

<strong>　　No.2 如何跟上司谈加薪?</strong>

对计划经济嗤之以鼻的你，或许没有发现，所有企业的内部都是计划经济。按照经济学家科斯的观点，能够通过权威在小范围调配资源，节约交易成本，正是企业存在的意义。

但这也导致了， 只有在谈劳动合同的那一刻，你的薪水才准确反映了你的“市场价格”。 (当然，前提是你没忽悠人，或是被忽悠)

而后越来越错位。

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/2255495423-5.jpg" alt="" /></center>　　这就是为什么，很多人通过跳槽来涨薪。这也是为什么，有些公司的新员工会比老员工收入高。(学名“薪酬倒挂”，这也是薪酬保密制度存在的重要原因)

虽然如此，我们还是要主动争取一下，万一实现了呢?

<strong>　　1 毋庸置疑，要输出自身价值</strong>

Pay more, get more. 尤其是打算申请加薪之前，应该付出更多努力，承担更多责任。

<strong>　　2 学会汇报工作，让上司清楚你的贡献</strong>

关于这一点，可以回顾往期M周刊：《怎么跟老板汇报工作，会让他觉得“这个下属不错”?》【点击阅读】

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/22554922E-6.jpg" alt="" width="298" height="160" border="1" /></center><strong>　　3 接下来分为两种情况：</strong>

<strong>　　① 直属上司不是老板</strong>

注意，在这种情况下， 上司其实是你加薪谈判中的队友 ，要争取让他(或她)帮你申请加薪，而不是把他驱赶到对立面上。

一个合格的中层管理者，是希望留住优秀员工、保持团队工作积极性的，只要让他认识到你的价值，他就有动力为你争取权益。

因此，和他沟通涨薪的方式，不是针锋相对的指明“我的收入和贡献不符”(潜台词：你看不出来吗?这么没眼光)，这会把他推到对立面。

应该在非正式的场合，委婉地让他意识到，是时候考虑手下的薪酬问题了。比如，小巴交上这篇文章后，主编大人就抓住我塞了一份鸡排一听可乐和三根棒棒糖。

在此之后，再强化“自身价值”和“贡献”一段时间，最后申请和他聊聊“职业规划”，诚恳地表明自己的诉求。

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/2255491160-7.jpg" alt="" /></center>　　如果有一位认可你价值的领导，这样做的成功率还是挺高的。但在这个过程中，切忌：A.表明自己有意跳槽(哪怕你确实拿到了其他offer，也不要明说);B.和其他同事进行比较。

<strong>　　② 直属上司就是老板</strong>

看来，你要么是大公司里的高管，要么是小公司里的核心员工。这种情况下，老板其实非常清楚你的绩效完成情况。

只要你工作做好，尤其是在顺利完成某项目的时候，但凡不是狮子大开口，老板都是容易答应你的加薪要求的。

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/2255493319-8.jpg" alt="" /></center>　　这里只有几点需要注意：A.不要通过卖惨来申请加薪，强调房价有多高，不是老板给你加薪的理由;B.过去的工作总结固然要做，但也要让老板有对你未来的预期，毕竟， 加薪对他来说是“新投入”，要让他看到“新产出”。

以及，在老板面前，切忌耍小聪明。

以上是一些申请加薪时的规则，但是如果你希望来一次幅度30%以上的涨薪，在不升职的情况下，寄希望于内部调薪就比较困难了。

这时候我们就该考虑，如何跳槽，以及跳槽时如何谈薪酬。

<strong>　　No.3 找工作时如何谈薪水</strong>

和应聘公司的HR谈工资，不同于内部调薪的最重要一点，在于 双方的平等地位 ，能成就成，不成拜拜。

因此，应该直接说出自己的诉求，你的诚实与专业，都是对对方的尊重。

具体而言，分为以下步骤：

<strong>　　1 回答期望薪资前，先问公司的薪资结构</strong>

具体结构如我们第一部分所述，细致地问，反而能让HR认可你的专业性。

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/2255492L1-9.jpg" alt="" /></center>　　凡是在任何一部分有意含混、虚与委蛇的公司，一定不靠谱，果断走人。

<strong>　　2 根据对方的信息，定出有利于自己的薪资</strong>

当然，这一步包含提前要做好的工作：搜集市场信息，结识猎头，根据不同的预案估算等等。

<strong>　　3 坦率告诉对方自己的目标薪资，展示诚意</strong>

如果目标薪资相较于上一份工作的薪资，涨幅在30%以内，也可以直接告诉对方。

如果差距太大就别说了，但也不要虚报，可以强调自己即将带来的价值。

<strong>　　4 协商</strong>

如果HR同意，继续往下谈;如果不同意，说明至少他一人无法做决定，请他和自己的未来领导沟通，剩下的就随缘了。

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/22554930P-10.jpg" alt="" /></center>　　在中国，雇佣关系里常常会强调一些类似“知遇之恩”“赏识之情”的道德。但说到底，员工和老板之间是互利互惠的，谁也不欠谁。

愿大家都能遇到不画大饼的老板，拿着满意的薪水，斗志昂扬地工作。

最后，关于薪水，你有哪些有趣或无奈、成功或失败的经历呢?在评论区里说说吧~(友情提示：吐槽止于前老板，对现任上司要不吝夸赞，小巴和读者们会视情况助攻的!)";s:10:"post_title";s:48:"别害臊，本文教你如何跟老板谈加薪";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:144:"%e5%88%ab%e5%ae%b3%e8%87%8a%ef%bc%8c%e6%9c%ac%e6%96%87%e6%95%99%e4%bd%a0%e5%a6%82%e4%bd%95%e8%b7%9f%e8%80%81%e6%9d%bf%e8%b0%88%e5%8a%a0%e8%96%aa";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-23 15:28:46";s:17:"post_modified_gmt";s:19:"2016-07-23 07:28:46";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=782";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}