m�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1171;s:11:"post_author";s:1:"3";s:9:"post_date";s:19:"2016-07-28 12:37:33";s:13:"post_date_gmt";s:19:"2016-07-28 04:37:33";s:12:"post_content";s:15024:"现在很多设计师都提倡从数据出发做设计，但是我们做这些数据分析，是否仅仅是为了提升这些数据目标？如何在提升数据目标和真正有意义的功能之间找到平衡？我们到底是被各种数据目标牵着走，还是真正的为提升<span class="wp_keywordlink_affiliate"><a title="查看 用户体验 中的全部文章" href="http://www.uisdc.com/tag/%e7%94%a8%e6%88%b7%e4%bd%93%e9%aa%8c" target="_blank">用户体验</a></span>着想？来看Facebook产品总监的答案。
<h4><strong>作者介绍</strong></h4>
Facebook 的产品总监Julie Zhuo 是一位经历传奇的女性，2006 年进入脸书后，职位像火箭般不断攀升，现在已经是Facebook 的VP了。她的Medium （<a href="https://medium.com/@joulee" target="_blank">https://medium.com/@joulee</a>）几乎是最受欢迎的设计师个人博客，国内有很多设计师都是她的忠实读者。这里有几篇她的文章，可以让你学习：
<ol>
 	<li><a href="http://www.uisdc.com/facebook-direction-product-design-summary" target="_blank">《FACEBOOK设计总监：我的产品设计年度总结》</a></li>
 	<li><a href="http://www.uisdc.com/facebook-constraints-are-hard" target="_blank">《FACEBOOK产品总监：聊聊资深设计师经历过的瓶颈期》</a></li>
 	<li><a href="http://www.uisdc.com/designer-learn-from-pm" target="_blank">《我待PM如初恋！设计师必须向产品经理学习的四个技能点》</a></li>
</ol>
回到几十年前，你如果想打造完美的<span class="wp_keywordlink_affiliate"><a title="查看 用户体验 中的全部文章" href="http://www.uisdc.com/tag/%e7%94%a8%e6%88%b7%e4%bd%93%e9%aa%8c" target="_blank">用户体验</a></span>，只需闭上眼深呼吸，然后得到神的旨意：跟着感觉走。

后来，正如先祖们学会了利用火力，我们也学会了使用各种数据分析手法。从此，我们不用再在黑暗中摸索，忐忑地怀疑「到底有没有人点开我发出的邮件」或者「究竟多少人使用了我们的新功能」。我们只需要打开从各个渠道收集到的珍贵数据，心中的疑问便有了答案。

然而，数据目标（Metric）的出现给我们提供了便利，但也存在局限。茶余饭后，我听到对于一些矛盾的观点，大家经常会有激烈的讨论。我们的纠结点主要在：
<ol>
 	<li>我们做这些数据分析，是否仅仅是为了提升这些数据目标？</li>
 	<li>如何在提升数据目标和真正有意义的功能之间找到平衡？</li>
 	<li>我个人最认同的一条：我们到底是被各种数据目标牵着走，还是真正的为提升用户体验着想？</li>
</ol>
关于这些尖锐的问题，我写下了以下思考。

<img class="alignnone size-full wp-image-194311" src="http://image.uisdc.com/wp-content/uploads/2016/07/sh201607272.jpg" alt="sh201607272" width="800" height="603" />
<h4><strong>首先，切勿让「数据目标」与「用户体验」对立</strong></h4>
在好莱坞大片中，英雄和坏蛋正反两派往往势不两立。除了这种情况以外，都不应该让产品的「数据目标」与「用户体验」彼此对立。不然，就好像说「碳水化合物」与「健康」是相对立的，这看起来错的离谱。

首先，用数据来测控产品，能让你了解到用户的使用情况。除非你喜欢与世隔绝的，不然还是应该多掌握一些信息。诚然，信息量太大，你若是没有判断和筛选能力，往往会事与愿违，但别因为这点就觉得数据指标洪水猛兽。

第二，如果产品的改进让用户觉得很有意义，数据指标自然就会上升。但如果使用产品的体验没有什么改变，就不能说你的改进很成功。相反，如果你做了一些调整，但使用的人数因此减少，那么不管你做了什么，只能说明一个问题——你搞砸了。

数据目标很有价值的第三个原因：它能把整个团队团结起来，大家围绕着一些清晰和有形的指标，各司其责。单纯从逻辑上讲，让50个员工在一起，为了所谓「创造超绝佳的用户体验」这样一个目标奋斗，是极其困难的。当你发表完激情洋溢的激励演说，他们倒是会持续鼓掌，然后说道「好的，加油！为了绝佳的用户体验奋斗！这就是我们追求的所有！」但当新一周开始，A团队兴高采烈的说：「看！这就是我们创造的绝佳用户体验！」而B团队则说：「不是吧，这个看上去一般般。」出现这种情况到底是因为什么？谁的观点才是正确的？我们如何能够持续有效地定义到底什么是「绝佳的用户体验」？

解决这个问题的一个方式，就是设立层层评估的等级制度。你可以指定公司中某一个人（或者一系列不同梯队的人）来对产品的质量高低进行评断。如果不喜欢这种等级制度，那么也可以设定具体目标来进行测控，例如：如果50%的人会在一周内使用两次以上，那就说明这款产品的用户体验非常好。现在，团队A和团队B不仅明确了他们的努力方向，日常的工作结束后，也都能找到与目标的差距。

总之，数据目标是很有用的，它和用户体验不应陷入永久的竞争对立局面。所以作为领导者，注意不要表达出这样的意思。

<img class="alignnone size-full wp-image-194310" src="http://image.uisdc.com/wp-content/uploads/2016/07/sh201607273.jpg" alt="sh201607273" width="800" height="533" />
<h4><strong>其次，别为了追求「数据目标」而顾此失彼</strong></h4>
这就好比，你吃太多甜甜圈而导致肚子疼，然后就觉得碳水化合物不是什么好东西。同样，数据目标也会导致一些评判欠妥当。这类事件究其原因有二：一、并不是所有能够被测控的东西都值得被设定目标，而且也不见得能产生什么影响。二、只是单纯的看数据，也不能统揽事情的全局。通常，想要看的更宏观，你需要一系列的统计数据。

如果你恰巧找错了测控的方向，却还继续推进，那么事实上你可能正在损害用户体验。

来看一些例子：

a）原先这个页面的点击率是2%，在我们调整之后，点击率变成了5%，真是太赞了！

问题出在哪？点击率并不能准确地告诉我们用户体验是否得到了改进。比如，我把网站上所有的链接都改成「点这里来赢取250元话费！」这样一来，点击率自然上升了。但最后，人们可能发现，事实上我并没有给他们250元的花费，那他们肯定会骂死我，从而不会点击链接，更会卸载应用，然后在应用商店里面给我一个一星差评。结局就是这样。

b）人们原来每天使用我这款应用的时间是5分钟。现在新功能上线后，他们每天的使用时间就只剩3分钟了，唉。

问题出在哪？你要考虑下，用户的在线时间到底是不是一个有效指标？这个得具体问题具体分析。如果你的应用以内容为主，那么答案是肯定的——这款应用存在的目的是给人们一些好文章去读、好的东西去看去听，所以他们在线时间越长，他们就越能发现你提供的东西很有价值。

但如果你的产品只是单纯的应用性质，比如帮助别人签署数字文档，那答案就是否定的了。你需要去搜集一些其他的数据指标来测控应用的用户体验，比如这款应用真正帮助人们签署文档的次数等等。实际上，用户可以因为能更快地签署文件，所以更喜欢这个应用。久而久之，他们才会关联使用到你能提供的其他服务。

c） 「原先使用我们产品的人大多都在北京，但现在上海的用户更多一些。」

这个问题出在哪？兄弟，这其实根本不是问题，也根本不是值得你关注的数据。

<img class="alignnone size-full wp-image-194309" src="http://image.uisdc.com/wp-content/uploads/2016/07/sh201607271.jpg" alt="sh201607271" width="600" height="300" />
<h4><strong>当然，有些问题不是光看数据就能发现的</strong></h4>
理论上来讲，如果我们了解用户的需求，我们就能设计出用户体验极佳的产品。但遗憾的是，不是每个人都会读心术。所以我们只能尽力而为，去猜一猜用户都关注什么。在这个时代，我们需要时刻铭记：能测控的指标是有限的。仅仅关注用户如何使用你的产品，并不能告诉你：
<ol>
 	<li>用户喜欢你的产品吗？他究竟关注你的产品或是产品这个功能吗？</li>
 	<li>你对产品进行了更新，那么用户对这款产品的信任，从长远来讲是增强还是削弱了？</li>
 	<li>在用户预期中，产品的简单性和易用性究竟如何？</li>
 	<li>相较于市场上的其他精品，用户对你的产品怎么看？</li>
 	<li>人们最想改变、最想增加或者最想修正的产品功能是什么？</li>
 	<li>长远来看，用户对你的产品有着怎样的期待？</li>
</ol>
你可以尝试通过定性研究（qualitative research）或者用户调研来得到上述问题的答案，但其实这些措施并不能完美解决你的问题（想必你还记得那些用于预测「脱欧」结果的民意调查？）甚至在一些事情上，你虽然能准确地做到宏观感知（比如了解群众对品牌的信任度），但很难了解某些改变到底产生哪些特定的效果（例如：公司所采取的最新Logo和视觉特效，到底有没有改善大众对这个品牌的印象？）如果不能将以上信息量化，说明我们并没有真正地做到数据测控。看看几个例子你就懂了：

<strong>复杂功能的代价</strong>

当你每次在产品上增加新功能时，你追踪的数据目标似乎都能显示出产品越来越好。然而，如果你不停地给这个产品添加新功能，久而久之，在某种程度上大家到最后都会觉得这个产品冗杂。紧接着，一些新的竞品会很快受到大众青睐，因为人人能都爱「傻瓜软件」。让你的用户感到产品过于复杂，那么你必然要为此付出代价。如何对其复杂化进行调整和取舍，是最真实可感的矛盾。

<strong>了解品牌的效应</strong>

每当苹果或者耐克发布一个新产品，很多的人会争先恐后地购买，甚至都不经过大脑的思考。因为在这之前这个品牌已经让他们有了特别好的体验。但换做是别的新兴品牌，比如叫做梨子或者赛克的公司，即使它们发布了同样水平的新产品，也不会有人如此争先恐后地购买。一定程度上，我们都理解这种现象。但问题是，将品牌效应进行量化，或者把它变成可追踪的数据目标是非常难的。更别提一个公司做出的千百条决策，会对品牌造成怎样的影响及利弊得失。

<strong>放手赌一把！</strong>

数据目标无法告诉你怎么去大胆行动而赢得未来。让我们回到2008年，那时候智能手机还刚刚起步。如果你观察你网页上对于智能手机的统计数据，就会发现，使用它的人简直太少了。你很可能得出一个非常现实的结论——就是你不该把钱投在这样一种受众小的手机上。

而如今我们才意识到，那些把钱赌在智能手机而赚得盆满钵满的人，是多么的高瞻远瞩。因此，针对当前人群表现的测试并不能准确地告诉该走哪条路。深谋远虑仍然需要一个老办法：相信直觉。

<img class="alignnone size-full wp-image-194308" src="http://image.uisdc.com/wp-content/uploads/2016/07/sh201607274.jpg" alt="sh201607274" width="800" height="730" />

1. 哇，这点子好棒 2. 呃，怎么是这样的呢 3. 这点子糟透了 4. 我怎么这么笨 5. 也许，可以？6. 可以，这很特赞！
<h4><strong>最后，一些巧妙应用数据目标的法则</strong></h4>
以下就是我关于数据目标的5条应用法则。

<strong>观察产品的用户留存率</strong>

别光看产品的用户绝对数量（过于激进的营销手段会造成用户量很大的假象），你应该关注用户留存率，最好结合你的产品价值来看，因为通过这种方式你才能知道人们使用之后是否喜爱它，以至于会回来再用。

为了优化产品，一定要了解你的营销漏斗模型（指营销过程中，将非用户或潜在客户逐步变为用户的转化量化模型）。

人们要成为产品的常用用户，需要突破重重障碍。首先，他们要知晓你产品的存在；其次，他们的有足够的兴趣看上第二眼；第三，他们要做很多入门工作（比如下载应用、填写表格、确认邮件等）；第四，他们还得鼓捣半天才能知道过日子要它有何用；第五，他们得想得起来回来用。在上述的每一个环节中，都会发生潜在客户的流失。如果你能追踪并测控出流失率在哪，你就可以开始着手改善你的营销漏斗，让它没那么容易漏掉用户。

<strong>思考并聚焦真正有意义的数据测控</strong>

你也许很享受那种追踪所有数据投入状态，你也希望所有数据都是漂亮的，但你要意识到，只有少部分数据能起到关键作用。其他的都是鸡肋，是做出一点改进就能解决的。别浪费时间扯些有的没的，也别费心思去关心那些非关键数据的起起落落。

<strong>不要不加理解就接受一个数据目标</strong>

我着重强调一下：你和你的团队共同认可的目标将会对工作产生重大影响。不要依据表面价值去接受一个数据目标。要问问自己为这么这么做。有没有这样的情况，这个决策感觉很棒，但数据指标并没有变化？反过来，你看到数据在飙升，但是并不确信产品一定就好？你应该仔细思量它们的意义。

<strong>通过设置对立数据目标，批判地看待数据结果</strong>

如果数据向你展示出了貌似很好的结果，就问问自己：「我还能观察哪些数据来辅助判断？」这些就称作对立数据，每一个成功数据目标的背后都有一些对立的度量。（例如，看了点击率就也一定要看回头率，看了产品的销量就也一定要看退货和取消订单的数量，等等）对数据结果偏执狂般的解读是件好事，这样你能快速找出错误并调整策略，但不要过于陷入其中。

<strong>利用定性研究寻找背后的原因</strong>

定性研究告诉你人们做了什么，定量研究帮你知晓人们的感受，两者相辅相成。对于产品，进行可用性的测试、焦点小组、调查研究，这样你就能理解到表象行为背后的内在原因。";s:10:"post_title";s:68:"FACEBOOK设计总监：别拿数据一刀切，产品还得看体验";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:188:"facebook%e8%ae%be%e8%ae%a1%e6%80%bb%e7%9b%91%ef%bc%9a%e5%88%ab%e6%8b%bf%e6%95%b0%e6%8d%ae%e4%b8%80%e5%88%80%e5%88%87%ef%bc%8c%e4%ba%a7%e5%93%81%e8%bf%98%e5%be%97%e7%9c%8b%e4%bd%93%e9%aa%8c";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-01 15:14:54";s:17:"post_modified_gmt";s:19:"2016-08-01 07:14:54";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1171";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}