�̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:562;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-06-21 14:43:10";s:13:"post_date_gmt";s:19:"2016-06-21 06:43:10";s:12:"post_content";s:1466:"<div class="thumbnail-b"><img class="attachment-large wp-post-image" src="http://www.520ued.com/uploads/20160322/1458621368.png" alt="前端开发招聘(持续中)" width="630" height="360" /></div>
<div class="entry">
<h3>腾讯-（深圳）商业平台设计中心招聘前端开发2名</h3>
1、3年以前前端经验。

2、精通html css，熟练使用原生js或各种类库，例如：jQuery。

3、熟练使用常用调试工具。

4、对seo、信息无障碍、移动端开发有经验者优先。

5、人靠谱，人靠谱，人靠谱。

工作地点：深圳

学历大专以上。

满足以上条件者，请发简历至 owenhong@tencent.com

招聘要求如上，先爆一下现在的团队照片吧：

<img src="http://520ued.com/uploads/20160322/1458626923.jpeg" width="2405" height="3764" />

<strong>目前团队氛围非常好，每两周都有内部餐聚，还有技术分享会，团队中有非常多前端大牛，还有非常多美女程序员，神马程序员鼓励师这种岗位在我们这不需要，因为你会长期和各种美女设计师进行上下游的工作，你懂的。在这里你会有追逐的目标，有学习的目标，如果你希望加入我们，成为我们中的员，想一起成长，一起哭，一起笑，请投简历过来。这年头投份简历过来不会少块肉，期待的各位英豪的加入。<img src="http://img.baidu.com/hi/jx2/j_0005.gif" /></strong>

</div>";s:10:"post_title";s:29:"前端开发招聘(持续中)";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:81:"%e5%89%8d%e7%ab%af%e5%bc%80%e5%8f%91%e6%8b%9b%e8%81%98%e6%8c%81%e7%bb%ad%e4%b8%ad";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-21 14:44:49";s:17:"post_modified_gmt";s:19:"2016-07-21 06:44:49";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=562";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}