̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:214;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-18 18:29:57";s:13:"post_date_gmt";s:19:"2016-07-18 10:29:57";s:12:"post_content";s:9999:"<img class="fr-fil fr-dib" src="http://img.ui.cn/data/file/3/6/5/698563.png" alt="Image title" width="900" />

不知不觉，我已经正式在交互设计的路上越走越远，了解得越多，就觉得交互设计需要学习和掌握的知识越多；同时犯的错也会越多。然而犯错并不是一件坏事，怕的是犯过的错误不能够被积极地思考，我们不能及时把错误化作成长。根据目前我的一些浅薄经验，总结出了交互新人往往容易犯的一些错误，以及关于错误的一些思考。

&nbsp;

<strong>1. 工具崇拜</strong>

新手们在学习交互设计时永恒的问题是：需要会什么软件。类似地，新手们会被误导觉得产品经理等同于axure，UI设计师等同于photoshop。即使是已经入行一段时间的新人也会沉醉在研究各种设计工具中不能自拔。一个非常普遍的现象是，新手在大神的作品评论区里永远只问一个问题：大神你用的什么软件？

工欲善其事必先利其器，这句话没错，但是这句话是让我们利用工具去提升效率，让我们的设计能够迅速准确地表达开来。我也曾一度迷失在学习各种工具的恶性循环之中，例如我在交互设计的岗位上工作不久的时候，听说交互设计师要会设计动效，于是赶紧去学习动效，最初接触的是AE，后来发现AE把动效实现得再好，也只能是输出一个只能看的GIF图或视频；后来听说ORIGAMI+QC、FORM可以做可交互原型，于是就各种找资料学习，却发现学习成本好高；后来有人说用Pixate可以非常容易地做可交互原型，于是就开始学习Pixate，后来却又发现Pixate太局限；之后相继学了FramerJS、Flinro和Principle。最终觉得好烦，干嘛学这么多软件，又要花很多时间，最终不还得让开发写，干脆自己直接学代码得了，于是又开始了解代码…

这样做，结果就是最后什么都没有学会，但好像什么都懂一点。然而工作效率却一点没有提高，这么做，是因为我并没有真正意识到工具能为自己带来什么。其实一支笔一张纸也能充分表达你的设计，而这些工具只是代替了你的纸和笔，提高了你的输出效率以及质量，帮你把设计思考实现地更完美而已。

工具永远代替不了你的设计思考。

交互设计师最核心的竞争力还是设计思想，所以设计新人不要去贪图学习各种设计工具，而是把自己的设计基本功弄扎实，再去找适合自己的工具来表达你的设计思想。

&nbsp;

<strong>2. 线框图要好看，有逼格</strong>

刚入行的时候作为一个新手，大家都会告诉你，交互设计师就是将业务需求转化为线框图的这么一类人。那么你就有可能会单纯地认为交互设计师一定要把线框图“画”好，你会想好多人都把线框图画得那么丑，我一定要和他们不一样，我要画得好看有逼格，于是你就找到一些dribbble大神的线框图作品（如下图），去模仿去借鉴，殊不知这些线框图只是一些视觉设计师的意淫作品，无数个交错复杂的连线和箭头，让看你交互文档的人不知所措，阅读起来异常困难。过度的视觉元素的出现，常常会误导与你配合的视觉设计师，也让他们抱怨你把他们的工作给做了，而且还做得这么糟糕。

曾经我也用了很长时间想把自己的线框图“画”好，但是却适得其反。本来几个小时的工作量却花了整整两天，极大地降低了自己的效率，并且我曾沉醉于各种排版布局的思考之中：斟酌各种圆角、用色、甚至还想着去给视觉设计师建议…却忽略了设计方案本身。最后的设计输出并没有像dribbble大神的作品那样美观，反而还出现了许多设计漏洞，经不起别人的推敲，而且后期维护起来也非常麻烦，改稿这件事也变得很艰难。

所以最好的设计输出物，是让看你交互文档的人快速理解你的方案以及设计思想，保持基本的美观，注意排版整洁，字体清晰大方就够了，把主要精力放在设计思考本身上面来吧。

&nbsp;

<strong>3. 思考不全面</strong>

设计新人思考设计的时候不全面是很容易犯的错误，这很大程度上是设计经验不足、不了解业务造成的。这些都是情有可原的，但最怕的是偷懒造成的。

曾经我拿到一个需求的时候，脑海里立刻就会出现了几个方案。简单斟酌以后，认为方案A会更加合适，并且画线框图也不复杂，于是就不假思索地选择了方案A，画起了线框图。自己做得很快，也认为自己设计效率好高，对自己很满意。

结果是到了审稿的时候，就会遭到各种质疑，产品经理会问为什么不选择B方案，B方案的好处有balala…开发人员会问为什么选择A方案，A方案实现难度大且性价比不高。由于之前没有仔细思考其他方案的利弊，就很难去应对大家的质疑，然后我就一脸蒙逼地看着大家，语无伦次地掩饰着自己的设计错误，并且也不能够说服大家自己的方案到底好在哪里。显然这次的设计思考是失败的，方案也是失败的。

如果作为一个交互新人每次都能把所有的方案想清楚，尽量不漏掉，包括你为什么最后选择了这个方案，以及其他方案你是怎么想的，怎么思考的，那你在面对质疑的时候就会非常自信，即使你的想法是有待改善的，大家最后说服了你，大家也会认为你进行了认真地思考，当然你若是用你的思考说服了大家，那么也会增强其他与你配合的人的认同感，相信你是最专业的。

&nbsp;

<strong>4. 不能独立思考</strong>

作为一个交互新人，你每天面对的是比你经验丰富的资深交互设计师，有经验的产品经理，身经百战的开发人员。所以新人就容易变得“谨慎”、“听话”，觉得他们说什么都对，当然了，能够听取别人的意见是好事，但是听取别人意见的时候一定要有自己独立的思考，面对比你资深的人的意见，你要大胆地说出自己的想法，与之共同探讨问题的原因以及解决方案。即使你说得不对，但在这个探讨的过程中也是一种进步，最后虚心接受意见。在与人探讨的过程中，虽然自己有了独立思考，但是不要固执地认为自己一定就是对的，我行我素不接受别人的意见，最后犯了错还推脱责任，找各种客观理由。

&nbsp;

<strong>5. 只做设计，不跟进</strong>

初入交互设计岗位，总是认为做好自己的事情就万事大吉了，常常是做完一个任务之后，就立刻进入到设计第二个任务的工作之中，前一个任务似乎完全跟自己没有任何关系了，这常常会导致后面的视觉、开发效果与自己的交互输出不太一致，背离的自己当初的设计初衷，而这个情况由于自己没有及时进行跟进，导致自己不能很快发现问题，并解决问题，严重的会导致一些不必要的返工，拉长了项目周期。

交互设计文档的提交，其实并不代表自己本职的工作的结束。作为交互设计师还要对后面的视觉，开发等环节进行跟进。在这个过程中可能会出现一些新的问题，如果你一直在跟进，就会对新的问题作出迅速的反应，及时调整设计方案，保证项目正常且高质量的进行。

&nbsp;

<strong>6. 不会拒绝</strong>

在工作中，由于产品经理常常忙于各种会议，各种沟通协调等事，而常常不会出非常详细的需求文档，需求常常是几句话，一个竞品的截图等等。作为一个新人交互设计师常常会“体谅”他们，我们会把自己变成半个产品经理，帮产品经理踩坑，秉着自己“专业”“负责”的精神，把产品经理不靠谱的需求迅速化成具体的方案（迅速的画线框图），甚至比产品经理想的更多（拍脑袋想更多）。其实这样做你就是帮助产品在不靠谱的路上走了更远，导致了设计开发资源的浪费，最后才发现原来产品经理根本没想清楚需求。没有靠谱的需求文档进行参照，产品也会经常改变其最初的想法，使设计资源造成浪费。

虽然需求文档不靠谱不是设计师的责任，但对于不靠谱的需求，我们作为设计师是可以进行拒绝的，我们要提醒产品修改和完善需求文档，我们也应该参与到需求制定，帮助产品分析需求，一起探讨这个需求是否靠谱，想清楚要达到的目标。

&nbsp;

<strong>7. 不总结</strong>

交互新人常常会在一个坑里栽倒多次，新人的快速成长往往伴随着不断的自我总结，快速吸取之前的经验教训，但是初入职场的交互新人往往会忽视了这一点。

设计项目不论大小，不论成功与否，都需要及时的去总结，在总结的过程中，才会真正的让自己沉淀下来，从全局维度去思考自己设计方案的好与坏，思考有没有需要改进的地方和在今后的工作中如何避免。

感谢你打开并阅读这篇文章。既然你打开了这篇文章，说明你在交互路上也是新手一枚，可能也犯过很多错，也迷茫痛苦过。这篇文章并不是来教导交互新人的，而是总结思考我这一路上经常犯的错。也许你是交互设计路上的一枚新人，也许你是一个尚未入行的学生，还在观望这个职业，不管怎么样，希望看过此文之后会有些许共鸣，能够帮你汲取些许经验，在交互路上尽早“多犯错”，尽早知错，尽早改错。我们一起共勉。";s:10:"post_title";s:36:"交互新人容易犯的几个错误";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:108:"%e4%ba%a4%e4%ba%92%e6%96%b0%e4%ba%ba%e5%ae%b9%e6%98%93%e7%8a%af%e7%9a%84%e5%87%a0%e4%b8%aa%e9%94%99%e8%af%af";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-19 12:44:23";s:17:"post_modified_gmt";s:19:"2016-07-19 04:44:23";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=214";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}