�̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1805;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-08-05 16:31:17";s:13:"post_date_gmt";s:19:"2016-08-05 08:31:17";s:12:"post_content";s:10614:"现在八月了，有的毕业生同学可能还没找到工作，可能是简历的细节不够，今天让<a href="http://weibo.com/yingjunjiu" target="_blank">@JJ-Ying</a> 大神和同学们聊聊一份优秀的界面<span class="wp_keywordlink_affiliate"><a title="查看 设计师简历 中的全部文章" href="http://www.uisdc.com/tag/%e8%ae%be%e8%ae%a1%e5%b8%88%e7%ae%80%e5%8e%86" target="_blank">设计师简历</a></span>应该注意的5个细节，一起来收。

如何成长为一个大神：<a href="http://www.uisdc.com/uisdc-designer-interview-jjying" target="_blank">《优设访谈！百度设计大咖JJ YING的自学成才之路》</a>
另外一个大神搞的大新闻：<a href="http://www.uisdc.com/meizu-10-resume-design-principles" target="_blank">《魅族视觉总设计师：写好一份简历的十个基本法》</a>
<h4>1，作品集</h4>
作为一个设计师，作品集毫无疑问是简历的重要组成部分，怎么样更好地把自己的作品展现给招聘人员是非常关键的一个课题，做得好了能一下子吸引住别人，要是做得不好，将直接影响别人对你的评价。

<strong>1、把作品集作为附件发送还是使用在线作品集？</strong>

个人认为这两种方式都可以，但是如果使用在线作品集的时候尽量保持“专业”，推荐使用专门的网络相册或者 dribbble 这种在线社区存放作品，这样也能同时增加你的个人作品的曝光度。不过不建议把作品的图片直接以 html 的形式插入邮件当中，那样不容易保存。

<strong>2、个人博客</strong>

很多设计师都有自己的博客，在招聘中让别人看看自己的博客也是非常不错的选择，一来可以让别人从一些侧面了解你的兴趣点、对设计的看法等等。但博客当中需要保证设计相关内容以及个人作品的集中，不要让别人在找你作品的时候还得时不时看你几篇流水帐博客文章甚至是路边大头照。

<strong>3、文件尺寸和命名</strong>

GUI 设计是很讲究 Pixel-Perfect 的，所以我们经常不舍得把作品放到 PPT 或者 PDF 里，因为那样没放保证观者是以实际大小查看作品，所以经常把作品以图片的形式打包发送，那样的话压缩包的尺寸不能过大。尽量以自己的代表作为主打。如果我点开一个作品集里的一个叫「1-6.jpg」的文件发觉是把你的某个亲戚抠图之后非主流化到另一张照片上，试问我怎么有耐心继续点其他内容？另外最好能比较详细地命名，比如压缩包里的文件夹就是「Icon 作品」、「插画作品」等，方便别人集中查看。

<strong>4、版权信息</strong>

如果是临摹的或者与别人合作的作品务必写明！这个是诚信问题。一般面试官都是有经验的，是不是你自己做的还是看的出来的。

<img class="alignnone size-full wp-image-158724" src="http://image.uisdc.com/wp-content/uploads/2015/10/5resume2015-10-27.jpg" alt="5resume2015-10-27" width="600" height="1249" />
<h4><strong>2，职业技能</strong></h4>
设计师多多少少总会接触各类图形图像软件，至于到底熟练掌握多少并非关键问题，个人觉得只要把和自己擅长方面的相关软件点出来即可，不吹牛也不要谦虚。投简历不是比谁列的软件多，招聘者也不会 care 你的 Photoshop 使用了 72 个月还是 36 个月，简单明确地列出来就可以了。当然剩下的一些其他技能比如网页编写、视频制作也经常是加分的部分，有掌握的一定不能漏掉了。
<h4><strong>3，Cover Letter</strong></h4>
固然个人能力是招聘时的主要因素，但撰写一封简短但诚恳的自荐信也十分必要，尤其是对年纪不大的设计师或者应届毕业生。信里诚恳地说一下自己的优势啊求职的原因啊对公司和设计的认识啦可以帮助别人进一步了解一下，至少也让对方感到你的诚恳，毕竟我们这样的新人在简历当中填不满太多的内容。

<img class="alignnone size-full wp-image-180057" src="http://image.uisdc.com/wp-content/uploads/2016/04/st20160406-7.jpg" alt="st20160406-7" width="600" height="166" />
<h4><strong>4，普适性的</strong></h4>
<strong>联系方式</strong>

电话一定要有，家庭地址就不一定要放了，最多让用人单位了解你人在哪里就行。

<strong>照片和性别</strong>

姓名 、性别 、年龄 、学历及学位都是最基础的一定要有，至于其他的尽量放相关的，体重啊（我真的见过带体重的简历投递！）、个人艺术照（我也真的见过简历里附送一打宿舍自拍照的！）就不必了。老实说，做 GUI 的经常男多女少，招聘时候的性别歧视还是存在的，有些公司或者 manager 比较看重男女搭配的元素，招人的时候可能也有一定的比例要求。

<strong>个人简介</strong>

这部分常常是简历里所占比重很大大的，但是也得注意保持简洁。点出以前的工作职责和时间就可以了。像是大学里学过的课啦，学期成绩表之类就免了吧，重要的还是用能力说话，真要炫一下的，放个 GPA。如果进入了面试阶段，这部分再细说也不妨

<img class="alignnone size-full wp-image-180059" src="http://image.uisdc.com/wp-content/uploads/2016/04/st20160406-5.jpg" alt="st20160406-5" width="601" height="219" />
<h4><strong>5，细节</strong></h4>
<strong>个人姓名</strong>

邮件的发件人姓名很多人会忽略，因为自己很少看到注册邮箱之后只设置一次的姓名。虽然这不是重要部分，但如果招聘人的 Outlook 里冒出几封发件人叫做「ar19890305」或者「-_- John」的话看起来总归会觉得不舒服。

<strong>工作经历倒序</strong>

邮件标题，很多学生都经历过海投，投的时候至少把标题上的「FW」这种信息去掉吧。。。不是说每次投都要针对性地改很多内容，但至少要确保应聘岗位等信息填写准确，如果招聘人员同时在招多个职位，这样更有助于他们过滤信息。

招聘单位的名字要写对啊。。。。在惠普工作的时候我收到带有「亲爱的腾讯公司领导你好」抬头的邮件着实不少啊。
<h4><strong>千万不要干这样的简历与面试过程！</strong></h4>
<a href="http://weibo.com/iamakanelee" target="_blank">@Akane_Lee</a> ：群里有位特别的设计主管，我们看到他浮出水面都会缠着他问最近收到什么简历、又面试到什么样的人。这位主管大概天生专门吸引奇葩，看他面试新人这么久，就是遇不到个正常人。

干脆整理一下，让大家看看面无表情麻木不仁的面试官是怎么被逼出来的。想当年他刚入群时还是位青春活泼少年郎呢…

以下是我筛选出来的群里对话。大部份出自那位面试官口中。

「想让人事下次教育经历时间都写错的直接刷掉算我太严格吗？」
「看见这种错误想让别来了。」
「简历一点工作经验也没写。」
「附上作品集是常识吧。」

「人事来个简历，2015年毕业的。」
「基本流程和该有的全放上面了。」
「但感觉这么短时间内全部拿下，时间上可能性不高。」
「就像是大项目她参与了一部份，把全部内容都放到自己作品集了的感觉。」
「说了一堆没用的感觉…」
「都毕业这么久了，在学时期得奖就别写了吧。」
「培训中心也别写，感觉水。」
「这样的文字简历我基本不会看，就看工作经历那边。」

「刚面试完，感觉像是培训班出来的。」
「毕业一年不到、作品集一堆，该有的全有。」
「妹子说自己毕业前实习了三个月的电商，做 xx 广告。」
「给了原始档，打开图层全是英文和中文名混杂。」
「估计是下的 psd 改的。」

「最后我问了个问题，你自己平时手机玩的有比较喜欢或者觉得交互做得很棒的APP有哪些？」
「妹子说不怎么玩，主要做公司项目和学习，不怎么玩APP…」
「这基本判断其他都是假的吧？」
「说是很喜欢交互设计，但居然说不出来自己喜欢的一两个app？」

「10 年经验，写设计经理、产品经理、互动设计都能干。」
「但我一看作品，感觉跟 5 年的常规差不多。」
「主要作品觉得有点太水。」
「我现在总结了，先直接看作品聊作品。」
「然后让讲几个自己手机平时把玩觉得比较优质的应用。」
「如果作品很丰富但对app不能简单讲出来自己的判断，也是个雷感觉。」

「人事撇过来简历。」
「发现作品集里有网络上别人的作品，这个直接刷掉吧。」
「培训班貌似都不教学生设计规范。」
「出一堆带模板的视觉效果。」

「还有这种，网上一模一样的老外作品。」
「胆真肥！」

「看见这就不想让她来面试了…」

「面试到现在，发现还是得重思路和流程。」
「视觉真的很表层，半天看不出多少。」
「但是聊思路和流程立马就知道到底有料没。」
「视觉可以抄、或者改。」

「不要再抄这张图了，泥马已经看到 3 个人说这他画的！」
「以图搜图很容易的。」

「像 Lee 姐说的，最重要的还是想法和流程这些展示。」
「纯视觉稿太初级了，不好判断是个什么情况。」
「再就是，面试官貌似看作品的时候都很仓促。」
「所以不要放太多作品。」

「还有这种命名…」
「合作的说明下就行，但见到很多说自己作品的，问细才说是合作，也说不清楚哪部份是自己的。」
「我问这个趋势图表做设计时和开发怎么沟通的。」
「说他们公司只负责视觉外包。」
「客户自己找开发团队实现。」
「我问那最后实现出来没、上线了吗，说不知道…」

「今天面试的年轻人，一个挺帅的，一个挺美的。」
「然后公司的测试那边和运营那边私聊我说赶紧招进来…」
<h4><strong>备注</strong></h4>
才爬了一个半月的对话纪录就有一大堆可以整理，本来想拆成上、中、下三篇应该可以写得完…搞不好还不够＝ ＝

各位笑归笑，自己的简历千万不要这要搞，面试的时候请好好和对方交谈啊。";s:10:"post_title";s:78:"高手经验！5个细节帮你做好UI设计师的简历（附作死案例）";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:18:"ui-designer-resume";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-09-05 17:46:43";s:17:"post_modified_gmt";s:19:"2016-09-05 09:46:43";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1805";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}