�H�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:716;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-06-22 17:37:35";s:13:"post_date_gmt";s:19:"2016-06-22 09:37:35";s:12:"post_content";s:556:"<h4>滴滴招UI/视觉设计师</h4>
<strong>岗位职责：</strong>

负责为滴滴产品与新功能提供创意策划及设计方案；

<strong>岗位要求：</strong>

1.有2年以上的互联网及移动端视觉设计经验
2.丰富的视觉表现力，精通色彩、图形、信息和GUI设计原则及方法
3.能运用设计手法平衡商业和用户需求
4.勇于接受挑战，善于自我激励，具有强烈的学习的热情和进取心
5.会手绘或动效者加分

简历作品投递邮箱：sunmingjie@didichuxing.com";s:10:"post_title";s:66:"【北京招聘】滴滴用户体验中心招聘UI/视觉设计师";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:191:"%e3%80%90%e5%8c%97%e4%ba%ac%e6%8b%9b%e8%81%98%e3%80%91%e6%bb%b4%e6%bb%b4%e7%94%a8%e6%88%b7%e4%bd%93%e9%aa%8c%e4%b8%ad%e5%bf%83%e6%8b%9b%e8%81%98ui%e8%a7%86%e8%a7%89%e8%ae%be%e8%ae%a1%e5%b8%88";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-22 17:39:29";s:17:"post_modified_gmt";s:19:"2016-07-22 09:39:29";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=716";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}