�̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1061;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-06-26 19:28:57";s:13:"post_date_gmt";s:19:"2016-06-26 11:28:57";s:12:"post_content";s:13048:"<strong>三位广告人，认为中国广告业陷入困局。</strong>

第一，中国GDP全球第二，创意水平却在前十之外。微信微博，常见外国杰作，如英国John Lewis的《月亮上的男人》、澳洲地铁的《蠢蠢的死法》和日本资生堂的《高校女生的秘密》。创意触动人心，借普世价值穿越国界。然而，中国至今尚无真刀实枪的出街广告引发全球讨论，除了前段时间把黑人“洗白”的洗衣产品视频。

第二，广告业本应生活乐无边，现实中幸福指数偏低。最直接的表现，是时下流行一种自轻自贱的称谓：广告狗。加班没有止境，比稿屡败屡战，奖金不见踪影，公司旅行取消，队友像猪一样，客户蛮不讲理……每一项都是不快乐的理由。最惨的事情莫过于，经历九九八十一难，仍然没有一件像样的作品拿得出手。

第三，资本大举进攻，未能扭转人才流失，作品质量恶化的颓势。激进的商人期望以资本的力量推动行业扩张，并购，联合，上市，不料KPI至上与自由的创新精神相悖。优秀人才不足，作品质量堪忧，这两个行业现象几无改观。

<img class="load" title="独立创意机构F5" src="http://file.digitaling.com/eImg/uimages/20160725/1469417092484788.jpg" alt="独立创意机构F5" width="700" height="392" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160725/1469417092484788.jpg" />

他们开创独立创意机构F5，希望找到一把解决困局的钥匙。

<strong>范耀威（Adams）</strong>，前上海DDB执行创意总监、2016年China’s Digital A-List（Campaign杂志中国数字达人榜）及戛纳广告节金狮奖获得者。个人公众号：小a乱弹

<strong>刘琛（Cher）</strong>，前上海BBDO策略群总监、加拿大多伦多大学MBA，曾就职于多伦多、北京、上海多家广告公司。个人公众号：就那点小破事儿

<strong>alt225</strong>，科技及艺术专家、伦敦中央圣马丁艺术学院硕士，曾获iGoogle创新设计奖银奖。出于众所不知的原因，alt225的相片从略，他坚持当面交流。

三人分别以创意（Creative）、策略（Planning）和技术创新（Technology）的专长构建核心大脑，创造稳定、系统、开放的新创意生态。

<img class="load" title="刘琛与范耀威，分别担任F5的策略和创意领导人" src="http://file.digitaling.com/eImg/uimages/20160725/1469417134612097.jpg" alt="刘琛与范耀威，分别担任F5的策略和创意领导人" width="700" height="425" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160725/1469417134612097.jpg" />
刘琛与范耀威，分别担任F5的策略和创意领导人
<h2>为何称为F5</h2>
关注娱乐八卦的，以为这是比F4多一个人；关注国际广告业的，以为这是FF加上Droga5；也有人以为，这是范耀威的FAN的首字母。

正确答案：F5是电脑键盘上的刷新键。用来刷新网页浏览器或资源管理器中当前所在窗口的内容。

“我们以F5为公司的名号，时刻警醒自己，永远不要做第二个吃螃蟹的人。”范耀威说。

F5源于键盘，也意味着这个创意机构与数字营销紧密相连。“我们打破传统与数字的界限，视所有的出品为品牌内容，每一件作品，都应当在社会上引发广泛的反响。”
<h2>F5的信条</h2>
改变现状，单凭F5一家之力，杯水车薪。需要全体同行心怀激情，革新管理思维，改进作业模式。F5以自己的全新思路试水，希望为行业走出一条新路。实践中，员工以5个信条为执业指引。
<h3>信条1：文化张力决定成败</h3>
F5认为，Cultural Tension，即文化张力，在品牌建设社交化的今天，扮演越来越重要的角色。SK-II的“她最后去了相亲角”、Diesel牛仔裤的Be Stupid、多芬的“Real Beauty”均在此列，掀起极大的社会反响。

文化张力是两种社会思潮在相反方向用力的结果。 “它不仅仅是消费者需求的标识，它也是一种发声，表明世界存在一些需要改变的谬误，改变可由一个品牌达成......也是一个有社会担当的品牌应有的作为。” 广告公司需要做的是，洞察冲突，找到角色，提出观点，激发关注和有益的社会讨论。

Be Stupid战役借文化张力引发全球轰动：在这个推崇高智商的社会，傻才是真正的聪明。品牌以强势、挑衅的广告形象，号召大家一起加入傻瓜的行列，“傻瓜是有种，是善于创造，是奋力争取梦想而淡然看待结果”。Be Stupid也因此一举获得戛纳广告节户外类全场大奖。

发掘文化张力，需要一个有经验的Strategic Planner。F5首席策略官刘琛擅长将全球品牌建设理念导入本地市场，将方法论扎根于本地社会文化土壤之中。在上海、北京、多伦多，在奥美、麦肯、BBDO等公司的工作经历都令她受益良多。

“谋定而后动”，是各行各业的成功捷径，Planner就是广告公司的诸葛孔明。

<iframe src="http://v.qq.com/iframe/player.html?vid=s0174w2f8u1&amp;tiny=0&amp;auto=0" width="700" height="490" frameborder="0" align="none" allowfullscreen="allowfullscreen"></iframe>
范耀威团队创作的60秒励志广告《我23岁》，在央视的11个频道全线播出
<h3>信条2：科技才能救未来</h3>
互联网打着连接一切的旗号，促成科技领域的寒武纪大爆发。今天，科技俨然成为最大的创意。戛纳一直都是创意风向标，科技公司在戛纳沙滩的派对近来搞得有声有色。Facebook、 Youtube、Twitter等常客自不必说，6月18日，网易也在戛纳设立一个专场，“展示中国互联网公司的先锋态度和实践成果”。

广告人如何拥抱科技？准确地说，应该是如何利用科技，为品牌创造让人惊呼的体验？

广告创意是一门叙事（Story Telling）的艺术，互联网时代，创造激动人心的作品，要求广告人具备相应能力，即利用先进技术讲故事。

ING银行的《下一个伦布朗》，借助微软的Azure云平台，利用深度学习算法和面部识别技术，教会计算机模仿伦布朗的风格绘画。IBM利用电子显微镜拍摄“原子”，创作世界上最“小”的电影《小孩与球》。支付宝和腾讯今年戛纳各获得两个提名，作品均围绕某项先进技术。

时代要求广告人养成一种“技术意识”：紧随技术革新的步伐，升级的知识储备，使之融合贯通。这正是F5科技总监alt255的长处，他曾获得iGoogle创新设计奖银奖。“alt225是一个不可多得的奇才，他是一个艺术家，曾获邀成为伦敦中央圣马丁艺术学院客席讲师，本身也是个科技极客，他是少见的，能将艺术与技术结合起来的新一代创意人。”范耀威表示。

F5深入研究人工智能、VR、AR、大数据、3D打印等技术，掌握最前沿的技术动向，将这些知识运用到品牌建设的作业中。事实上，如果广告人了解这些技术，他比IT工程师更容易创造奇迹。日本Party的首席创意技术总监Qanta Shimizu认为“最重要的不是技术，最重要的是对人性的把握”。

<img class="load" title="遇见名画中的自己" src="http://file.digitaling.com/eImg/uimages/20160725/1469417526794574.jpg" alt="遇见名画中的自己" width="700" height="353" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160725/1469417526794574.jpg" />
范耀威团队开发的《遇见名画中的自己》，被支付宝纳入APP，并获2016年戛纳两项提名
<h3>信条3：胶水思维让强者愈强</h3>
Glue Minds（胶水思维）是F5的独创理念。胶水，独具神力，擅长建立关联，粘接不相关甚至不相容的两个或多个事物，实现1+1大于2。

一般认为，创意由四大领域组成，95%的创意呈现，都来源于这四个方面。分别是科学、工程、设计与艺术。长期以来，广告行业局限于设计与艺术，但广告创意的边界，已被大大拓宽，科学与工程的结合体“技术”（Technology）的加入，打开无限美好的未来。

胶水思维从何而来？要求我们敢于试错，容忍混乱，粘接新事物，机遇和风险同样可观；要求我们放下偏见与自大，以谦卑的姿态与优秀资源对话。

田中耕一郎是日本Projector的领军人，很长一段时间，公司加他只有2个人，却产出包括The Museum of Me、Uniqlock等响誉全球的代表作，获得100多个国际奖项，16个戛纳狮子（包括2个全场大奖和6个金奖）。成就背后，胶水思维功不可没。

F5正在构建一个庞大的资源库，由科学家、工程师、艺术家和设计师，以及大量优秀的第三方公司组成，通过粘连这些资源，实现共生共赢，形成非同凡响的创意合力。
<h3>信条4：信息不对称才是真正的杀手锏</h3>
F5不聘用智商低于120的人、不懂英文的人，更不聘用没有学习习惯的人。“广告业属于’吃脑’行业，对客户保持信息不对称，才能凸显广告人的价值。”范耀威表示。换句话说，你懂的客户都懂，他找你干嘛？他会尊重你吗？互联网时代，知识触手可及，客户也在持之以恒地增长见识。很多时候，得不到客户尊重，是因为他不值得客户尊重，他提呈的方案，对客户来说毫无新意。

保持信息不对称，就要永不满足地学习。

行业的现状是，广告公司不愿大力栽培员工。一是人才流动快，变成帮别家培养员工。二是员工太忙，参加培训有心无力。三是抱着与其自己培养，不如挖一进来就能上手的人。当每家公司都这样干，员工素质将一代不如一代。

F5将投入大量人力财力栽培员工。范耀威认为，谷歌是世界上最具创新意识的技术公司，他们把办公室称为Campus（校园），无非是让员工认识到，学习是一件伴随终生的事情。F5更乐意把办公场所定义为Library(图书馆)，图书馆是校园中最具自主学习氛围的地方。日常作业中，范耀威、 刘琛和alt225将在创意、策略与技术创新三方面肩负知识官的职责，通过言传身教，在实践中传道授业。甚至公司旅行， F5也会别出心裁，比如到硅谷考察，去山村支教。

<iframe src="http://player.youku.com/embed/XNzQzODI5ODM2" width="700" height="480" frameborder="0" align="none" allowfullscreen="allowfullscreen"></iframe>
范耀威团队为腾讯创作的《神奇的鹅》，成为国内幽默广告的一个典范。
<h3>信条5：努力生活就是努力工作</h3>
广告人总是在加班，两点一线，他们自认为工作就是生活，生活就是工作。但，这正是中国广告业最大的谬误。

龙应台讲过这么一段话：“思想需要经验的累积，灵感需要感受的沉淀，最细致的体验需要最宁静透彻的观照。累积、沉淀、宁静观照，哪一样可以在忙碌中产生呢？我相信，奔忙，使作家无法写作，音乐家无法谱曲，画家无法作画，学者无法著述。奔忙，使思想家变成名嘴，使名嘴变成娱乐家，使娱乐家变成聒噪小丑。闲暇、逗留，确实是创造力的有机土壤，不可或缺。”

F5相信，不要太勤奋工作，是因为你要很努力生活。你不仅要输出，你也要输入，否则巧妇难为无米之炊。设计界大神Stefan Sagmeister在TED上宣称，每工作7年，他就把公司关掉，外出旅行一年。过去Desiel牛仔裤的每个Campaign都教人大开眼界，其创始人Renzo Rosso在一次采访中称，每次作业，都把创意部门分成几个小组，让他们到世界各地去考察半年，带着灵感回来进行头脑风暴。

F5相信，生活会给你力量，市井会给你想象。鼓励每个人勤奋生活，比如读书、看话剧、进美术馆、练拳击、下厨、打球、泡妞、爬山、唱歌、做义工、安装新app、跟朋友喝酒、学一种新乐器......在这些方面下功夫，才是真正对客户负责任。

<img class="load" title="独立创意机构F5" src="http://file.digitaling.com/eImg/uimages/20160725/1469417387100199.jpg" alt="独立创意机构F5" width="700" height="258" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160725/1469417387100199.jpg" />
F5位于上海复兴SOHO，毗邻新天地

Hate it, change it！这是一支戛纳金奖电视广告（Honda）的主题语，恨它，就改变它！范耀威＋刘琛＋alt225，一个全新的创意共同体，为中国广告业按下F5。改变正在发生。";s:10:"post_title";s:53:"独立创意机构F5：广告三剑客的理想世界";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:155:"%e7%8b%ac%e7%ab%8b%e5%88%9b%e6%84%8f%e6%9c%ba%e6%9e%84f5%ef%bc%9a%e5%b9%bf%e5%91%8a%e4%b8%89%e5%89%91%e5%ae%a2%e7%9a%84%e7%90%86%e6%83%b3%e4%b8%96%e7%95%8c";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-26 19:29:21";s:17:"post_modified_gmt";s:19:"2016-07-26 11:29:21";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1061";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}