T��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"356";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-19 23:18:34";s:13:"post_date_gmt";s:19:"2016-07-19 15:18:34";s:12:"post_content";s:11881:"<h1></h1>
<img src="http://img.ui.cn/data/file/3/6/9/220963.jpg?imageView2/2/w/900/q/90" alt="使简单的想法更简单" data-image-src="http://img.ui.cn/data/file/3/6/9/220963.jpg?imageView2/2/w/900/q/90" />

<strong>一个实用的网站需要简单易学，直观易用，并让用户记忆深刻。但最重要的是，一定要简单！这周就让珍妮李维斯帮助我们解构交互设计，探寻简化之道。</strong>

简单与否，是用户初次接触并认识一款全新的用户界面时首先会关注的事情之一。为了让用户留下良好的第一印象，用户体验设计师应该不断的，深入的探索简化之道，让原本看上去就很简单的设计变得更为简单。在提供愉悦的使用体验的同时，赋予数字产品的在市场中的竞争优势。

现代人的生活日渐繁忙，注意力跨度缩短，用户对于应用产品直观易用性的标准日渐增高。如果一款应用看上去就有那么一点点的难用，那许多用户从一开始便不会麻烦去安装。用户对于软件的速度，功能，以及设计已具备一定的心理期待，那设计师必须至少满足这些期待（如果无法超越）。对于一款应用软件卖1.99美金用户都会觉得昂贵，花两分钟时间去下载都会觉得没完没了的世界来说，这可是一项艰巨的任务！

但问题是，体验设计师往往与他们设计的产品距离太近，以至于很难判断用户是否真的认为产品是简单直接的，或其实是复杂困惑的。观察用户真正的上手使用产品是测试设计功效最好的方法，但复杂的用户测试却不一定是最好的选择。最坏的情况是，体验设计师难以判断用户是否真的认为产品如自己设想的  一般的易用。为了解决这个难题，提供简单至极的用户体验，设计师应该：
<ul>
 	<li>1. 解构用户与应用的初次接触体验：让影响用户第一印象的设计缺陷暴露出来。</li>
 	<li>2. 平衡界面的可供性（Affordances）与传统认知(Conventions)：探索用户对于特定设计元素的传统认知与交互习惯能够展现深入简化的机会。</li>
 	<li>3. 创新第一：简化用户的思维方式，真正解决用户问题是重中之重。当提出创新方案之后，我们有的是时间去进一步简化方案。</li>
</ul>
<strong>创造最棒的第一印象</strong>

苹果的应用商店在2013年就拥有了一百万款应用。当中大量的产品在功能上大同小异，这给予了用户充分的选择权。如果一款应用很难用，用户可以轻松的选择更简单的另一款应用去替代。所以，简化使用体验与用户的选择是直接挂钩的。

让我们想想用户是如何一步一步评判一款产品的：

1.需求及寻找

用户会根据自身需求去寻找相关的应用。举个例子，一位繁忙的母亲需要与家人分享日程安排。为了满足这个需求，她开始在应用商店搜索 “家庭日历应用”, 希望找到相应的产品。

2.第一印象

根据尼尔森/诺曼集团的数据，用户在一个网页的平均停留时间为10-20秒钟。让我们假设上述的这位繁忙的母亲有15秒钟的时间去浏览每一个搜索结果，那当她在看到第一款出现的应用时就会想：这是不是我要找的”家庭日历应用”?

在还没来的及下载尝试这款应用之前，她已经花了15秒时间思考这款应用是否能够满足她的需求。她通过浏览该应用的截屏去判断其是否能够做到她想做的事情。在还未决定下载之前，这些界面就必须清晰无疑的展示出该应用的功能。

在这个时候，帮助她决定是否下载这款应用的重任就全落在了应用界面的简明易懂的程度上了。

3.基础保证

当这款日历应用成功通过了这位母亲的第一轮评判，她就开始下载使用了。她开始尝试添加一个日程。她通过应用的基础功能去判断自己是否做出了正确的决定。作为一款日历应用，简单的添加日程是最基本的功能保证。

基本功能的使用体验必须要简单。这之后用户才开始思考：这款应用还能做什么我没想到的事情呢？或是这款应用有什么我不需要的功能，甚至影响我正常使用了？

举个例子，为每个日程添加视频通话的快速连接可能对用户来说是个很方便的功能。尽管这位母亲一开始并没有特意寻找这个功能，但她也许会很高兴这款应用具备这个功能。但从另一个方面来说，同样的功能如果被强硬的添加在了这款应用的基础功能里，用户还无法通过正常的方式关闭，那这个功能对用户来说就会变得很厌烦了。附加功能绝不能够影响基础功能的实现。而简单就体现在产品的基础功能与增值因素的平衡上。

无论是通过应用商店或是其他渠道，体验设计师都需要考虑用户初次与产品接触的初步评判过程。尽管这个过程可能只持续几秒钟 -事实上，也就几秒钟- 简单明了的设计都会给用户留下良好的第一印象。要知道，简单可不仅仅能够成功说服用户去尝试你的产品，也可以确保用户持续使用你的产品。

<strong>通过传统认知（Conventions）与可供性 (Affordances) 进行简化</strong>

史蒂夫克鲁格在他的畅销书『别让我思考』中从多个方面的探讨了关于简单易用网站的创作。他写到，每次不假思索的鼠标点击与清晰明了的信息展示都是简化用户体验的良好机会。克鲁格提出简化体验最好的方法之一就是利用用户使用其他网站的经验。设计师应该记住“传统认知是我们的良师益友”。

大部分体验设计师都应该知道，传统认知是用户通过过去的使用体验的积累，从而对一些设计元素产生的预想。比如「汉堡包图标」代表「菜单」被广泛使用。用户在其他的应用程序中见过这个图标，所以他们认识这个图标。只有少数用户会不清楚它的作用。

在带领用户首次使用一款应用之后，体验设计们应考虑自己是否错过了使用传统认知的机会。他们可能会发现使用一些用户已知的设计元素去替代一些特殊的元素可以提高易用性。每当设计师使用全新的设计语言，忽略传统的设计元素，用户可能就不会很快理解设计意图，甚至根本不明白，结果会很让用户很难对产品产生良好的第一印象。

可供性与传统认知很类似，但区别是用户的认知不一定来自于其他应用的体验。在『设计心理学』一书中，唐纳德诺曼对此进行了展开讨论。他提到某些设计元素之所以“合理”, 那是因为它们暗示了人们日常接触的事物。

举例来说，一个代表搜索的放大镜图标之所以合理，是因为用户知道放大镜的作用是寻找物品。有趣的是，这同时也是传统认知的一个例子。因为其可供性，放大镜也已成为一种传统认知了。但双筒望远镜和手电筒就不能这么理解了，尽管它们也经常被用来寻找物品。

说这些跟简化体验又有什么关系呢？当设计师把用户与应用的初次接触过程细化的时候，实际上已经开始通过传统认知去寻找深入简化的机会了。但除此之外，设计师还需要探索：
<ul>
 	<li>1. 能被传统认知替代的可供性。</li>
 	<li>2. 能够运用可供性的机会。</li>
</ul>
合理的运用两者可以很大程度的提高用户体验。首先思考如何使用传统认知能够让设计师充分利用用户先前积累的使用经验。而可供性是利用用户对现实世界认知的第二种利器。

<strong>持续创新</strong>

如果我们永远试图将事物保持简单和熟悉，那创新该从何谈起？每当设计师致力于通过平衡传统认知与可供性去达成简化的目的，那他/她必须首先思考一个问题：

一个存在并被放置于某个网页，应用，或产品中的设计元素是否真的合理?

这种思维方式的好处就是能够让设计师首先思考创新，再去考虑简化。如果将一个应用界面看成一个独立的个体，而不与市场上的其他产品作比较，这便意味着设计师能够跳出市场标准的框框。接下来再使用克鲁格/诺曼的评判方法：

这个设计是否充分运用了用户的传统认识，让用户对设计一目了然？这个设计所使用的元素是否有着充分的可供性去确保功能的实现？

最终，用户是依赖传统认知与可供性的帮助去建立对于一个界面的认知模型，从而达到一目了然，简单易懂的新鲜体验。设计师应挖掘创新所带来的自由，只有当创新之后才可以将设计元素更加直接，简单的决定下来。

重要的是明白简单的宗旨并不是违背创新，或只是用来执行受限的功能。有着复杂功能的应用也可以非常易于使用，同时功能轻量的产品也可能在使用上过度复杂。

举个例子，一个网站的联络信息表单功能非常简单，但是使用手机填写一定数量的信息就会变得复杂。相反的，一份能够自动提取用户的地理位的联络信息表单在功能上虽比较复杂，但是对于用户来说却因省去一些信息的填写，从而使产品变得更加易于使用。

归根到底，简单的设计主要依赖场景。只要设计师围绕场景为中心进行设计，那他就永远不必通过牺牲创新去达到简单的目的。

<strong>运用简单作试验</strong>

简单的设计通过提供清晰度提高用户体验：清晰明了的输出（这款应用能为我做什么？）以及清晰明了的输入（我需要做些什么？）。在设计过程当中，体验设计师必须按部就班地一步一步确保简单的体验。解构用户的第一印象，同时合理的运用传统认知与可供性进一步的去简化体验。

这里为体验设计师们提供一些能够最大程度达到简化目的的主意：

竞品分析：调研竞品能够找到其他的产品是如何运用传统认知与可供性提高产品用户体验的。

重新审视现有设计：想想设计元素背后的功能目标，利用可供性的概念去发掘创意。寻找并识别现有设计的来源（如果有明确来源的话）并试着去思考替代方案，启发新的创意。

跨越传统认知：对于已经极度依赖传统认知的产品体验，设计师可以挑战自己，利用不那么常见，却具备较强可供性，能够被用户快速识别的方案去替代传统方案。今天的创意或将成为新的传统。

在一切试验中，体验设计师需谨记用户不断的在数字产品中寻找简单的使用体验。这是不变的事实。所以设计师应抱着用户的心理去创造体验。这个过程始于创新 -设计永远是帮助用户解决问题的- 同时运用传统认知与可供性进一步的去简化方案。

关于作者：

珍妮是一名用户体验设计师，网页开发者，及艺术家。她对于一切人机交互相关的事物都极为着迷。这些事物是如何影响我们的日常生活的，以及如何通过创建科技产品，与之互动以改善我们的生活。她的经验围绕一切以用户为中心的设计，用户界面，交互设计以及网页开发的方方面面。她热衷于使软件变得更为实用，同时搭建非专业的客户&amp;用户与开发者&amp;科技间的桥梁。珍妮有着自己的博客，UX Jenny，同时也是数字咨询公司Steady State Digital的创始人。";s:10:"post_title";s:27:"使简单的想法更简单";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:81:"%e4%bd%bf%e7%ae%80%e5%8d%95%e7%9a%84%e6%83%b3%e6%b3%95%e6%9b%b4%e7%ae%80%e5%8d%95";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-19 23:18:34";s:17:"post_modified_gmt";s:19:"2016-07-19 15:18:34";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=356";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}