���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1042";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-26 18:42:46";s:13:"post_date_gmt";s:19:"2016-07-26 10:42:46";s:12:"post_content";s:15909:"&nbsp;

<img src="http://img.zcool.cn/community/02ccd2579463c00000012e7ecf49b0.jpg@800w_1l_2o" alt="45f2579463c00000012e7e58ff7b.jpg" />

要问2016年什么最火？

VR (Virtual Reality,即虚拟现实)这个科技界造就的名字不亚于今年的任何一个潮流热词！ 国内互联网巨头们也都在摩拳擦掌憋大招，抢夺新技术在百姓大众心理的首张门票！

<strong>（如果你不想看我讲故事式的体验过程，可以直接跳到下面的交互体验分析的干货环节）</strong>

7.22－7.24 上海世博展览馆召开的 “淘宝造物节”，阿里巴巴率先交出了一份答卷，Buy+真的有那么传奇吗？ 我亲自反复体验后分享一些个人感受。

整个淘宝造物节分为 “T、A、O” 三个主题，展示各种潮牌的原创设计，潮流时尚文化，VR科技体验。

其中淘宝首推的 Buy+虚拟购物体验 无疑是焦点中的焦点！

Buy+ 谐音“败家”，不得不说淘宝运营有趣的脑洞大开，起了这么一个既有真实意义，又有深深“恶意”的名字！

不过Buy+虚拟购物体验真的能激起剁手族的新一轮“败家卖肾”疯狂的消费欲望吗？？？
<p align="center"><embed class="edui-faked-video" src="http://player.youku.com/player.php/sid/XMTY1NTM0MjM0NA==/v.swf" type="application/x-shockwave-flash" width="420" height="280"></embed></p>
<p align="center">（手机不给力，前半段体验者的准备动作和刚进入虚拟世界时的进场情况没能录下来）</p>
造物节现场的 Buy+分为两组六个体验室。1-3号体验室可以体验购买内衣，4-6号体验室是体验购买包包（都是针对女性用户群体）；

先介绍大致流程，以够买包为例：

1、漫长的等待排队，尽管每组有3个实验室，但是每位体验者都需要7到8分钟的体验时间，这样算下来，看似不长的队伍居然需要排队两个小时，对内心耐力的考验程度不亚于已被吐槽喷死的“迪斯尼”。（注：这还是周五的情况，周末的观众数量更是惊人）
<p align="center"><img src="http://img.zcool.cn/community/02d98d579463f10000018c1b7abbe5.jpg@800w_1l_2o" /></p>
<p align="center"><img src="http://img.zcool.cn/community/02cd13579463f10000018c1bf9640d.jpg@800w_1l_2o" /></p>
2、功夫不负“诚心人”，经过反复的坐起、起坐，终于轮到哥了，站在门外候场时居然还有点小激动。

3、我前面的汉子体验很快。没等多久我就被召唤进入体验室，体验室内有一名工作人员，其实是辅助讲解师。

一个相对比较封闭的屋子前后都是玻璃，方便外面的人随时观看里面人的动作，说实话，我不太喜欢这种被“观赏”的感觉。

4、工作人员快速介绍着手柄的使用规则，然后带上头盔准备体验。（注：在Buy+虚拟世界里手柄就是你的双手，没有它你将是“无臂人”）

<img src="http://img.zcool.cn/community/024f0a579464010000012e7eb94f2d.jpg@800w_1l_2o" alt="46bc579464010000012e7e3c147b.jpg" />

5、熟悉完设备后根据听着提示音，VR眼镜内开始进入虚拟世界。

虚拟场景里除了一个造型可爱的白色机器人是“导购师”，还有两个同样可爱的旺旺玩偶，一开始我还以为虚拟环境烘托气氛的玩偶跟班。

通

过语音提示感觉三个体验房间是被一个总控室操控着，才恍然大悟，两个旺旺玩偶就是在隔壁屋的体验者啊。原来三个体验室内的体验者进入的是同一个虚拟空间，
不过你看不到对方的真实面容，在虚拟世界里大家都以相同的旺旺玩偶形态面对。
这时请允许我打开脑洞YY下，等技术成熟时，未来极有可能出现虚拟世界里每个人定制化的千人千面形象。即每个人都可以设置自己在虚拟世界里的展现形态，也
可以在虚拟世界里更多的深入交流（语言交流、眼神交流、肢体交流...），欧美科幻大片里有过不少对类似场景的刻画。

6、

想的太远了，回归现实体验。虚拟空间中我们三个体验“玩偶”跟随“导购师”坐在一个时间机平台快速下降坠落。此时可以环顾四周及上方，除了肢体上无法体验

下坠感，视觉上的空间变化还是比较真切的。时光机把大家带入一个较大的房间内后自动收起，这个房间是让大家学习通过手柄移动位置的环节。通过按住右手手柄
上方圆形按键，出现激光线扫描房间内的其他地方，绿色区域表示可以移动前往，红色则表示不能过去。

简单学习后，系统把大家带入了一个商品展示区，貌似一个大展厅，商品摆放在各种货架上，不过不是每个区域都可以去的。

<img src="http://img.zcool.cn/community/026ed65794641a0000012e7ea98ad7.jpg@800w_1l_2o" />
<p align="center"><img src="http://img.zcool.cn/community/025f345794641b0000018c1b42015a.jpg@800w_1l_2o" /></p>
7、
在商品展示厅内试着移动了一会，来到货架前，拿取商品。   这种时候比较难懂的地方来了，怎么拿商品？大多数体验者是站着不动，发现无论怎么往前伸手，
都无法抓取商品。其实是因为你离商品还比较远。这时就需要体验者往前走两小步（特别注意：Buy+虚拟世界里移动仅限小范围内的移动，大约是现实中的1平
米。如果想要去更远的位置，就需要通过手柄操作），这时屋里的工作人员就会手把手的引导你把手往前伸、往前伸、继续往前伸...
汗，难道你就不能告诉体验者往前微微挪动一下吗？也许工作人员还不够熟悉系统的细节体验吧......

<img src="http://img.zcool.cn/community/026f4c5794642f0000018c1b3740c5.jpg@800w_1l_2o" alt="80a55794642f0000018c1b343763.jpg" />

8、
当手柄足够足够触控到包包时，通过右手柄拿起商品，可以360度的旋转观察商品，然后通过左手柄打开包包，立刻有一群色彩绚丽的蝴蝶从包里分出，这个创意
还是不错的。 但是打开包包的动作是每位体验者都遇到一个“坎”，在屋内工作人员的一再提醒及手把手教育后，终于打开了这个严谨的“潘多拉魔
盒”......

<img src="http://img.zcool.cn/community/0222a85794643b0000012e7e7cb053.jpg@800w_1l_2o" alt="56cb5794643b0000012e7e7d8c53.jpg" />

9、紧接着是模特出场，感觉应该是总控室人员操作的环节。

在展架前是一个环形的T台，三个高挑的虚拟人物模特甩着高挑的猫步走出来，最后颇有架势的举着包包，这时你并不能走近观看，这里所展示的应该是包和人物的搭配感，远远的观摩下也好。

<img src="http://img.zcool.cn/community/02b39e5794644a0000012e7eb15106.jpg@800w_1l_2o" alt="ad44579464490000012e7e31bdf7.jpg" />

10、回到手里的包包，按住手柄下方的开关，商品转圈出现了一些操作按钮：样式、买家秀（真人模特录制好的一小段视频）、商品详情、颜色（调出色板后给商品换色很快）、退出；
<p align="center"><img src="http://img.zcool.cn/community/020d3c5794645d0000018c1bd2da44.jpg@800w_1l_2o" alt="f8535794645d0000018c1b258cbe.jpg" /></p>
11、以上按钮逐个体验后，如果你对这个包包产生了购买的想法，就可以拿起左手的手柄，打开3D购物车。

用右手手柄拿着包包往左手手柄打开的购物车里扔，大约靠近时，商品会被自动吸入购物车，3D购物车会有对应动效，表示商品已被收进去。（这个环节同时用到了左右手，说实话看到虚拟世界里自己的两个“机械手”心里总觉的怪怪的......）

<img src="http://img.zcool.cn/community/0220a2579464690000012e7eb8ae40.jpg@800w_1l_2o" alt="d324579464690000012e7e03fef2.jpg" />

12、然后一堵环形墙会出现在你面前，上面清楚的列着商品模型、单价、总价，以及 "立即购买" Button。

下
一步就需要你把右手手柄往前伸、往前伸、继续往前伸......    直到触碰到 "立即购买" Button，
随后动效展示付款成功，并没有选择付款模式、输入密码等交易流程。可能是因为支付环节的逻辑和体验更加复杂，涉及金钱问题及安全性问题，这部分产品体验似

乎还在设计研发中。所以默认就当你无条件的把钱花出去了。。。哈哈哈哈哈，不用担心，这只是模拟体验，相信当淘宝真的把VR购物推到老百姓面前时不会这么
随意的让你剁手的！

<img src="http://img.zcool.cn/community/02dc22579464750000018c1b56339c.jpg@800w_1l_2o" alt="6268579464750000018c1b1a38ef.jpg" />

13、付款成功能后，一辆骏马拉着货车从旁边呼啸而过，载着我的商品上路了......

<strong>介绍完整个体验过程，让我们来抽取点体验干货。</strong>

好就是好！不好就是不好！下面就从我认为不吐不快的方面客观评价下 Buy+ 的用户体验（以下除了个人感受，也包括我在排队的两个小时中对前面数十位体验者整个过程的仔细观察，得出的结论）：

<strong>槽点：</strong>

<strong>1、移动问题：</strong>

近距离可以通过人的自身行走，远距离则需要通过手柄选择后切换画面“瞬间移动”。

如果是考虑带上眼镜不方便较大比例的走动，那么至少也可以做成像游戏一样，选定后以第一人称视角的画面向前移动，且不是生硬的切画面，视觉被反复打断的很不爽！

不只是处于统一场景内的移动是切换画面，当进行转场时也很生硬，黑屏闪一下！如果能像动漫里那样做些无缝的过度场景烘托气氛，体验的断链感也不会这么强烈。而且在切走画面时，有明显的定格卡住现象，这也是对体验者的视觉感知比较差的。

<strong>2、设备问题：</strong>

手柄不会用，怎么拿起东西，怎么打开，怎么走路？

除了VR头盔，手柄是整个交互操作的一个重要工具，但是它的体验不得不说第一个感知上的败笔。

进入虚拟世界里，眼睛完成了第一感官，对周围环境、物体的快速熟悉。接下来就需要人的行动，前面提到了行走还需要依赖于手柄！ 接着看向下俯视自己的双手时，居然是两个是虚拟还原的手柄！

擦！我是机械人吗！ 请原谅我激动的情绪，因为这双“新手”我真的不知道如何去使用它。

当虚拟世界没能给我一双正常的双手后，开始慢慢的被迫习惯用“机械手”替代十指，当我看到自己的机械手生硬笨拙的拿起一个物品观赏时，心里始终是怪怪的。仿佛自己进入了爱丽丝仙境，自己变身了某种机械怪，身体都是僵硬的（因为我实在是不知道能干什么，怎么去做...）

<strong>3、虚拟设计问题：</strong>

在VR的虚拟世界里，所有物品真实感较差，近乎某些游戏里的质感，偏向虚拟，其实这不利于购物者判断商品：

提

到虚拟空间里的场景质感，如果说商场、展位、模特这些的画面质感不够真实还可以忍，或者认为这是一种设定好的风格。那么对商品的质感也电子化是万万不能忍

的，试想我们不是在做游戏，是在刺激消费者真正掏腰包花钱去购买商品。虚拟空间里的商品都没有做到对真实原物肌理材质的100%还原，如果让我毫不犹豫的
花钱消费？所以体验中总让我产生一种错觉，花钱买了一个虚拟程序里的包。

这还只是包包，不同的商品激发不同人的购买的欲望点是不同的，除了材质还有触感、嗅觉...   当然这些条件目前的技术看是会比较难，但是只通过一些类似卡通的3D模型就想表现一件商品，未免太牵强了......
<strong>4、场景切换问题：</strong>

进入一个新场景的切换跳跃感很强，通过观察基本每位体验者进入一个新的场景时都会左顾右盼，没人在看商品：

比如查看买家秀（其实是录制好的模特秀），当我被强行拉入一个陌生美女的房间，心里一阵乱跳，完全没心思听她说什么看她手里如何摆弄那个想诱使我去购买的商品......
<strong>5、教育成本很高</strong>

整个体验过程，尽管有主控室的语音讲解，但重点还是需要每个体验室内的工作人员手把手的现场指导，并且是要反复的引导说明。如果没有工作人员的指导，我们将像个木偶一样不知所措。如此高的教育成本，试想如何雨露均沾的普及到大众消费的生活中呢？
<strong>6、男生普遍比女生能更快学习适应……</strong>

通过对前面数十位体验者的仔细观察，发现一个有趣的点。男性普遍比女性理解上手的快。在工作人员手把手的初级教育后，男性大多会领悟到后面遇到类似情况该如何操作，同时部分勇敢的汉子还会动作幅度大些的去发掘探索工作人员没有讲解教育的地方和方法。

女生则普遍变现的比较生硬，及时工作人员反反复复的提醒，也显得比较笨拙。

也许与男性和女性的思维模式不同有关（男生普遍逻辑思维较好，女生则普遍形象思维较好）

<strong>亮点：</strong>

<strong>1、场景设计比较优秀，画面色彩绚丽</strong>

尽管没有达到用户心理期望的真实拟物感，但是整个场景的设计还是可圈可点的，用色绚丽舒服，进入场景时有眼前一亮的感觉。

虚拟环境里的机器人玩偶设计也不错，比较有亲和力。

<strong>2、动效适当</strong>

一些交互的微动效运用的不错，让初次进入陌生环境的体验者有一些舒适的愉悦感！

<strong>3、虚拟购物创意</strong>

对待新产品新技术还是多些包容和理解，尽管整个体验过程有诸多的体验不足，但这毕竟是一次大胆创新的尝试之旅，淘宝为我们打开了一扇探究未来科技的窗户，把我们带入了一个全新的体验模式中，光这一点 Buy+ 就值得肯定和称赞！！！

吐槽归吐槽，还是要客观评价下淘宝首创的Buy+购物体验。

也许今天的 Buy+ 体验还存在这样那样的问题；

也许今天的 Buy+ 亮点还不够闪耀光芒；

也许最后它最后无法走入大众消费； 但我也相信随着技术的发展，淘宝设计团队和工程师们的不断努力，也许某一天它会以更友好的姿态让大众消费者舒服的享受着科技带来的惊喜与便捷！
<p align="center"><img src="http://img.zcool.cn/community/022da0579464870000012e7e55f2be.jpg@800w_1l_2o" alt="0b40579464870000012e7ee409c6.jpg" /></p>
说完 Buy+，顺便晒下 淘宝造物节 中亮相其他VR大咖（基本都是游戏，VR先行的发力点还是在游戏方面建树颇多）
<p align="center"><img src="http://img.zcool.cn/community/028bb35794649d0000018c1b9ac7ae.jpg@800w_1l_2o" /></p>
<p align="center"><img src="http://img.zcool.cn/community/02126b5794649e0000012e7ed70844.jpg@800w_1l_2o" /></p>
<p align="center"><img src="http://img.zcool.cn/community/0299f15794649e0000018c1b0e09cd.jpg@800w_1l_2o" /></p>
<p align="center"><img src="http://img.zcool.cn/community/022d0a5794649e0000012e7e5fef24.jpg@800w_1l_2o" /></p>
<p align="center">众里寻他千百步，蓦然回首，我自如大哥就在回身处！</p>
<img src="http://img.zcool.cn/community/023ec5579465d10000018c1ba50c32.jpg@800w_1l_2o" alt="6ead579465d10000018c1bfabb85.jpg" />

* 部分截图来自网络";s:10:"post_title";s:34:"浅谈淘宝Buy+虚拟购物体验";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:93:"%e6%b5%85%e8%b0%88%e6%b7%98%e5%ae%9dbuy%e8%99%9a%e6%8b%9f%e8%b4%ad%e7%89%a9%e4%bd%93%e9%aa%8c";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-26 18:42:46";s:17:"post_modified_gmt";s:19:"2016-07-26 10:42:46";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1042";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}