��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"548";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-21 12:32:31";s:13:"post_date_gmt";s:19:"2016-07-21 04:32:31";s:12:"post_content";s:11700:"互联网的革新，推动了广告产业链的转型，互联网广告形成了爆发式的增长，广告资源的程序化购买正在不断进化，程序化广告从一种趋势，逐渐演变为主流，并呈现出大一统的迹象。

究竟什么是程序化广告？

简单来讲，就是通过计算机程序的介入，使用RTB（实时竞价），PDB（私有程序化购买）等方式完成广告采买，并基于数据，定向投放给匹配的消费者，实现广告效果的最优化。

我们可以看一下这张大图，大致的了解一下程序化广告的生态。和传统媒体最大的区别在于，媒体和媒体背后的消费者信息是打包的。中间五颜六色的区域，你可以想象成各种市场。各种市场里面充满了成千上万的媒体位和上亿的消费者信息。为了方便广告主挑选，通过人工的方式显然是无法实现的，必须通过计算机的程序介入。

<img src="http://img1.tbcdn.cn/tfscom/TB1aWlEMpXXXXcTXpXXSutbFXXX.jpg" alt="" />

&nbsp;

是不是有种眼花缭乱的感觉？面对如此复杂的媒体环境，我们如何去思考这些被投放的广告创意？万变不离其宗！无论媒体环境怎么变，广告创意要解决的核心问题不会变，就是“对谁说？说什么？怎么说？”

&nbsp;
<p align="left"><img src="http://img1.tbcdn.cn/tfscom/TB1oYCtMpXXXXcEXFXXwu0bFXXX.png" alt="" /></p>
研究消费者的时候，应该把他们当作一个个活生生的人。是人就有需求，不同的需求就有不同的满足方法。马斯洛需求理论的广泛运用，证明了它的有效性，它把人的需求分为五个层级，而这5个层级，将帮助我们对不同需求类型的消费者“说点什么？”

说什么，也就是我们想要在广告中传递什么样的信息，它满足了消费者怎样的心理需求与购买动机，这就是我们经常提到的创意诉求。我们根据消费者的五种需求层次，对应出五种诉求特性。

&nbsp;

<img src="http://img1.tbcdn.cn/tfscom/TB1__0HMpXXXXaEXpXXwu0bFXXX.png" alt="" />

分别是：1.价格引导性、2.品质安全引导性、3.社交引导性、4.地位引导性、5.理念引导性。从上图的我们可以看到，广告诉求自下而上经历了理性—感性—精神层面的升华，越往上走越强化品牌力。那么，机智的同学就会问，我们在广告里面把所有的诉求都说一遍，不是销量品牌兼顾了嘛？

请记住广告大师——罗瑟.瑞福斯的名言：“消费者从一个广告里只记得一件事——一项强烈的诉求或者是一个强烈的概念”，所以，目的要单纯。大家可以在脑海里回忆一下你所看过的广告，你能记住的是什么？

当然找准了你的诉求类型还不够，创意的本质是寻求差异，甚至是同类中寻找差异。那么，如何寻找差异呢？用一句话总结就是：“人无我有，人有我优，我先说！”，这就是著名的USP(独特的销售主张）理论，有兴趣的朋友可以空余时间去了解一下详细的内容。

当找准了诉求点，剩下的就是怎么说了。怎么说，更偏重的是技巧层面，也就是我们要思考不同的诉求类型，要用什么样的方式和消费者进行沟通，他们会更感兴趣？

&nbsp;

<img src="http://img1.tbcdn.cn/tfscom/TB1XXBOMpXXXXaVXXXXwu0bFXXX.png" alt="" />

针对价格引导性诉求，广告表现要直白的体现出价格的优势，当然也不是简单粗暴。价格敏感的消费者关注的是“物美价廉”，所以便宜也得有理由，“店庆，老板娘生日…” 给一个让人信服的理由。 如果大家都推低价，那我们就要突出同价位里面品质最好的，画面上营造出热情愉悦的感受，让消费者感觉买得起。

<img src="http://img3.tbcdn.cn/tfscom/TB1k04yMpXXXXcpXFXXwu0bFXXX.png" alt="" />

品质&amp;功能引导性诉求，消费者更关心的是产品功能是不是强大，使用起来是不是足够安全可靠。除非你对产品极度不自信，轻易不要动低价的念头，便宜没好货的道理大家都懂，请不要挑战消费者的常识。我们在美妆类目的眼动测试中，也发现了低价对于点击率下降的影响明显。

画面上，也要以演示产品功能或展示产品细节为主，体现产品的品质，给人安全可信的视觉感受。

&nbsp;

<img src="http://img1.tbcdn.cn/tfscom/TB1QV0KMpXXXXcrXXXXwu0bFXXX.png" alt="" />

社交引导性诉求，重点在帮助消费者在社会，家庭，生活中更好的处理某种关系，这是一个比较感性的认知，所以表达不能过于生硬，要让他们情感上产生认同。产品的特点，要很合理巧妙的融入到这些场景当中。给消费者足够的带入感，画面营造幸福惬意的感受。

&nbsp;

<img src="http://img3.tbcdn.cn/tfscom/TB1zZ0DMpXXXXXoXFXXwu0bFXXX.png" alt="" />

地位引导性诉求，消费者更关注产品是不是能够彰显自己非同一般的特殊地位，或者是高人一等的特殊感受。所以首先要从广告中读到是渗透到骨子里的自信，这是一种优越感的体现，不会过于热情，始终保持着礼貌的距离感。画面也尽可能的简洁，将整个视觉引导到某个细节，或者某种姿态的展现。

<img src="http://img1.tbcdn.cn/tfscom/TB1ZA8GMpXXXXa7XpXXwu0bFXXX.png" alt="" />

理念引导性诉求，消费者追求的是自我意识的觉醒，它超越了简单的物质感受。他们更加注重的是这个品牌背后所倡导的个性或观点，是不是和我合拍，并且持续有深度的互动。这种关系更像是和一个知心老朋友在一起，有回忆，也不断有新的故事，但是一直不变的是起初相互认同的那份初衷。因此，品牌会围绕自己的忠实粉丝，不断创造出属于他们自己风格的内容。

讲到这里，大家可能会说，道理我们都明白，还是不知道怎么做？

所以，我们想到把创意产品化去服务更多的商家，这也是我们推出“创意中心”的初衷！

我们把商家在广告创意时，要解决的“对谁说和说什么”这两个问题归纳为，对广告内容的需求。把“怎么说？”归纳为对于广告表现的需求。

带着这样的需求，我们把阿里妈妈平台的“历史投放数据”、“创意测试&amp;专业研究”以及“技术”资源转化为，创意排行榜、创意大讲堂、创意试验室，三大板块。它们将合力帮助客户解决广告内容和广告表现的问题。

<img src="http://img1.tbcdn.cn/tfscom/TB1274tMpXXXXbtXXXXwu0bFXXX.png" alt="" />
<h4>创意排行榜:</h4>
我们将历史投放数据，基于不同的资源位置和人群定向方式，以排行榜的形式把数据展现给大家，整理成相同类目优秀创意、相同营销场景优秀创意、风格相似店铺创意。它可以帮助商家直观的了解到钻展的广告环境，更加清楚自己周围的同行，甚至竞争对手的创意。

<img src="http://img1.tbcdn.cn/tfscom/TB1fatMMpXXXXb6XXXXwu0bFXXX.png" alt="" />
<h4>创意大讲堂:</h4>
我们将通过对历史投放数据的挖掘，同时结合眼动仪测试、图像识别技术、买家行为研究、专业文献资料研究和ABtest的比对，按相同类目和相同营销场景，整理成创意设计方法、创意趋势分析以及消费者洞察。以知识的方式呈现给商家，帮助商家更好的设计创意。

<img src="http://img3.tbcdn.cn/tfscom/TB1BExQMpXXXXXsXXXXwu0bFXXX.png" alt="" />
<h4>创意实验室:</h4>
主要解决商家在创意制作上的两大问题。

1.创意千人千面，程序化广告的进化，使得广告位背后的每一个消费者变的清晰可辨，基于精准定向的广告投放，转换率也得到了大幅度的提升。用一个广告和所有消费者沟通的方式，已经开始转变为，和成千上万的消费者，进行1对1的沟通。这就催生出商家，对于创意制作的量级需求大增。

2.释放制作成本，就是我们希望通过工具化，直接帮助商家多，快，好，省，批量生成创意，让商家不再为缺少专业的设计资源操心。

<img src="http://img3.tbcdn.cn/tfscom/TB1o6pdMpXXXXbiapXXSutbFXXX.jpg" alt="" />

<a title="创意试验室一期上线视屏" href="http://v.youku.com/v_show/id_XMTUyNjc4MDIyMA==.html" target="_self">http://v.youku.com/v_show/id_XMTUyNjc4MDIyMA==.html</a>

创意实验室一期上线视频。

<img src="http://img2.tbcdn.cn/tfscom/TB10ExKMpXXXXcPXXXXwu0bFXXX.png" alt="" />

创意实验室已经经历了三期的开发，到目前为止，共计有14个常用类目，不同营销场景下共计5157个模版，它基本能够覆盖大多数商家的需求。同时，我们还对编辑器进行了优化，目前支持全尺寸联动和个性化编辑。

当然，我们也在与时俱进。接下来，我们将把创意实验室，升级为智能创意实验室。它将包括智能模版库、智能文案库、智能图片库、智能色彩库，四个板块，我们将同时对这四个板块的库存进行升级。

<img src="http://img3.tbcdn.cn/tfscom/TB1LtJFMpXXXXX6XpXXwu0bFXXX.png" alt="" />
<h4>智能模版库:</h4>
我们将通过对历史投放数据挖掘、眼动仪测试和abtest的比对。以分层打散的格式，沉淀出模版的本框架。再基于创意大讲堂沉淀的专业知识，按不同营销场景、不同类目、不同风格开发模板款式，录入模版库。

<img src="http://img1.tbcdn.cn/tfscom/TB13lXzMpXXXXXhXFXXwu0bFXXX.png" alt="" />
<h4>智能文案库:</h4>
从历史投放数据中挖掘出，对创意效果影响明显的文案。按照主标题、副标题、利益点，以不同营销场景，进行分类提取，录入文案库。

<img src="http://img1.tbcdn.cn/tfscom/TB1hChcMpXXXXb_apXXwu0bFXXX.png" alt="" />
<h4>智能图片库:</h4>
它的素材升级主要有3大来源: 1.对商家自身历史投放素材的抓取；2.对商家店铺详情页面的商品图抓取；3.商家自主上传的图片素材。全部汇总到创意图片库。

<img src="http://img3.tbcdn.cn/tfscom/TB1d4XJMpXXXXXIXpXXwu0bFXXX.png" alt="" />
<h4>智能色彩库:</h4>
包括两块内容：1.图片主色调的自动抓取，它将解决对复杂图片的主色识别，目前我们已开放完成。2.是对不同风格的配色模型进行开发，收入配色库中，用于图片自动配色。

这四个库究竟智能在哪里？

<img src="http://img3.tbcdn.cn/tfscom/TB1OElDMpXXXXc9XpXXwu0bFXXX.png" alt="" />

它的智能在于，将基于底层大数据，连接起商家端和消费者端。

当商家发起一个推广计划，当前的营销场景、类目、商品详细信息会传送到智能库，同时消费者端的特征信息也会匹配进来，之后创意试验室将根据不同的消费者特征，组装成千人千面的广告创意，展现给不同的消费者，实现广告效果最优化。

&nbsp;
<p align="left"><img src="http://img3.tbcdn.cn/tfscom/TB1OE8PMpXXXXXVXXXXwu0bFXXX.png" alt="" /></p>
创意排行榜，是对商家的数据赋能。创意大讲堂，是知识的赋能。我们也会把这些数据和知识，沉淀到创意试验室，通过工具直接帮助商家，制作更优质的广告创意。帮助商家在推广中“找对人！讲对话！讲好话！”，实现品效提升！真正实践妈妈的使命，“让天下没有难做的推广！”

&nbsp;";s:10:"post_title";s:33:"程序化广告环境下玩创意";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:99:"%e7%a8%8b%e5%ba%8f%e5%8c%96%e5%b9%bf%e5%91%8a%e7%8e%af%e5%a2%83%e4%b8%8b%e7%8e%a9%e5%88%9b%e6%84%8f";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-21 12:32:31";s:17:"post_modified_gmt";s:19:"2016-07-21 04:32:31";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=548";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}