�ːZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:68;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-17 22:48:31";s:13:"post_date_gmt";s:19:"2016-07-17 14:48:31";s:12:"post_content";s:16595:"今天看到了一篇超级实用的干货文章，决定用自己的语言把它翻译出来，独乐乐不如众乐乐对吧！

不过大家不要嫌弃偶的翻译哦！

关于设计的20个核心要素和原则

今天看到了一篇超级实用的干货文章，决定用自己的语言把它翻译出来，独乐乐不如众乐乐对吧！

不过大家不要嫌弃偶的翻译哦！

设计是一个复杂的、十分复杂的、very复杂的，有趣的和令人兴奋的业务。

然后呢，就算你在设计这个行业工作再久，你也要把自己当成一个初学者，因为技术是不断发展的，软件也是不断迭代的，设计潮流也是在变的；说实话，要想保住自己的饭碗，总要拿出点压箱底的技术来~~

所以，让我们尽可能的放慢一点步伐，讨论一下关于设计的20个原则。

一：线

<img src="http://img.zcool.cn/community/020a24578775850000012e7ec1fb30.jpg@800w_1l_2o" alt="617a578775850000012e7e472c8d.jpg" />

我相信我们都知道什么是“线”，但只是要确定，“线”可以被定义为任何线性标记。所以，当你考虑它时，所有的一切都是“线”。即使你现在正在阅读的这些单词和字母都是由成千上万个弯曲的，倾斜的直线组成的。
线条也可以有一定的想法！直的线能唤起整洁，波浪线可以创建运动，曲折线意味着紧张或激动。

通常写一篇文章时，会有一条“引导线”，这条线呢可以串起你整篇文章的重点，和故事发展的大概。

而在设计中也是如此！
让我们看看网页设计中的“引导线”的一个例子。这个网页是由一个很酷的对角线引导的设计，所以整个网站的设计，包括标题、导航、介绍都得跟着这对角线的设计而布局。

<img src="http://img.zcool.cn/community/020ffb578775990000018c1b96540c.jpg" alt="b337578775980000018c1be10850.jpg" />

PRA的网站设计

一个全是用线组成一幅图的方式是一个非常强的表现方式，而下面这张图也让我想到了很久以前玩的一个手机游戏“找你妹”，曾经让我玩的是精力交瘁、欲罢不能，上瘾的有木有，咦？好像跑题了。

言归正传，这幅线框插画呢是设计师Ksenia给一个服装品牌设计的。用简单的白色线条来穿插整个画面，整体的设计风格体现了它的可识别性和独特性。也给这种线框广告插画起了一个不错的头。

<img src="http://img.zcool.cn/community/026750578775a80000012e7e0d008a.png" />

<img src="http://img.zcool.cn/community/026ab7578775a80000018c1b6898b3.png" />

线条是灵活的，简单的和有效的图形元素，只要运用的好，一样可以给你的设计增光添彩，不如现在就开始给自己设计一幅美美哒的线框图，也不枉我如此辛苦的码这么多字。

二：比例

<img src="http://img.zcool.cn/community/02ce3d578775b50000012e7e7ac140.jpg@800w_1l_2o" alt="9e01578775b50000012e7e459d23.jpg" />

比例是设计的很大一部分，有时是字面上的。在一个非常基本的定义中，尺度决定着个体元素的大小。
尺度可以帮助我们理解设计和图像。想想看，如果你是在一只大象旁边画一只老鼠，你可能会把老鼠画得比大象小得多，这将有助于观众立刻理解你的画。
这样，比例有助于我们对事物的感觉。但是，比例并不总是必须以现实主义为基础的。你可以改变你元素的大小，以创造惊人的效果，并发出信号，毕竟你的设计才是最重要的。

例如，看看这张电影海报，海报中，主角的头是不是被放大很多倍，马上吸引了大家的注意力有木有。

<img src="http://img.zcool.cn/community/02b690578775c50000012e7ed1ffed.jpg" alt="9bd1578775c50000012e7edff832.jpg" />

而这个比例是不是基于真实的人脸一般都是在现实生活中一样的大小，急剧扩大人脸有助于观众瞬间掌握电影的重点，以及使海报成为一个独特的设计。
这个元素对信号的重要性的比例通常被称为“层次结构”，这个有点不易于理解，说白了，就是要掌握画面的层次性，有虚有实，有明有暗，有远有近，有大有小，以达到画面的层次性。

三、颜色

<img src="http://img.zcool.cn/community/02bdcb578775dd0000018c1b2032da.jpg@800w_1l_2o" alt="a039578775dd0000018c1b911ef3.jpg" />关于色彩，说的人真是太多太多了，颜色多么重要，是个人都知道，很多爱美败家的女生衣柜里堆满了五颜六色的衣服，齐全的连颜料盘都要甘拜下风，由此可见大家对于颜色的喜爱程度。

色彩会产生特定的情绪、气氛和情感，每一个阴影都有特定的内涵与它联系在一起。总之，颜色可以打破你的设计。
让我们看看下面两个例子。首先，一个女性用品的设计。该设计选择了轻、软以及柔和的色彩。运用白色，浅灰色，粉红的色调和金属色字体，这些选定的颜色相得益彰地创造一个安静、优雅的女性化设计。

<img src="http://img.zcool.cn/community/02d120578775f20000012e7ee0da23.jpg" alt="5f9d578775f20000012e7e9a2fa9.jpg" />
另一个设计，某果汁品牌。

<img src="http://img.zcool.cn/community/02fcad578775ff0000018c1b5a127a.jpg" alt="e504578775ff0000018c1b7fed84.jpg" />

颜色不是一个简单的原则，不止局限于品牌元素，颜色可以扩展到一切，甚至照片。滤镜和图像调节器给予照片中的色彩和色调无尽的可能性，只要你想的到。

我最后想说：
你在设计一个复杂和毫无灵感的海报时，为什么不特立独行一点，运用自己喜爱的色彩设计一个你觉得满意的作品，也许会有一个意想不到的收获！

四：重复

<img src="http://img.zcool.cn/community/025b6e5787760b0000018c1bcbcee8.jpg@800w_1l_2o" alt="14a95787760b0000018c1bc0d62f.jpg" />

想想一些大品牌，比如可口可乐、谷歌、苹果、耐克，我相信对于他们的标志大家都很熟悉，其实比它们好的logo有很多，但是为毛单单就记住了它们。

是的，你猜对了—重复。
重复是一个重要的元素，当涉及到品牌设计，无论是在保持品牌的一致性，还是在捆绑项目的同时。
让我们看看一个品牌的例子。下图中，VI中使用一致的颜色色调和一致的logo，保持统一的间距。

<img src="http://img.zcool.cn/community/02f43d5787761c0000012e7ecaee90.jpg" alt="3d375787761c0000012e7eeac577.jpg" />

重复是一个关键因素，当涉及到品牌，它就不再是美丽的一次性设计。例如，涉及到创建模式和纹理的时候。
看看这个包装设计使用重复的图形。效果不再是繁琐无趣的旧窗帘，他们可以变得非常有趣和好看。那么，为什么不在你的下一个设计中实现重复的设计效果呢？

<img src="http://img.zcool.cn/community/02fcba578776270000018c1b3fa91f.jpg" alt="b4ea578776270000018c1b5bad6c.jpg" />

想要拥有更多的灵感，何不如自己尝试着做一套有趣的品牌VI，最少也要摆出几十个华丽的几何图形才对的起自己有木有？

<img src="http://img.zcool.cn/community/0200e4578776320000012e7ec6de23.jpg@800w_1l_2o" alt="fdeb578776320000012e7e405115.jpg" />

五、负空间

<img src="http://img.zcool.cn/community/02d22c578776400000012e7edf9d4e.jpg@800w_1l_2o" alt="d1b2578776400000012e7eaeac15.jpg" />

说穿了， 负空间是在空间、地域、周围形成自己形状的元素。
很多人认为负空间的开发者是画家埃舍尔。

<img src="http://img.zcool.cn/community/02a8945787764b0000018c1bc0816c.jpg@800w_1l_2o" alt="76aa5787764b0000018c1bab49ba.jpg" />

看到埃舍尔在空间中用鸟类创造鱼的形状？这是一种消极的工作空间。考虑到周围的一切，利用物理设计，并操纵整个空间，形成新的形状。
消极的空间，当巧妙的使用物理设计可以创造真正惊人聪明的设计。

下图是由设计师乔治绘制的一系列动物图标，清晰的描绘出了简单干净的动物形状 。

<img src="http://img.zcool.cn/community/023aac5787765f0000018c1bc4c5b5.png" alt="9cfe5787765f0000018c1b9ca391.jpg" />

六、对称

<img src="http://img.zcool.cn/community/02cf095787766a0000012e7ee1f705.jpg@800w_1l_2o" alt="71965787766a0000012e7e81a0bb.jpg" />

作为21世界最伟大的物种—人类被科学证明是会被对称所吸引的。我们发现只要是对称的面孔（好好笑，谁的面孔是不对称的？当我傻吗），图案和设计一般更具有吸引力。

很多的logo都使用了对称性设计，为了创造一个和谐平衡的画面。采用对称logo的大品牌呢，比如麦当劳，香奈儿，星巴克等都是，还有就是我们伟大的故宫设计也是对称性的，总而言之，对称设计是very高大上的。

<img src="http://img.zcool.cn/community/028028578776760000018c1b038a2f.jpg" alt="e223578776760000018c1bb3b749.jpg" />

当然，不可能所有设计都是对称性的，也不应该是。在一个看起来是平衡和对称的设计之间有一条线，看起来像是其中一边被复制，翻转，粘贴到另一边上去的。因此，不要试图实现完美的对称性，而是试图在你的设计中引入微妙的对称元素。
例如，这场婚礼邀请卡使用高度的对称性，但它不是完美的镜像。相反，设计师微微调整插图，以微妙的不同保持设计整体的对称平衡。

<img src="http://img.zcool.cn/community/025c98578776820000012e7e433dfa.jpg" alt="ab2b578776820000012e7e62b89a.jpg" />

对称并不总是那么明显，有时它是微妙的，有时你甚至没有注意到它。一个看不见的对称性例子可以在更具体的文本框中找到。打开任何一本杂志看看，可能是在一个较长的文章中你会发现它已被分割成文字列，这些列通常是对称设计的，以保持清晰、整洁、以及视觉上的吸引力。

看看这个年度报告，是不是也是对称的？

<img src="http://img.zcool.cn/community/02949e5787768a0000018c1b341af4.jpg" alt="42b95787768a0000018c1b225e5d.jpg" />

通过在你的布局设计中使用一点点对称，你可以创建一个平衡的秩序感。所以，下一次你在设计一个出版物的时候，或者一个有很多类型的设计，注意你使用的对称性有多少。切记，不可多，也不可少，至于具体多少？根据具体的设计来定！

七、透明度

<img src="http://img.zcool.cn/community/02bde4578776950000012e7e2985b6.jpg@800w_1l_2o" alt="9d41578776950000012e7e609842.jpg" />

也偶尔被称为“不透明度”，让我们看一个使用透明度的例子。这个惊人的例子是杰克用各种大小不一、不同颜色透明度的形状交叉而成的插画。

在这种方式中，调整与玩弄透明效果是强调图层和形状的一个比较独特的方式。

<img src="http://img.zcool.cn/community/028380578776a20000012e7e2ea0b9.jpg" alt="3b91578776a20000012e7ec1f26f.jpg" />

玩弄透明度也是一个伟大的技术，产生一个静态图像的运动感。

<img src="http://img.zcool.cn/community/02a125578776af0000018c1b29f540.jpg" alt="9bbe578776af0000018c1ba82351.jpg" />

例如，看看这张海报，图像处理成不同程度的透明效果，交叉着创造一个引人入胜的效果和运动感。

透明度也不仅仅局限于数字图形。这个玻璃帖子是纽约博物馆的介绍牌，为了设计一个独特的引人入胜的效果。

仔细考虑你的设计是为什么人服务，不要害怕不敢用你的创意。

<img src="http://img.zcool.cn/community/021f88578776b80000018c1be1625b.jpg" alt="044c578776b80000018c1bc67b11.jpg" />

八、纹理

<img src="http://img.zcool.cn/community/020628578776c20000012e7e61bb15.jpg@800w_1l_2o" alt="2b5f578776c20000012e7ee73df9.jpg" />

干净，锋利，光滑的平面设计可以是美好的，但有时候，选择一些纹理效果会更好。纹理可以增加触感、深度，对于你的设计可以起到增添一些有趣效果的作用。
然而，与许多事情一样，一定要适度的使用这种技术，因为太多的纹理会很抢你的设计。记住：使用任何效果的时候都要有个度。

<img src="http://img.zcool.cn/community/02afdc578776cf0000018c1bb1ece6.jpg@800w_1l_2o" alt="36b1578776cf0000018c1b20be89.jpg" />

让我们看看一个例子，在使用纹理的同时，使用了立体块状效果。这个漂亮的字体由丹卡沙罗设计，使用纹理营造了一个复古的风格。注意，粗糙的质感不是为了分散注意力而是更好地提高了整体的视觉感。

<img src="http://img.zcool.cn/community/022e11578776d90000018c1bd94a4e.jpg" alt="213a578776d90000018c1bd7007e.jpg" />

看看下面这张葡萄酒公司所设计的名片， 墨水点式的纹理压花质感的名片，是不是瞬间档次上来了。在设计中使用纹理可以让你的设计变得更有感觉，更会脱颖而出。

<img src="http://img.zcool.cn/community/021b2c578776e30000012e7eb3711e.jpg" alt="1932578776e30000012e7eea67a8.jpg" />

九、平衡

<img src="http://img.zcool.cn/community/02e187578776ed0000012e7e3561b3.jpg@800w_1l_2o" alt="6ff7578776ed0000012e7e859fe3.jpg" />

平衡是生命中一个非常重要的东西，它在设计的世界里同样重要。
平衡的方法是考虑到每一个元素的“重量”。无论是文本框、图像、块状的颜色，都要考虑他们的大小、形状、和 “重量”。

一个好的方法是想象如果你的设计被打印成一个三维模型。它会站起来，还是瞬间從了？
看看这只猫的logo，非常完美平衡的设计。如果它是印刷的，答案是它会坐直。

<img src="http://img.zcool.cn/community/02a21d578776f90000018c1bc261de.jpg" alt="0ffc578776f90000018c1be3be27.jpg" />

一种类型的平衡是“不对称的平衡”，这是反映左和右、顶部和底部的分布排列，调整元素的大小，使他们能在视觉上平衡。

让我们看一个例子。这充满活力的圆形色块是一个聪明的元素分配，平衡了整体的设计。注意如何通过元素的大小实现从左到右，从上到下的平衡。

<img src="http://img.zcool.cn/community/025ef6578777060000018c1b336bba.png" alt="6f25578777060000018c1be8e966.jpg" />

十、等级制度

<img src="http://img.zcool.cn/community/022662578777120000012e7ed94c77.jpg@800w_1l_2o" alt="5288578777120000012e7eabc775.jpg" />

先来说说层级之中具有国王地位的标题。

<img src="http://img.zcool.cn/community/02619f5787771c0000018c1b573f71.jpg" alt="fd805787771c0000018c1b9fa6ee.jpg" />

看看下面这个杂志的例子，展示了三种不同的信号，标题/标题的重要性/标题的意思。无论你选择怎样的设计方式，一定要确保消费者可以不用思考的立即读懂你的标题。

下一个层级就要说到贵族了，这仍然是十分重要的元素，但不要像国王那样醒目。这就是—副标题（引文的附加信息）。保持副标题的醒目，但是千万不要比主标题还醒目，否则副标题岂不是要造反了？
下面这张图上，注意日期（一个非常重要的部分）变大了，比它下面的信息更大更明显。然而，它并没有比上面的标题更醒目。

<img src="http://img.zcool.cn/community/025bdb578777290000012e7ec39d42.jpg" alt="836b578777290000012e7e2fc8c3.jpg" />

在等级制度的最底端是农民，比如不重要的信息、链接等等。
这张夜市的海报中。你可以很容易地指出标题、副标题/日期，然后额外的并不那么重要的信息起到了点缀的作用。

<img src="http://img.zcool.cn/community/02fdf8578777320000018c1b10e8c9.jpg" alt="2b78578777320000018c1b23cf22.jpg" />
当然，层次结构不仅仅局限于类型。图像也有层次结构， 没有不起眼元素的对比，又怎能突显其他元素的醒目。

看了以上十点后，不知道大家是不是有点受益匪浅的赶脚，反正我是感触良多，虽说做设计不是一个简单的活，但咱们还不得接着干下去？

先更新这十点，给的赞多的话呢，再继续更新，我也得有动力不是？啊哈哈！

好哒，今天的内容就到这里，";s:10:"post_title";s:41:"20个设计核心要素和原则（上）";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:119:"20%e4%b8%aa%e8%ae%be%e8%ae%a1%e6%a0%b8%e5%bf%83%e8%a6%81%e7%b4%a0%e5%92%8c%e5%8e%9f%e5%88%99%ef%bc%88%e4%b8%8a%ef%bc%89";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-18 14:02:37";s:17:"post_modified_gmt";s:19:"2016-07-18 06:02:37";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:23:"http://qisumu.com/?p=68";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}