T��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"416";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-20 15:45:04";s:13:"post_date_gmt";s:19:"2016-07-20 07:45:04";s:12:"post_content";s:13295:"《守望先锋》终于千呼万唤始出来啦，作为暴雪的游戏粉丝，我在第一时间体验了一把。因为是做游戏交互，所以，基于自己的兴趣爱好，尝试着写了一篇体验报告。因为更多的还是自己一些想法，初来乍到，希望大神们多多指点。

<img src="http://gameweb-img.qq.com/gad/20160617/phpN0XKm8.1466146799.png" />

一、一款什么游戏  ？

一款融合了MOBA元素的FPS游戏，你将控制许多风格迥异的英雄中的其中一个，与战友组成一支六人队伍，和对手抢夺目标、决一死战并夺取最终的胜利！

1.1 游戏的世界观

设定在近未来世纪的地球，在一场被称为“Omnic”的全球危机后几年。在拥有强大的破坏力的维和机器人和重型武器的控制后人工智能对人类发起了进攻。

为了对抗智能危机，一支被称为”守望先锋“的国际行动组织为保护人类，结束危机为目的成立。 守望先锋招募了世界各地各式各样的人才。

守望先锋的管理是由上至下，并且设有领袖进行任务指挥。组织内设有普通行动组和秘密行动组两个组织是分开行事并且拥有不同的风格和规定。

<img src="http://gameweb-img.qq.com/gad/20160617/phpEQp3gs.1466146808.png" />

1.2游戏的玩法

1、攻防战    2、运载目标  3、占领要点  4、攻击/护送运载目标

<img src="http://gameweb-img.qq.com/gad/20160617/phpbBTLAS.1466146814.png" />

二、暴雪靠什么吸引玩家？

2．1为玩家量身定做的成就机制

通过双方对抗，来征服高难度的挑战以此释放玩家的破坏能力、掌控能力、辅助能力、领导能力等。并且进行及时的数据量化反馈。还会对玩家的数据进行沉淀积累。

<img src="http://gameweb-img.qq.com/gad/20160617/phpts0j7X.1466146821.png" />

2.2玩家杰出表现设置奖励机制

对玩家各个维度的表现进行数据量化，对优秀数据进行商店物品奖励，用于英雄皮肤装饰和玩家形象的DIY。并对奖励物品进行统计，展示给玩家，以此引导玩家的消费行为。

<img src="http://gameweb-img.qq.com/gad/20160617/phpQTbC4l.1466146827.png" />

2.3玩家获得本能层快感的合作机制

六人一个队伍，英雄定位不同。技能各有千秋，彼此之间协同合作。做大限度的释放团队作战能力。团队行动的协作进攻，以及支援英雄的保护效果，爆头、轰炸、围困，歼灭一系列对抗元素，激发心中的暴力因子，获得本能层的快感。

<img src="http://gameweb-img.qq.com/gad/20160617/phpPzG8s4.1466146832.png" />

2.4鼓励玩家创新的探索机制

游戏有四种玩法，每种玩法各有不同的策略。游戏有12张个性地图，团队可以产生不同的战法。游戏进行时，可以根据敌方阵容特点，临时更换自己的出战英雄，创造新打法。这些都最大限度的激发玩家的探索欲望。

<img src="http://gameweb-img.qq.com/gad/20160617/phpvs2sC1.1466146838.png" />

二、暴雪的设计思路是什么？

在分析暴雪设计思路的过程中，其实有点类似于对游戏展开逆向研究工程

<img src="http://gameweb-img.qq.com/gad/20160617/phpwBxWMP.1466146844.png" />

体验是一个过程，而好的体验是一个“如连续方程曲线”一样顺滑的的过程。而根据这个游戏的特点我把这个过程分为三个阶段：战前准备、战斗体验、战后反馈。

因为设计策略是一个系统性的方法论，为了便于揭示它，我们将采用总分总的方式，也就是概括、分析、概括。其中、分析分为两个部分，分别对应上述体验蓝图的前两个阶段，分析的侧重点各有不同。其中

<img src="http://gameweb-img.qq.com/gad/20160617/phpt5wehu.1466146850.png" />

PART 1: 设计的主角 —— 这个世界需要英雄

《军团要塞》和《守望先锋》界面对比

通过对比发现，暴雪的设计师想要强烈表达的是我们的主角：英雄！

<img src="http://gameweb-img.qq.com/gad/20160617/phpNzRJii.1466146857.png" />

你能看到暴雪是有多爱自己的英雄，他们在尽可能多的界面去展示他们，而且每个页面都尽力做的像海报一样。

<img src="http://gameweb-img.qq.com/gad/20160617/phpe5Q3En.1466146865.png" />

英雄既是游戏玩法的核心（灵魂），又是该游戏盈利的摇钱树，一切的“策略和原则”都是围绕着“英雄们”展开的。

<img src="http://gameweb-img.qq.com/gad/20160617/phpBOXcx9.1466146871.png" />

PART 2: 战前界面设计策略 —— 让英雄们热闹起来

战前主界面交互策略。

对于一款“容易上手，难以卓越”的技巧性游戏,在战前主页面中，暴雪的交互设计师关注的核心是什么，通过什么样的交互技巧实现通过与《军团要塞》的对比，我们看看，《守望》主页面有什么特点？

<img src="http://gameweb-img.qq.com/gad/20160617/phpmaJw13.1466146878.png" />

一级界面交互特征

<img src="http://gameweb-img.qq.com/gad/20160617/phpZhxqOS.1466146885.png" />

二界面交互特征

<img src="http://gameweb-img.qq.com/gad/20160617/phpAQTW5d.1466146893.png" />

<img src="http://gameweb-img.qq.com/gad/20160617/php3iLFQ3.1466146904.png" />

<img src="http://gameweb-img.qq.com/gad/20160617/phpY7vC1p.1466146914.png" />

“补给”界面的交互特征

在二级页面中，“补给”页面在交互方式上和其他页面完全不同，它是整个游戏中为数不多的采用场景动效的页面

通过具有“仪式感”的动效，来强调收到的物品奖励

如图所示，玩家在游戏中获得杰出表现系统会进行物品奖励。物品奖励通过“打来宝箱”的方式进行领取，打开宝箱的交互是通过约5S的动效来实现的。

<img src="http://gameweb-img.qq.com/gad/20160617/phpukNQD8.1466146922.png" />

与其他几个二级页面相比，“补给”页面的交互形式是一个特殊的存在，那么，这是暴雪的设计师心血来潮吗，我想不是的。即便是，他们也会用一种销魂的解释。不管怎么样，我还是忍不住去推理了一下。

在我看来，交互上的“特殊化“不应该是单纯的设计改造。任何变动都应该有理有据，你可以令人信服。也许你可以说每个设计都是有根据的，但是对于游戏交互来说还不够。在任何时候你都要保证你的设计和游戏本身有关。这样的概念往往源于设计的灵魂或者本源，需要自始至终地存在于设计的每一个阶段。那么回到问题的本身：这个游戏的灵魂是什么?“补给页面”的“策略和原则”都是如何围绕英雄展开的。

我想从以下一个方面可以说明问题：

《守望》不同页面间，几乎不存在不同页面间的系统连通，但是唯独在“战后成就反馈页面”会有“奖励补给品”按钮作为入口与“补给页面”连通。“而战后成就反馈页面”又恰恰是围绕英雄宣传产生的。所以，我想这也就不难解释“补给页面”在交互上会不同于其他二级页面啦！

补给页面采用场景化设计，通过强动效去渲染成就奖励的或者商品购买的氛围，这种交互模式分为与英雄的情景化宣传在形式上是一致的。大量的英雄宣传页是为游戏的“盈利模式”服务的，而“补给页面”又是游戏的盈利入口。

他们这样做的根本目的就是通过无缝的场景体验和强烈的视觉刺激去引导玩家在补给上进行消费。

总结

通过对上述页面进行对比分析，我们发现，暴雪设计师在处理《守望》战前页面的过程中，UI界面信息是有“轻重缓急”之分的。

梳理一下思路：在确保每个页面信息 量适当的情况下.

<img src="http://gameweb-img.qq.com/gad/20160617/phpFsHna7.1466146990.png" />

&nbsp;

也就是说在信息总量确定的情况下，页面内信息，通过“此消彼长”的处理方式，表达页面重点。不同页面间。通过“规范交互布局”、“确保交互行为一致性”，简化交互行为。那么我们进行一下总结：

<img src="http://gameweb-img.qq.com/gad/20160617/phpJ7ohlD.1466146999.png" />

PART 3战斗界面设计策略 —— 战斗吧守望者们

玩游戏的根本目的是体验乐趣，战斗界面的交互处理方式又是影响用户体验的核心因素。《守望先锋》战斗玩法既有《CS ONLINE》等FPS射击游戏的特点，又有《风暴英雄》等MOBA游戏的特点。那么，就界面功能信息布局上，《守望先锋》在交互设计上是如何试图打造一个淋漓尽致的战斗对抗，帮助玩家获得乐趣呢？

<img src="http://gameweb-img.qq.com/gad/20160617/phplwfoad.1466147013.png" />

<img src="http://gameweb-img.qq.com/gad/20160617/php4Bdlnr.1466147024.png" />

在玩家执行鲊斗操作时，提供视觉、听觉上的反馈，这样玩家便能清楚地知道自己当前的操作会有什么效果，从而更好地投入到游戏中去，投入其中才更能感受到游戏的乐趣，所以为玩家的操作提供感官反馈尤为重要。

<img src="http://gameweb-img.qq.com/gad/20160617/phphe4KtF.1466147039.png" />

<img src="http://gameweb-img.qq.com/gad/20160617/phpzYVcJz.1466147062.png" />

总结

通过对上述页面进行分析，我们发现，暴雪设计师在处理《守望》战斗界面的过程中，依据核心玩法，设定了“以射击模式为主，大招进行重要支持，小技能释放为辅”的英雄操作逻辑。考虑到视觉优先级的问题，设计师需要权重界面各个功能UI元素的布局，并考虑技能与射击行为的反馈机制。最后采用环境烘托的手法，全方位镜头捕捉进行英雄特写动作回放。已达到完美的战斗体验。

也就是说在玩法明确的情况下，在视觉层面上，划分核心视觉区域，核心视觉辅助区域、视觉补充区域来满足UI控件对玩法的支持，同时考虑战斗操作事前、操作、结果反馈为玩家营造合理平滑的操控体验 。

<img src="http://gameweb-img.qq.com/gad/20160617/phpBGpB3b.1466147074.png" />

PART 4 战后成就反馈页面硬性用户体验的交互设计原则

战后的成就反馈界面承载了游戏的成就机制和奖励机制的需求表达，“玩家对战数据“的展示方式和展示内容，都会在很大程度上的影响玩家的游戏行为。《守望》是采取什么样的方式来进行战后成就反馈呢？

对于玩家的数据反馈：

<img src="http://gameweb-img.qq.com/gad/20160617/phpZgDE8B.1466147084.png" />

<img src="http://gameweb-img.qq.com/gad/20160617/phpVZxhFe.1466147111.png" />

&nbsp;

对于团队的数据反馈：

<img src="http://gameweb-img.qq.com/gad/20160617/phpjemTuV.1466147103.png" />

四、我都有哪些感想

4.1一些遗憾

鉴于我的知识储备和实践经验有限，此次是以英雄为中心展开，分析了战前和战时相关界面的交互策略。但并未就整个游戏系统展开全局交互策略的分析，比如：本次分析缺少了游戏指引流程的的交互策略分析，而其做的也非常出色。因此，此次分析缺少全局性。

4.2一些想法

《守望》许多界面不同于暴雪以往游戏的界面交互设计风格，比如在交互框架上极度的扁平化，界面信息极度简约。一方面，这可能是早暴雪的交互设计师在寻求交互思维上的创新，另一方面，可能也是同运营、同策划妥协的结果。

不管怎么说，我提出了以下几个疑问：

1、暴雪为何在战前交互界面的设计上采用了类似于手机游戏交互设计的准则。是为未来手游移植做准备，还是仅仅属于交互侧边的理念转变。

2、这款游戏是属于首次购买付费，同时，玩家还可以选择游戏增值付费。这在很大程度上制约的游戏的盈利模式那么，这款游戏是否存在其他盈利模式的可能，如果有，是如何展开的，在交互层面如果落实。

以上两个问题既有属于交互层面的，也有属于运营策划层面的。随着对游戏更深入的体验，我会继续做以上两方面的研究。

五、结语

<img src="http://gameweb-img.qq.com/gad/20160617/phpV8QhTA.1466147128.png" />                                                                                                          <strong>OVERWATCH</strong>
<p align="center">　　重要的不是别人创造了什么，而是你是否看懂了并且学会了其中的奥秘。《守望》的设计师们找到了英雄，它是游戏的载体与灵魂，它赋予了《守望》交互的全部，是《守望先锋》的奥秘。设计　不是凭空想象，他需要现实的映射，需要经验的铺垫，需要来自生活的灵感。去寻找每一个设计的ｌ灵魂，打造自己心中的守望者。</p>";s:10:"post_title";s:36:"《守望先锋》交互体验报告";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:108:"%e3%80%8a%e5%ae%88%e6%9c%9b%e5%85%88%e9%94%8b%e3%80%8b%e4%ba%a4%e4%ba%92%e4%bd%93%e9%aa%8c%e6%8a%a5%e5%91%8a";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-20 15:45:04";s:17:"post_modified_gmt";s:19:"2016-07-20 07:45:04";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=416";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}