̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1330;s:11:"post_author";s:1:"3";s:9:"post_date";s:19:"2016-02-28 17:11:03";s:13:"post_date_gmt";s:19:"2016-02-28 09:11:03";s:12:"post_content";s:10577:"<blockquote>废话少说，今天开门见山来聊聊APP服务设计需要注意的五个点。希望对大家的移动APP设计有所帮助。

服务设计也是热炒的一个设计概念。如果你没听过或者没涉及到可以忽略，有兴趣的设计小伙伴可以阅读体验一下。</blockquote>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/01/sheji4.jpg"><img class=" size-full wp-image-278145 aligncenter" src="http://image.woshipm.com/wp-files/2016/01/sheji4.jpg" alt="sheji" width="680" height="320" /></a>
<h3>第一点：User-centered</h3>
以用户为中心，服务需要从用户的眼睛来看世界。

在服务设计过程中，用户的参与是必须的，大部分服务都需要有用户的参与才能形成闭环。

所以在服务设计过程中，我们应该以用户为中心，讲用户听得懂的语言，讲用户的语言。

我是卖沙发的，我可能想的是赚钱、开发新产品扩展市场等。但是用户想的，是使用舒服、质量好的沙发，所以我会在产品设计过程中做出舒服、优质的沙发来服务用户。进一步了解用户，我发现本地公寓住户居多，年轻人多，用户们希望使用小一点，可以自由搭配组合，时髦一点的沙发，这些用户的需求会成为我设计新款沙发的输入点，而且我在销售方式上也会灵活搭配沙发售卖，而不是使用传统的一整套沙发售卖的方式。

我还发现本地居民开小卡车的人少，大部分人开轿车，轿车是装不下沙发的，所以我需要提供优质的送货服务给用户。最后我发现本地用户喜欢上网，我就建立了一个网站，搜集用户对我的沙发的评价、意见，形成一个沙发粉丝论坛。…… 于是我的沙发生意越做越好…… 嘻嘻

以用户为中心这点，服务设计和用户体验设计是相通的。

<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/01/76c2f3d787bff14307e3c03dd53f031b.jpg"><img class=" size-full wp-image-10267 aligncenter" src="http://image.woshipm.com/wp-files/2016/01/76c2f3d787bff14307e3c03dd53f031b.jpg" alt="移动APP服务设计图2" width="650" height="327" /></a>
<h3>第二点：Co-creative</h3>
共同创造，服务设计需要所有参与者进入到设计流程中。

每个人都是有创造力的，在服务设计中，我们应该激发用户、服务设计人员、服务提供人员、管理者等角色的创造力来一起设计这个服务。经过多方共同创造的服务可以帮助服务提供人员和用户更好地交流，也可以提升用户的忠诚度和员工的工作满意度。
笔者很喜欢作者这句话：
<blockquote>“However, creativity is not so much a gift as a process of listening to the ideas “flowing” through one’s head and being prepared to articulate them.”</blockquote>
不是每个人都可以随时迸发灵感，所以服务设计人员需要有优秀的流程控制能力和组织力，去激发大家灵感的产生。

上面我不是建立了一个沙发论坛么，像小米的参与感一样，沙发用户可以给我提意见，例如下一代智能沙发他们需要什么功能。我也可以让送货人员参与到服务设计的过程中，让他们想想在送货这个阶段能有什么精彩的创意，例如开定制的豪华加高大卡车去送货，很拉风的样子。我可以让售后服务人员提供对售后服务的创意，他们可能希望组织一些沙发保养、沙发装饰的活动，请用户来参加学习沙发相关的知识。每个角色都进入了服务设计的流程，最终用户有了参与感、送货人员开上了豪华卡车送货有满足感、售后人员把沙发保养知识传递给了用户有职业成就感。…… 整个服务都越来越好了。

这点我认为用户体验设计应该从服务设计中学习。

现在在用户体验设计中，有用户研究的各种方式在搜集用户的信息和意见，但是很多时候不够完整或成体系。大公司产品设计繁忙的时候，大多是以商业诉求、产品功能需求快速开发，发布产品，再通过用户测试来验证思路。其实更应该在产品设计初期就让用户参与进来。当然，这个改变需要很多巧思和推动力，蛮有趣的，可以思考一下。
<h3>第三点：Sequencing</h3>
服务需要有逻辑、有节奏地视觉化展示出来。

服务是在一段时间内的动态过程，时间线对用户非常重要。

服务的节奏也很重要，会影响用户的情绪，例如在机场排队Check In，等久了用户会不舒服，但是如果通过安检的时候，强迫用户加快通过，用户也会觉得紧张。所以服务设计要考虑好每个环节给用户带来的节奏，做精准的节奏控制、用户情绪控制，把用户与服务互动的每个点连接起来，一起讲一个漂亮的故事。

我又开始卖沙发了。用户开车经过我的店，看到大幅广告，感兴趣，停车，进来，逛，选择几款沙发，和我店里的销售人员讨论，选择好一款，付钱，填写地址，离开，回家收货，等送货人员安装好，使用，上网写评论夸我们家的沙发。…… 这整个流程的节奏都是由我来控制的，所以在这个过程中我会以用户的舒适和愉悦作为服务设计的出发点，把服务脉络清晰表达出来，让用户感知到每个进度。例如用户支付后，我会请他关注我们店的微信公众号，他会收到微信消息告知他沙发的处理状态，他也可以随时通过微信来询问进度；例如我会印刷一个精美的册子，把我们家店所有的消费流程、VIP流程、优惠流程全部可视化出来呈现给用户。我会保证在整个服务过程中，用户知道自己在哪儿，在干什么，做什么操作会对自己有利，且有掌控全局的感觉。用户更开心了，还会口碑传播，我的沙发就越卖越多啦。：）

用户体验设计在交付给业务方或者客户的时候，需要有节奏有逻辑有策略地交付。

这个是很多设计团队或多或少忽略的。

举一个例子，一个视觉设计师，接到一个画icon的任务，他根据客户诉求，研究了100多个竞品，画了200多个形态，尝试了300多种颜色，还做了10多场用户测试，得到了一个他认为最优质的icon。他把这个icon给到客户，客户一看，啥，竟然只有一个icon让我选，不满意！重做！…… 这个时候，应该怎么展示呢？提解决方案，分析商业诉求和客户诉求，竞品分析，过程讲解，用户测试反馈等，应该全套铺垫出这个icon，客户听到这里，看到这个icon，早已喜极而泣…… 说的有点夸张，意思简单说就是，

用户体验设计是为了一个结果，也是为了一个过程。
<h3><a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/01/4501007767ee9637402fe0bfa560e491.jpg"><img class="aligncenter" src="http://image.woshipm.com/wp-files/2016/01/4501007767ee9637402fe0bfa560e491.jpg" alt="移动APP服务设计图" width="536" height="382" /></a>
第四点：Evidencing  无形的服务需要被适时展现出来。</h3>
服务很多时候是在后台默默地进行的，用户无法感知。例如住酒店期间，你的房间被清洁的过程你是不清楚的。很多时候，服务会被设计成让用户无法感知的状态，从而得到一个优质的服务效果。

但是有时无形的服务也可以被展现出来。

书中举的例子是，住酒店，用户得到酒店赠送的印有酒店Logo的小礼物，可以让用户记得在这个酒店的美好居住体验。
我卖沙发我怎么体现无形的服务呢？我会像很多奢侈品广告一样，拍一个视频放网上，把我们制作者认真制作沙发的过程剪辑出来，例如老师傅稳重又熟练地固定一个沙发的零件等。用户看到的是成品，一个沙发，我让他们看到沙发的制作过程的闪光点，把无形的服务体现出来，让用户感知我们家沙发优质的制作工艺，用户就会对沙发的品质更加有信心。于是，我们高品质的沙发就越卖越多了。……

用户体验设计也可以借鉴服务设计的这个思路，无形变有形。

现在很多大型公司例如Google和苹果，会把自己软件界面制作的理念和过程分享出来，让用户看到一个优秀的界面/图标设计是怎样产生的，同时也是一种品牌的宣传。越来越多的设计公司现在也开始透明自己的设计思路、设计流程、设计方法，以展现自己一流的设计实力。希望后续更多的设计团队会做这样的事情，让大家可以学习、借鉴、交流。
<h3>第五点：Holistic     服务设计过程中要注重全局思考。</h3>
服务很多时候是无形的，但是服务会在真实世界中发生。用户会从视觉、听觉、嗅觉、触觉等维度全方位感受服务过程。

<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/01/714aafb77452a8cd34b8997f54e06075.jpg"><img class=" size-full wp-image-10237 aligncenter" src="http://image.woshipm.com/wp-files/2016/01/714aafb77452a8cd34b8997f54e06075.jpg" alt="跨平台UX设计-愉悦开心" width="680" height="319" /></a>

所以做服务设计的时候，我们要保证用户每一次与服务的互动瞬间都被思考到，做到设计最优化。

在服务设计过程中，一定要理解用户有不止一个逻辑/方式去完成一个任务，所以我们要从不同的维度去思考用户使用服务的各个环节，确保没有遗漏的场景和故事。

卖沙发，与沙发所有相关的场景我都会考虑进去，例如坐在沙发上看电视、吃饭、聊天，任何场景。我们在设计过程和服务过程中会关注用户与沙发的任何故事交集。

用户体验设计与服务设计一样，全局思考非常重要。在用户体验设计过程中，我们也是需要照顾到用户的所有感知和情绪，并保证用户的大部分使用场景是流畅有效的。

以上就是笔者对服务设计的初步理解，以及服务设计给我带来的在用户体验设计领域的灵感触发。与大家一起共勉！

以上内容部分来源知乎：http://www.zhihu.com/question/21233822

&nbsp;

来源@25学堂

文章链接：http://www.25xt.com/appdesign/10265.html";s:10:"post_title";s:54:"设计干货，APP服务设计需要注意的五个点";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:156:"%e8%ae%be%e8%ae%a1%e5%b9%b2%e8%b4%a7%ef%bc%8capp%e6%9c%8d%e5%8a%a1%e8%ae%be%e8%ae%a1%e9%9c%80%e8%a6%81%e6%b3%a8%e6%84%8f%e7%9a%84%e4%ba%94%e4%b8%aa%e7%82%b9";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-28 17:12:39";s:17:"post_modified_gmt";s:19:"2016-07-28 09:12:39";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1330";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}