�
�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"2230";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-09-05 16:40:40";s:13:"post_date_gmt";s:19:"2016-09-05 08:40:40";s:12:"post_content";s:8896:"<div class="article-text">

这阵子百度刘超的事情闹得沸沸扬扬的，大家应该都了解了，就不赘述了。如果有不了解的，请自行……google一下（或者bing一下、xx一下……反正别百毒一下）。

那些八卦我不想说，当时看的觉得挺过瘾的，但过瘾了之后呢？什么营养都没有。今天我想透过这个事件，跟大家聊聊：<strong>设计师怎么挑选公司？</strong>
<div>

<img src="http://bbs.uigreat.com/uploadimgs/201609011017000_788899669.jpg" alt="" />
<div>设计师怎么挑选公司？</div>
</div>
求职的时候，不光公司在挑你，你也在挑公司，这是双向的。

那要根据哪些方面来挑选公司呢？常规的例如：看薪水、看福利、看发展空间……这些是所有公司所有岗位的求职者都需要考虑的，咱就不说了，只谈设计师需要关注的几个方面。
<h2>一、看文化</h2>
说到文化，感觉有点儿玄啊，说得直白一点儿：<strong>看设计在这家公司的分量有多大</strong>。

设计在一家公司里的分量，不是老板说重视就能做起来，老板说不重视就被嫌弃的。它并不以老板的个人喜好来决定，而是由这家公司的文化、基因和业务决定的。
<div>

<img src="http://bbs.uigreat.com/uploadimgs/201609011017001_1382258014.jpg" alt="" />
<div>设计在这家公司的分量有多大？</div>
</div>
以BAT三家公司为例：

1、<strong>百度擅长技术，是工程师文化</strong>。工程师会重视设计吗？通常不会，只要别太丑，或者他自己觉得不丑就行了。

2、<strong>阿里擅长电商，是运营+营销文化</strong>。运营和营销会重视设计吗？会，因为好设计能提升购物体验。

但是，最终的效果并不由阿里的设计师控制，因为还有成千上万的店铺装修设计师、商品的摄影师、修图师、视觉设计师的共同参与。

3、<strong>腾讯擅长社交和游戏，是产品经理文化</strong>。产品经理会重视设计吗？会，因为好设计能提升用户体验。

这三家公司的设计师，当然都有牛人，也都有浑水摸鱼的。抛开具体个人的能力，仅仅从概率上来说，<strong>腾讯出好设计师的概率是最大的，阿里次之，而百度出好设计师的概率是最低的</strong>。
<h2>二、看用户</h2>
当一个产品用户量还小的时候，反正用的人不多，也许还能让设计师自由发挥，没准还能因为其风格独特而吸引到一批用户。但用户量稍微大一点的产品，都不太可能容忍你的任性。

<strong>不同产品有不同的目标用户，而目标用户的行为喜好，决定了这个产品的设计风格。</strong>

你负责的产品，它的目标人群是企业用户还是个人用户？是年轻人还是老年人？是男性还是女性？是精英还是草根？……
<div>

<img src="http://bbs.uigreat.com/uploadimgs/201609011017012_24176604.jpg" alt="" />
<div>你的用户画像是怎样的？</div>
</div>
做设计不同于搞艺术，不是你喜欢什么风格，擅长什么风格就做什么风格的。选择什么设计风格，是经过缜密思考后的结果。

以阿里系的几个产品为例：
<ul>
 	<li>采用橘红色的淘宝，要营造便宜很热闹的感觉；</li>
 	<li>采用暗红色的天猫，要营造放心有品质的感觉；</li>
 	<li>采用蓝色的支付宝，要营造专业可信赖的感觉；</li>
 	<li>采用黄色的咸鱼，要营造年轻有活力的感觉；</li>
</ul>
你嫌弃淘宝的设计怎么那么low，比天猫差远了。并不是因为淘宝的设计师就比天猫的差，那是因为定位不同，目标用户不同，你怎么能要求菜市场和大卖场比？你把天猫的设计师调到淘宝去，他也得做得low low的。

设计风格之间，不存在谁就一定比谁好，只有适合或不适合。<strong>你要判断自己是否擅长，能否驾驭这个产品的设计风格。</strong>

比如你面试的公司，要做的是企业员工的内部管理系统，那你把界面设计得再漂亮、图标再精致、动效再酷炫，都没有太大的意义；如果你擅长的是交互，可以通过流程的优化，大幅提升员工的工作效率，那就很有价值了。
<h2>三、看领导</h2>
<h4>1、领导要有点儿审美素质</h4>
百度的刘超之所以被喷得这么厉害，一个很大的槽点是：他作为用户体验总监，自身的审美素质那么差，怎么指导别人工作？

百度内网里第一条评论是这么写的：
<blockquote>这个不需要道歉，水平差，审美低，这是人的属性，没有必要为自己的属性道歉，但是作为UE总监，辞职就可以了。</blockquote>
老罗很适时的出来补刀：
<blockquote>下面就晒晒我们的某牛逼设计师的作品，他老人家曾是百度用户体验部总监[@刘超怒放]的手下，刘超跟别人说他“很普通” 。大家看看这些作品，百度的历史上，可曾有过一个产品的设计如此的优雅简洁和美好吗？还是那句话，千里马最怕落到傻逼手里，牛人出来帮企业做事，最重要的是企业要识货。</blockquote>
不管你是不是千里马，「落在傻逼手里」都是一种悲剧。

说完反面例子，我们来看看几个正面的。比如乔布斯，对设计有很好的品味，会提出非常苛刻的要求；我们公司的老板，是个设计爱好者，每天发微博都会配上一张美图（之前主要是风景，最近是清一色的美女 ^_^）；我们的产品经理，是个谜一样的男子，他对我的设计提过非常多很好的建议。

<strong>你要看领导是否有一定的审美素质。有良好审美的领导会成为你的助力，有糟糕审美的领导会成为你的阻力。</strong>
<div>

<img src="http://bbs.uigreat.com/uploadimgs/201609011017013_1233536633.jpg" alt="" />
<div>领导有一定的审美素质吗？</div>
</div>
我们不要求领导会设计，但他得有起码的审美能力，能分辨什么是好的设计，什么是糟糕的设计。这样你们今后的沟通才会比较顺畅，不会因为领导瞎哔哔瞎指挥而郁闷不已。
<h4>2、怎么判断领导有没有审美素质？</h4>
在面试的时候，你应该会跟直属的上司，主要合作的同事打交道的。他们可能是CEO（CTO）、设计总监（主管/经理）、产品总监（经理）。在他们面试你的同时，你何尝不是在面试他们呢？

从你展示作品时他们的反馈，从他们提的问题，从他们的衣着打扮……你是能看出一些端倪的。如果有机会，你再翻翻他们的微博微信，心里就更有谱了。
<h2>四、看产品</h2>
可能有人会问：我只是去这家公司面试了一次，没有深入了解，不清楚这家公司文化怎么样，用户怎么样，领导怎么样，那我该怎么办呢？<strong>在挑选公司的时候，有一个简单粗暴的方法：看他们的产品</strong>。

你打开手机，数数腾讯的App有几个？微信、QQ肯定跑不掉的。再数数阿里的有几个？支付宝和淘宝应该有，天猫也许有。再数数百度的……

你懂的……

p.s. 2014年的时候有报道称，手机百度的用户量突破了5亿。另一份报道称，2014年中国智能手机用户量首破5亿。这什么概念？国内用智能手机的用户，人人都装了手机百度。你说微信人手一个，我信。手机百度？我从来没见人用过，没听人提过，存在感为零啊！

<strong>好的公司会吸引到好的人才，才会做出好的产品</strong>。如果这家公司的网站、app都很烂，说明这家公司就没有牛人嘛，这家公司就好不到哪里去，你去了也就是沦为他们中的一员。反之，说明这家公司有很多牛人，你能从他们身上的学到很多，对你的成长是很有帮助的。<strong>与牛人一起工作，本身就是一种福利</strong>。
<div>

<img src="http://bbs.uigreat.com/uploadimgs/201609011017024_243126983.jpg" alt="" />
<div>这家公司有牛人吗？</div>
</div>
<h2></h2>
<h2>五、总结</h2>
最后回顾一下设计师挑选公司的几个建议：
<ul>
 	<li>看文化。看设计在这家公司的分量有多大。</li>
 	<li>看用户。目标用户决定了产品的设计风格，看自己是否适合这种设计风格。</li>
 	<li>看领导。看直属上司和主要合作的同事，是否具备一定的审美素质。</li>
 	<li>看产品。有好产品的公司才有牛人，与牛人在一起才会成为牛人。</li>
</ul>
</div>
<div class="well">

文章来源: <strong class="mll">小乖乖老爸</strong>

</div>";s:10:"post_title";s:51:"从百度刘超事件谈设计师怎么挑选公司";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:153:"%e4%bb%8e%e7%99%be%e5%ba%a6%e5%88%98%e8%b6%85%e4%ba%8b%e4%bb%b6%e8%b0%88%e8%ae%be%e8%ae%a1%e5%b8%88%e6%80%8e%e4%b9%88%e6%8c%91%e9%80%89%e5%85%ac%e5%8f%b8";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-09-05 16:40:40";s:17:"post_modified_gmt";s:19:"2016-09-05 08:40:40";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=2230";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}