g̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:775;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2015-03-23 14:57:56";s:13:"post_date_gmt";s:19:"2015-03-23 06:57:56";s:12:"post_content";s:19226:"【CSDN现场报道】以“移动大变局下的抉择”为主题，本年度最受瞩目的移动开发者盛会——“2011中国移动开发者大会”今日在北京国家会议中心隆重开幕。此次大会由CSDN和创新工场联合主办，来自移动领域国内外知名的运营商、平台商、互联网企业、手机终端厂商、应用开发者和投资者等汇聚一堂，探讨移动互联网的发展趋势，共论移动应用大变局下的抉择。

在11月4日举行的主题为“产品与设计”的主题论坛上，百度资深设计师、易平台设计负责人相辉带来主题为“将设计再沉淀”的演讲。

图：百度资深设计师、易平台设计负责人 相辉

相辉认为，设计中的创新需要思考与沉淀，创新的前提是熟知整个固有的甚至旧有的规则和规律。真正的设计大师不会藏拙，相反会故意“露拙”。要完成一个大型产品时，并不是说创意需要多么棒，而是怎么在一个大团队中做好自己的那部分工作。相辉指出，设计流程会面对各种复杂的情况：1.不同的产品目标、不同的流程配置、不同的交付物要求。2.不同的团队、不同的做法、不同的配合方式。3.不同的企业基因、不的项目进行方式、不同的运营方式。在这个过程中，如果配合伙伴不理解你的设计创意，就无法体现出其设计目的。虽然设计的流程是严谨的，但并非一成不变。要将灵活的设计流程，融入到公司的血液中。

相辉总结，要实现一个好的设计需要以下几点：1.设计需要思考与沉淀，做真正的创新。2设计流程是严谨而灵活的，但需要非设计人员有所共识。3.创意仅是一步，而更多的是偏执般的辛苦与打磨。

下面是相辉的演讲实录：

相辉：我先自我介绍一下，我叫相辉，来自于百度，任职于百度移动平台的易平台，暂时负责设计这个团队。在我来之前，我老板叮嘱我说你不能讲太多百度易平台的事，因为你不是这个产品发言人。所以，我绞尽脑汁把我脑子里的一些干货甩出来，想到一个话题叫“将设计再沉淀”。同样在这个会场，本周一的时候我已经做过了分享，就是IMIC的移动互联网大会。

今天我分享的是关于设计的三个故事，我在这个行业7、8年了，从一个最简单的设计师到现在有二三十人的团队负责人，跟大家分享一下作为一线设计师，作为一个美工所做设计的整个过程是什么。从最开始一个最简单的人，到现在负责易平台设计，这个路程是什么。包括很多除了设计团队，非设计人员对待设计会有很多误解，这些误解我也希望在这里跟大家解释一下，因为我会知道中国可能还没有像意大利的文艺复兴，所以中国的人文气息并不是那么浓。

下面就从第一个故事开始，先从建筑设计说起。很走运的是我虽然不是学设计出身的，但是我有一个建筑设计的父亲，他是从事中国古代建筑设计的，相当于是建筑行业里最古老的一个行业。现在都流行拼爹，所以我在设计上也拼一下我的爹。在我家的时候，经常看到的不是电脑设计，而更多看到的是大图板、硫酸纸，在他们那个年代都是这样的。我们之间有很多的隔阂，就像每个孩子跟他的父亲隔阂那样，我们俩之间总是互相鄙视。因为在他们那个年代，一个设计师50岁才刚刚成才，而到70岁的时候，他们才敢称自己是设计师。所以，我说你那个设计层已经跟世界脱钩了，你那个就是风水，中国古代的东西已经完全不适应现在的生活了。直到有一天，有一件事情触动了我，有一天我拿着iPad想刺激他，我说这个叫用户体验，这个叫苹果，这个叫产品设计，比你那个要好多了。没想到我老爹拿过来以后很兴奋，说这个我知道，我说你怎么知道？因为08年苹果并不像现在这么受欢迎。然后他兴冲冲跑到屋子里拿出一摞图纸，就是苹果前门大街的Apple  Store的设计，后来我跟他静下心来聊，说为什么苹果为找到你。

大家可以看到，基本上他的想法是中国的土木结构和苹果大的玻璃，以及他的拉丝金属的结合。相当于说如果在08年，如果不是金融危机的话，很可能这家店就会成为一家最具中国风的店。我说为什么他们会找到你呢？因为苹果非常严谨，他们找的设计公司也非常严谨，但即使严谨也做不出中国风的设计。后来他们发现做出来的设计就像一个外国妞穿着中国旗袍一样，可能有很多东西被忽略了，他们不知道为什么，因为教科书上没有，只能到中国找一位中国口传心授的建筑师说这个事。我父亲就被选上了，我父亲说他写了一个80多页的东西，改完以后普通用户不知道，觉得看上去这个建筑很中国，变得非常有中国气息了。这里有一个柱梁的设计，包括这个是门头的设计。其实我们有时候在看建筑设计的时候，我们会感觉这个建筑整体很漂亮，有很多的柱子，殊不知建筑的每一个部分都是不一样的，正是因为这样，才能衬托出整体。即使我们到苹果店看他的设计，也是不同的。这是各种柱子的设计，也许我们第一眼看上去就是一个柱子，实际上设计中有很多柱子。我就问他，我说你们沟通中有什么困难没有？他说实在说不通，一定要老外放弃拉丝金属。人走过去，建筑跟人的关系非常舒服。在中国的建筑里，大概有很多这类的联系，这类的配合在一起，让你感觉它中国，但是我们不知道，我们不是建筑师，也不是魔法师，我们只知道它中国不中国，它南方、它北方。其实在中国的建筑里，南方和北方都一样，但是比例关系不一样。

后来我说，既然有这些关系，你如何创新呢？他告诉我，你错了，其实当你知道这些关系的时候，你才可以创新，你知道一个木质的东西从哪来，你知道这些比例关系代表什么，只有风水背后所谓的迷信代表什么的时候，你才可以创新，你才能拿到一把开启创新的钥匙，这一点也非常重要。所以，后来我就继续问他，那对于我们来说，有什么样的启发？他说你看年轻人的设计就是藏粕，而大家大师他不用藏粕，而是让用户接受。美国的爵士风味是靠错音唱出来的。

再回到我们移动互联网的设计中，当你设计一个平台的时候，为什么我们看有些时候这个界面很多种颜色，很多种质感，就像电视广告里的999块钱的一个手机，外面很新，但是你却找不到这个设计的生命和内涵，甚至觉得它很土。这是为什么？因为他不知道什么地方该收、什么地方该放，什么地方该去创新，什么地方该去取舍，这是一个非常难的过程。所以说，设计就是这样的，你可能不是说仅仅漂亮，仅仅是很酷的功能，或者仅仅是交互上，你还要考虑设计背后之间的联系。

再举一个例子，前两天我做手机Home的时候，当我拿到第一版就感觉缺乏新颖力，没有那么意思，甚至感觉很粗糙。后来总结出来，他们的每一次点击都是那么符合用户的信息，它的速率是200、300、400毫秒，所以我尝试这种方法，把所有的动画总结出来，交给我们的工程师，用了两周时间，仔细微调每个手上的动作，包括它是否符合用户的信息和用户的心理模型。当你调完的时候，我再拿给用户去看，用户的反应是不错，比以前好了。好在哪？不知道，他肯定不知道，因为这个背后就是设计师的魔法。就是说我们用我们的一些知道的、让用户能感觉很high的，只有设计师知道，用户只能评判这个好、这个不好。这就像建筑设计里很多的比例关系一样，也许你拿到比例关系的时候，你才可以创新。所以，我想在移动互联网这么综合的强调设计的平台上，我们是不是也要考虑设计关系。

设计是需要沉淀于继承，我们必须去思考事物内在的联系，理解他们的奥妙，才能真正创新。比如说在07年底的时候，我经常接到各个老板的电脑，说加入我们吧，我们要做iPhone的团队。但是有所变化，如果现在你问我说，加入我们的吧，我要做一款手机。那么我的思考就是我要设计一款产品，创造一种交互和图形，去承担百度现有产品功能体系，让用户在上面获得更大的价值。这就是认识的变化，当然我并不是说现在我的认识有多高明，但一定强于我08年的时候，这是完全不一样的概念。

第二个故事是关于Yahoo的一个流程，我有幸在一毕业的时候就加入了Yahoo，那时候我是简单的设计师。Yahoo确实做得很棒，你可以在这个平台说看到任何你想知道的事。04年的时候，用户体验是一个很流行的词，大家都很爱说这个东西，但是那会大家真正理解的就很少。我就很不理解，为什么都是设计师，还要分这么多类，我当时完全不理解。而且在中国，确实没有几家能做到这一点。当时，我记得最清楚的就是PM来完成交互，所以，在我一系列个人经历以后，我从04—06年去做WEB  Product，07、08年做软件，08、09年做Android  Phone，2010年到现在做Mobile  Platform。也许四个人没有流程，你可以完成一个小的创业公司，你可以做一个小的网站。但当你做一款Mobile  Platform的时候，如果将你的思想融入进去，落实到笔上的时候，你会发现不会有很好的结果和产品体验，因为设计是工程，设计不是玩创意。

经过这些以后，这么多年了，我才慢慢地去理解每一个职位的精妙之处，这一点非常重要。包括你如果是一个设计师的话，也需要怎么跟这些人去配合。这是以前我们的流程，PM把需求交给UX，UX交给RD，RD去开发。后来发现这样不行，越来越强调体验，越来越强调技术，然后越来越综合了，所以PM和UX和RD，综合起来做开发。大家在一起讨论，像一个创业组一样一同去做事，这种高效率沟通、高效率配合的方式，也许在手机公司还是UX和PM配合。但是有一点重要的是，设计团队你知道了自己该做什么，到了将近大多数公司PM还有RD，可能有时候RD和PM看你的时候，并没有把你当做一个设计师去看的时候，他可能把你当成一个美工。我上个星期还听到这样一句话，相辉，你把这个给我美化一下。在现在的环境里，并不是所有人都理解设计师做什么，当你想把一个产品的UX做好的时候，如果你能配合伙伴不理解的话，这就是一个非常难的事，你会发现很多创意做不下去。比如说我跟RD说我要优化一个体验，RD说无所谓，你做，对我来说就是换一张图，其实优化体验的时候，RD是密不可分的，他必须是我们血液里的一部分，才能很好地理解我们的支持，才能很好地做技术支持。所以，在国内我们的行业里，设计行业仅仅刚刚自发觉醒，但是项目组其实并不知道设计师的作用。

这个仅仅是项目组。公司呢？因为我们知道公司要面对各种新业务，坦诚地说，在百度这样一个搜索公司建起一个手机的设计流程，花费了我很长很长时间去推动这件事，让他们去明白手机应该如何做，头发也掉了不少。所以，当你团队知道，你自己知道的时候，你还需要老板知道，需要公司的血液里融入你设计的流程。什么意思？当我们学自行车的时候，刚开始都是摔跟头，因为我们的基因里还没有骑自行车的技能。但慢慢融入到你身体里之后，你发现不用思考就可以做这件事。所以，当你把事情做好的时候，不光你自己想做好，你的团队也想做好，重要的是公司的血液里也有设计的命脉。当老板去做一个决策的时候，你需要让他知道，要从设计角度想一些设计的战略，这就需要设计师们，设计的领导者们在这个团队里不停地创造自己的文化、体现自己的价值，就像一个推销员一样不停地讲，你才有可能让公司向前推动。因为任何一个行业，任何一个制度都是这样，他赖以生存的制度一定会把控新制度的尽力。如果你的公司不是手机领域的公司，你需要用很强的推动力、感染力以及你的成绩去证明你是正确的。

所以说不同的产品目标，我们需要不同的流程配置、不同的交互。不同的团队、不同的做法，有不同的配合方式。团队里有什么样的人，技术不行怎么办、设计不行怎么办，都有不同的方法。最后一条最重要，不同的企业基因，不同的项目进行方式，不同的运营方式。企业基因不同的时候，你不是说要做好设计，更重要的是要让你的设计成绩让公司高层注意到，让他们确确实实认识到设计的重要性。因为很多老板看完以后说设计太重要了，我要重视设计，但把重视设计跟把设计做好，真正融入到公司里，是绝对的两回事。给一个设计人员高职，后来不管他了，也许最后还是被边缘化，因为这个东西还没有融入到你的血液里，你需要用设计赚钱，你需要让设计给公司带来价值，让老板认识到这一点。

设计的流程是严谨的，但并非一成不变，面对不同的设计一定要有不同的流程。设计人员的配置是非常灵活的，你可以跟不同的项目配合，重要的是，要将灵活的设计流程融入到公司的血脉当中去，让别人明白你为什么做这件事。

第三个故事，关于创意与产品。我们经常会让用户拿到一个产品的时候，会说你这个产品创意真不错。所以，有时候他们会把设计师仅仅理解为一些玩创意的人，但是我做这么长时间以后，我发现这个理解完全有偏颇，以我一个失败的例子给大家展示一下。这是百度框计算的例子，我在2010年的时候接到了这个案子。当你在上面往下看的时候，这仍然是一个搜索框，但是你换一个角度去看搜索框的时候，可以发现一个全新的世界，它是在空中的一个矛盾体，而它旋转的某一瞬间，它既充满了人文感，又充满了逻辑感，还是一个百度的感觉。这是在百度世界大会上，换个角度去看搜索。所以，我当时画了很多产品原型。后来我发现太难了，十几个线上产品，每个产品都有自己的功能倾向，代表了不同任务，不同任务代表不同的交互，不同的交互就有不同的图形，你怎么能去创造一个很好的逻辑把这件事做好？不是玩创意，不是一个所谓的矛盾模型就能做成，而是说一个团队总结这个事情，让别人不得不遵循。

我接到第二个任务就是百度的易平台设计，简单说一下它的概念，它是百度的Mobile 平台，PC时代的需求跟移动互联网时代需求肯定不一样，移动互联网的需求肯定是更加容易沟通。重要的一点，就是说它一定和环境能产生互动，这个就可以带来很多新的契机，所以我们基本上研究了一下，我们觉得要让框计算充满更多的适合移动互联网的框计算，就得有一个新的房计算。这里我仅仅是从设计角度理解这个产品，基本的应用可能当传统应用在手机iPhone使用的时候，对应的是一个。而当你用云联系起来的时候，这些孤岛都联系在一起了，就可以产生新的机会。所以，这就是一个问题，每一个孤岛都有自己的信息，如果你在系统级别能提供这种ATI的话，也是很有自己的希望的。

所以，我们总结了这些产品的一些交互特点，包括功能，在云时代的这些特点，未来发展的方向，它就像工程制图一样，让我们所有团队去明白我们的设计想法，这是不一样的。这是从一个创意完成一个设计，和以工程的角度去看待这件事是完全不同的理念。所以，以前老有人说设计师是玩创意的，你的创意不行，但其实真正做起产品来的时候，设计师跟工程师没什么两样。我敢这么说，在做手机的时候，设计师脑袋上画的不比开发者少。所以说，设计师不是玩创意，设计师是靠体力拼的。待会会给大家看一些图形，这些图形都是我们去年做的。我们找了一些感觉，就是简单，形式是简单的归纳，而内容是丰富的，我们找一些其他产品来设计，放到我们的这个当中去。如果你四个人小团队做一个AS，你可以很好地去完成，十个人做四五十个界面的时候，你可以去完成，但是当你面对一个平台有上百种功能，三四十种交互，甚至上千个界面的时候，你有什么管理办法、工程办法让设备统一起来，让这么多交互设计师在一起做设计看起来整齐划一，这还是一个非常困难的事情，所以需要非常细致的工作。当一个创意要完成大型产品的时候，你需要做的东西太多了，需要一些和你的伙伴在一起共事的人，脚踏实地把你的产品做好，所以可能要做很多事情。

总结一下，设计是严谨的工业，虽然和创意密不可分，爱因斯坦是小提琴家，他当然也是一个科学家。我现在的感觉，虽然我是做图形出身的，但我觉得至多可能占20%，更多的是辛劳与严谨、智慧与方法结合起来。设计需要思考与沉淀，做真正的创新；设计流程是严谨而灵活的，但需要非设计人员同样对此有所共识；设计仅仅是第一步，而更多的则是偏执般的辛苦与打磨。我们作出创意以后，可能这仅仅是我们手机或者其他网页设计的第一步，而更多的是去微调这些产品，看哪一个地方做得不好，去把它打磨好，因为最后手机是靠细节拼的。

说了这么多，想总结一下，真的是非常难的，设计从我最开始04年接触到现在这么多年，真的是非常难的一个考验。但是，我对设计最初的这种热爱，就是因为我觉得恰巧有一种形式能让我表达对生活的理解，这么多苦真的是需要一群很热爱这个行业的人把它做好。这三句话其实都是空话，再细一点，努力就好了，一切仅仅是开始，我们需要怀着对设计的热情热忱与执着，脚踏实地将设计沉淀。谢谢！";s:10:"post_title";s:57:"百度资深设计师相辉：将团队纳入设计流程";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:171:"%e7%99%be%e5%ba%a6%e8%b5%84%e6%b7%b1%e8%ae%be%e8%ae%a1%e5%b8%88%e7%9b%b8%e8%be%89%ef%bc%9a%e5%b0%86%e5%9b%a2%e9%98%9f%e7%ba%b3%e5%85%a5%e8%ae%be%e8%ae%a1%e6%b5%81%e7%a8%8b";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-23 15:05:30";s:17:"post_modified_gmt";s:19:"2016-07-23 07:05:30";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=775";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}