���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:786;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-23 15:32:27";s:13:"post_date_gmt";s:19:"2016-07-23 07:32:27";s:12:"post_content";s:8165:"登陆与注册的边界越来越模糊了，用户要的不是登陆与注册，需要的是因为有账号带来的额外的功能与价值，比如收藏、保存使用记录、存储虚拟平台的虚拟资产的凭证。
<div class="article-content-container">

<img src="http://i.chanpin100.com/146923946658559938" alt="" />
现在每个人手机上都有十几个甚至几十上百个APP，如果所有的APP 都要密码，那要记多少密码。很多人的做法是所有的APP都用同一种密码。但是问题来了，一旦一个APP的密码泄露会导致所有的APP密码都会被泄露，而且绝大部分APP，都把手机号作为最主要登陆凭证，与身份认证。

那么很多人就会根据产品的属性设置几个安全等级不一致的密码，比如关于微信\QQ\支付宝等对安全性要求较高的设置密码复杂一些，对于垂直社交、工具类、娱乐、内容类APP密码可能就很随意。那些图新鲜的APP可能就随意设置一个123456。越来越多的密码，让很多人感觉是一个负担，所以现在有不少产品干脆不短信免密码登陆，如果未注册手机号，第一次系统会自动帮用户创建一个账号，只要手机可以接收短信，就可以不用记任何密码。

登陆与注册的边界越来越模糊了，用户要的不是登陆与注册，需要的是因为有账号带来的额外的功能与价值，比如收藏、保存使用记录、存储虚拟平台的虚拟资产的凭证。

<strong>为了弄明白登陆这个功能，我特意体验了一下百度PC登陆功能</strong>

百度PC的登陆聚合弹窗如图
<div><img title="" src="http://i.chanpin100.com/146923950958691355" alt="" width="500" height="569" align="" /></div>
从上图可以看出百度支持的登陆方式有
1、绑定的手机号、邮箱、用户名+密码登陆

2、第三方账号登陆QQ、微博

3、短信快捷登陆

4、手机百度app扫描二维码登陆

P.S.登陆页有记录登陆账号与密码功能“下次自动登陆”但是不知道时效是多久,我记得QQ记住密码，一个月不用就会失效提醒需要重新输入密码。

1、短信快捷登录流程，因为这是我最常用的登陆方式，脑子实在不够用，真心记不住

1.1输入手机号，输入时会对手机号的第二位数字进行验证，如果不是中国手机号第二位的数字（一般是3、5、等）将会提示手机号格式不对，如果手机号位数≠11位也会验证报错。

1.2如果输入的手机号格式正确会向系统发送验证请求，验证改手机号是否为注册过的手机号，

如果是未注册，将会有一下提醒
<div><img title="" src="http://i.chanpin100.com/146923955124342132" alt="" width="500" height="399" align="" /></div>
3、如果输入的手机号系统验证是已注册或者绑定过的手机号，将直接发送短信验证码，短信文案如下：
“【百度】237925（动态验证码），请在30分钟内填写。”

关于这个短信格式，我觉得百度在这个小细节上还是很用心，把用户最需要看到验证码放在短信的头部，后面括号解释验证码用途，后面是时效性。简洁明了，而且在看信息的时候，短信太长会在手机通知栏滚动时候为了显示完整条信息，前部的数字很快就消失了，还要解开屏幕到短信列表找短信。

这样简洁的短信，用户只需要在手机的通知状态栏就可以读取必要的信息，省去了开屏、打开短信应用、打开列表、打开短信四个步骤。我觉得这个小细节很少走心，为用户想的很周全。

2、通过手机号、邮箱、用户名+密码登陆

2.1输入手机号、邮箱、用户名

2.2输入密码

2.3当输入手机号、邮箱、用户名系统会优先验证改账号的是否存在，

2.3.1如果不存在会提示：
<div><img title="" src="http://i.chanpin100.com/146923959137448630" alt="" width="500" height="391" align="" /></div>
2.3.2账号是存在合法的，输入密码点击登录后系统验证密码，如果密码错误第一次系统提示密码错误，第二次输入密码错误，系统需要进行图形验证码验证，并且提示
<div><img title="" src="http://i.chanpin100.com/146923962359395290" alt="" width="500" height="398" align="" /></div>
输入图形验证码时:
第一次给的图形稍微复杂（变形的英文）输错以后，

第二次会简单一点点（给的是容易识别字母），

第二次输错第三次就给简单清晰的数字验证码

这里的从难道易的图形验证码设计，我不知道是偶然，还产品故意这样设计。如果是设计如此，我觉得产品经理，确实良苦用心，第一保证了安全诉求，也保证了用户体验。如果用户一而再，再而三无法完成验证任务一定会产生挫败感，从而放弃任务，损失用户体验，从而丢失一个忠诚的用户。

3、第三方账号登陆，百度PC版本只支持QQ与新浪微博

拿QQ来做演示

点击QQ图标，系统会自动判断当前电脑有没有登陆QQ账号：

1、如果有系统会弹出一个QQ账号安全登陆授权页，点击当前登陆账号的头像即可登陆。

2、如果当前没有，系统会给出QQ快速安全登陆/注册聚合页
<div><img title="" src="http://i.chanpin100.com/146923968928266979" alt="" width="500" height="329" align="" /></div>
这里有一点以前没有注意到是，这里可以获取QQ  昵称、头像、性别，我印象中，性别很多其他的产品是不可以获取的QQ这个信息的。为什么百度却可以？还是我没有留意？

登陆后会进入百度的个人主页。这里的逻辑与其他产品逻辑一致没有看到闪光点。

4、通过手机百度APP扫描二维码登陆

直接进入的是百度的首页而不是个人主页，这里一个小的跳转逻辑，与其他第三方账号登陆逻辑完全不一样。

第三方账号登陆，一般都是没有补齐资料，绑定手机后，所以产品设计会引导用户去主页补充资料绑定手机。如果已经有了账号就没有必要去补齐资料自然是要跳转到用户需要搜索主页。

5、找回密码，“忘记密码”入口为“登陆遇到问题”

找回密码的流程为：

1、输入用户名/邮箱/手机号  +图片验证码

2、通过绑定的手机/邮箱   发送验证码验证身份

3、设置新的密码（会显示密码强度进度条），新密码不可以与原密码一致（这点我觉得有问题，为什么不可以，如果是因为密码一致说明我没有忘记原密码啊）

4、设置新密码成功后，点击直接登录就可以进入登录后的页面（无需回到登录注册聚合页面，重新输入账号与密码），这一点很让人欣慰，都是一些小细节，每省去一个步骤，用户体验就好很多。

5、如果找回密码的工具都失效“（手机、邮箱、密保”）可以进行人工申诉

进入人工申诉入口，必须使用百度手机客户端，扫面二维码
<div><img src="http://i.chanpin100.com/146923978871612442" alt="" /></div>
扫二维码后的页面还是一个还是一个找回密码的聚合页面，流程与PC流程一致，没有人工申诉的渠道（有一个百度的客服电话，但是指引可以通过人工客服找回）明显这个人工申诉做的是敷衍用户。

就这么一个小小的登陆，其实暗藏不少需要像我这种初级产品狗学习的地方。今天我更新了滴滴出行最新版本V4.3.12-144，此次改版的两个亮点：

1、引导页改为了引导视频，视频拍的很有范，这样的引导方式越来越成为主流，视频给人的场景代入感远比，图片文字要强很多倍。

2、登陆方式由密码改为单一的手机号+短信验证码，这个设计对我而言，省去了我每次找回密码的繁琐流程，一步到位。免密登陆大势所趋，我相信信任的成本总比担心的成本要低多。

</div>";s:10:"post_title";s:33:"一个密码引发的产品思考";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:99:"%e4%b8%80%e4%b8%aa%e5%af%86%e7%a0%81%e5%bc%95%e5%8f%91%e7%9a%84%e4%ba%a7%e5%93%81%e6%80%9d%e8%80%83";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-23 15:32:27";s:17:"post_modified_gmt";s:19:"2016-07-23 07:32:27";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=786";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}