���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1675";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-08-04 16:25:15";s:13:"post_date_gmt";s:19:"2016-08-04 08:25:15";s:12:"post_content";s:7612:"<blockquote>本文主要向大家介绍笔者关于互联网产品盈利模式设计的思考，在如何设计互联网产品盈利模式和如何深入分析一个互联网产品盈利模式等问题上提出个人的鄙见，希望能给大家的学习带来启发和帮助。</blockquote>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/08/%E4%BA%92%E8%81%94%E7%BD%91%E4%BA%A7%E5%93%81%E7%9B%88%E5%88%A9%E6%A8%A1%E5%BC%8F%E8%AE%BE%E8%AE%A1%E6%80%9D%E8%80%83-1024x576.png"><img class="attachment-large  aligncenter" src="http://image.woshipm.com/wp-files/2016/08/%E4%BA%92%E8%81%94%E7%BD%91%E4%BA%A7%E5%93%81%E7%9B%88%E5%88%A9%E6%A8%A1%E5%BC%8F%E8%AE%BE%E8%AE%A1%E6%80%9D%E8%80%83-1024x576.png" alt="互联网产品盈利模式设计思考" width="720" height="405" data-original="http://image.woshipm.com/wp-files/2016/08/互联网产品盈利模式设计思考-1024x576.png" /></a>
<h2>盈利模式（Profit Model）</h2>
指按照利益相关者划分的企业的收入结构、成本结构以及相应的目标利润。

通俗来说，盈利模式就是企业赚钱的渠道。有效的盈利模式分析有利于企业从既有的单一赚取利润的思维定式中解脱出来，寻求更为多元的利润来源方案。那么互联网产品在进行盈利模式设计时首要考虑的是什么呢？是用户、是顾客。互联网产品盈利模式设计的首要原则就是“以用户为导向，以利润为中心”。

当今社会正在倡导“互联网+”思维，其首要思维就是用户思维，只有牢牢抓住用户心理，解决用户痛点，从而为用户创造价值的产品才是好产品。因此，互联网产品盈利模式设计应以用户价值为核心，并需要在市场细分和客户偏好分析的基础上，通过有效的定位来抓住高利润的客户群，实现稳定盈利。
<h2>Adrian J.Slywtzky盈利模式设计要素</h2>
目前，关于互联网产品的盈利模式设计在学术研究上没有达成一致性的结论，各家众说纷纭，笔者最为认可的是Adrian J.Slywtzky提出的从盈利模式设计要素角度进行的分析方法。其遵循“以用户为导向，以利润为中心”的原则，将盈利模式设计要素概述为：业务范围、客户选择、价值获取、战略控制。

笔者认为此四要素环环相扣，紧密相连，如产品的业务范围是一开始就确定的，但后期的优化调整应该适应于核心客户的需求、价值获取途径、以及企业的战略控制；客户选择决定了价值获取的方式，价值获取方式必须与客户的特点相适应，而客户的选择又取决于业务范围；战略控制是由客户选择和价值获取来决定的，而战略控制又在一定程度上决定了业务范围的未来发展。

<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/08/%E7%9B%88%E5%88%A9%E6%A8%A1%E5%BC%8F%E8%AE%BE%E8%AE%A1%E8%A6%81%E7%B4%A0.png"><img class="attachment-large  aligncenter" src="http://image.woshipm.com/wp-files/2016/08/%E7%9B%88%E5%88%A9%E6%A8%A1%E5%BC%8F%E8%AE%BE%E8%AE%A1%E8%A6%81%E7%B4%A0.png" alt="盈利模式设计要素" width="708" height="367" data-original="http://image.woshipm.com/wp-files/2016/08/盈利模式设计要素.png" /></a>

盈利模式设计要素
<h2>网易云音乐盈利模式分析</h2>
网易云音乐是一款互联网音乐产品，以歌曲个性化推荐、歌单、独家自制DJ节目、音乐社区分享和音乐指纹为核心功能，主打发现“好音乐”和分享“好音乐”。其对用户来说，主要是让寻找自己喜欢的音乐变得简单，让分享喜欢的音乐变成一种享受。

网易云音乐是2013年4月23日正式发布的，赶了互联网音乐产品的“晚集”，在QQ音乐、酷狗、酷我等早期音乐产品几乎垄断的格局下，它依旧能实现快速增长，在2015年7月用户数量过亿，到2016年7月用户数量突破2亿，这足以说明其是一款好产品。

<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/08/banner-aos.png"><img class="attachment-large size-large aligncenter" src="http://image.woshipm.com/wp-files/2016/08/banner-aos.png" alt="banner-aos" width="371" height="440" data-original="http://image.woshipm.com/wp-files/2016/08/banner-aos.png" /></a>

网易云音乐

接下来我们将从盈利设计要素的角度分析网易云音乐这款优秀的互联网音乐产品的盈利模式。

<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/08/%E7%BD%91%E6%98%93%E4%BA%91%E9%9F%B3%E4%B9%90%E7%9B%88%E5%88%A9%E6%A8%A1%E5%BC%8F%E5%88%86%E6%9E%902-702x1024.png"><img class="attachment-large  aligncenter" src="http://image.woshipm.com/wp-files/2016/08/%E7%BD%91%E6%98%93%E4%BA%91%E9%9F%B3%E4%B9%90%E7%9B%88%E5%88%A9%E6%A8%A1%E5%BC%8F%E5%88%86%E6%9E%902-702x1024.png" alt="网易云音乐盈利模式分析2" width="669" height="976" data-original="http://image.woshipm.com/wp-files/2016/08/网易云音乐盈利模式分析2-702x1024.png" /></a>

网易云音乐盈利模式分析

<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/08/%E7%BD%91%E6%98%93%E4%BA%91%E9%9F%B3%E4%B9%90%E7%8B%AC%E7%AB%8B%E9%9F%B3%E4%B9%90%E4%BA%BA.png"><img class="attachment-large  aligncenter" src="http://image.woshipm.com/wp-files/2016/08/%E7%BD%91%E6%98%93%E4%BA%91%E9%9F%B3%E4%B9%90%E7%8B%AC%E7%AB%8B%E9%9F%B3%E4%B9%90%E4%BA%BA.png" alt="网易云音乐独立音乐人" width="655" height="378" data-original="http://image.woshipm.com/wp-files/2016/08/网易云音乐独立音乐人.png" /></a>

网易音乐人

网易云音乐从一开始就定义为互联网音乐产品，其核心价值在于为用户提供优质音乐聆听与分享的解决方案，业务范围也就此锁定在了音乐及相关产品和服务上。

在客户选择方面，年轻一代才有在互联网听音乐的习惯，也才有对音乐质量的追求。中老年人一是没有在互联网听音乐的习惯，这一习惯也很难培养；二是中老年人对音乐质量的识别度不高，对音乐质量没有太多要求。客户选择为年轻人，这个在业务范围锁定为互联网音乐就相应确定了的。

再来就是价值获取，这一点和盈利是直接相关的，网易云音乐是在社会倡导保护知识产权、人们的版权意识萌芽的时机下诞生的，年轻人听优质音乐的需要就势必衍生出购买正版优质音乐的需求，因此网易云音乐选择的核心盈利模式是销售音乐数据和提供免费下载付费音乐的增值服务。

至于战略控制，这里的战略控制是在盈利模式设计分析的范畴下讨论的，是狭义的，只指如何从战略层面保护利润流。版权意识的增强不仅仅使年轻人产生购买正版音乐的需求，也加剧了他们听音乐的成本，同时也使得互联网音乐平台靠提供海量音乐存活的老路已经走到了穷途末路（把所有音乐的版权买下是不经济的）。这时精确的音乐推荐，花最少的钱购买最有价值的音乐的版权和丰富音乐分享、增加听音乐的附加值就显得尤为重要，因此网易云音乐要保护利润流就必须加强歌曲的精准推荐，并积极收集用户希望收入的歌曲和加强音乐分享体验。
<h2>盈利</h2>
通过业务范围、客户选择、价值获取、战略控制这四个要素分析下来，能让你清楚地把握一款互联网产品的盈利模式，以及理解它为什么选择这样的盈利模式。";s:10:"post_title";s:39:"互联网产品盈利模式设计思考";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:117:"%e4%ba%92%e8%81%94%e7%bd%91%e4%ba%a7%e5%93%81%e7%9b%88%e5%88%a9%e6%a8%a1%e5%bc%8f%e8%ae%be%e8%ae%a1%e6%80%9d%e8%80%83";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-04 16:25:15";s:17:"post_modified_gmt";s:19:"2016-08-04 08:25:15";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1675";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}