5�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1677";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-08-04 16:26:21";s:13:"post_date_gmt";s:19:"2016-08-04 08:26:21";s:12:"post_content";s:6981:"<blockquote>时代在变，用户的行为习惯也在不断变化，如何通过用户浏览、搜索、点击率、停留时间和滚动等行为特征，跟踪这些行为背后消费者们的心理需求，并促进用户进行购买决策，将成为日后电商产品设计的重中之重。</blockquote>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/08/dianahsgpingdd.jpg"><img class="size-full wp-image-386051 aligncenter" src="http://image.woshipm.com/wp-files/2016/08/dianahsgpingdd.jpg" sizes="(max-width: 680px) 100vw, 680px" srcset="http://www.woshipm.com/wp-content/uploads/2016/08/dianahsgpingdd.jpg 680x, http://www.woshipm.com/wp-content/uploads/2016/08/dianahsgpingdd-404x190.jpg 404x" alt="dianahsgpingdd" width="680" height="320" data-original="http://image.woshipm.com/wp-files/2016/08/dianahsgpingdd.jpg" /></a>

近几年来，随着网购用户的不断增长，越来越多的用户习惯将购买过程转移到线上，牛奶君从国内外各种资源及个人的用户体验结合，将接触的各种不同类型的用户行为总结为以下五类，在这篇文章中，我将讨论这些类型的各自用户行为及其相应的交互设计解决方法。
<h2>犹豫不决型</h2>
犹豫不决型用户是电商网站里最常见的一种，“加而不买”是这类用户的特性，“这有如此多我想买，但却不能或不应该马上买的东西”是这类型用户的内心独白，在购物车的每一件商品也许都是她们花了很长时间和精力认真挑选出来的。但问题是，她们从来不购买这些东西。

网上商城的购物车与现实生活里超市的购物车不同，超市里的购物车往往促使你会想着哪些才是你最后真正要埋单的，你不可能“肆无忌惮”地往购物车里添加各种你想买而买不起的商品。但是在线购物车却不同，它增强了拥有感，因为用户可以随时添加和移除商品，即使用户关闭了网页，这些商品仍然保留在购物车内。她可以随时打开购物车并查看她的虚拟商品。这让她们觉得自己几乎拥有了这些商品。

因此，在交互设计中，我们要采取鼓励的方式促使用户完成购买行为，当她访问商城时，将她购物车里的一到两种商品打折，并用一个弹出窗口提醒她回来，“今天是您的幸运日！您选择的商品正在打折”这种意想不到的私人打折，有或者如某东的购物车里“购物车中有X件商品已降价，快去看看”，“比加入时降低XX元”，“购满XX元，即可免运费”等。这给消费者一种“老天希望我买下这件商品”的感觉。
<h2>品牌导向型</h2>
在现实生活中有“追星族”的明星效应，在网购中有一种特殊的用户，以品牌为导向，这类用户唯一关心的是大家谈论的最新潮流。她的购买决策完全取决于一款产品是否被可以称的上为顶级品牌。这类用户多为年轻人，她的关注点在于产品的情感属性，如颜色，配饰和吸引人的图片等。

她们想的是如何切换它们的颜色，如何可以添加的不同配饰和各类品牌商品的搭配。这类型的年轻冲动买家其购买的出发点是情绪唤起，也许她尝试了各种不同的颜色和配饰来想象拥有这些商品的感觉，对她们而言，价格、实用性、易用性等理性因素都是其次，感性的自我满足才是她们购买东西的来源。

因此，在交互设计中，成功的商品页面应该最大程度的调动消费者的情绪，并使其兴奋。为了促进冲动型消费，商品信息应该隐藏在一个标签下（只在“被需要”时展开，而不主动展示给访问者），用多彩迷人的图片，添加现时的流行元素刺激来激发情绪。从而使年轻冲动型买家仅凭感觉直接购买你的产品，而不是阅读详细的商品信息页面后再次考虑是否购买。
<h2>理性消费型</h2>
与品牌导向型用户完全不同的是理性消费型，不买最好最贵的，只买性价比最高的，她们买东西一般分两步：

第一步排除不符合她们心中的标准选项，通常是价格。

第二步用成本效益分析来挑选剩下的商品。理性消费型用户在决策过程中习惯客观观察和实际分析。

她们为自己的购买行为寻找合理的理由。她们不会仅因为一件已有的陈旧的但还能正常使用的商品而而更换新款式新功能的同类商品，她们需要一个坚实的理由来采取行动，主观想法和情绪完全不会出现在她们的购买决策中。

因此，在交互设计中，必须要提供用于用户评估决策的所有信息来支持她们的决策。例如，当用户购买3C商品时，提供不同产品间详细的功能比对信息（尺寸大小、重量、颜色、价格等），这些比对信息会促使用户觉得自己正做着最明智的决定。
<h2>完美主义型</h2>
完美主义型用户其特点是“挑剔”，她们执着于在所有搜索罗列的商品中作出完全正确的决策。她可能从头到尾浏览了列出的每个商品，只在感到足够满意时才做出选择，但也可能看完了没感到满意所以不选择任何一个。

无论是价值10000元的手表还是5元的指甲剪，完美主义型用户都要看完所有搜索罗列的商品之后才能做出购买决定。但实际上大多数时候她又无法承受没买任何东西的焦虑，当面临大量的选择时，完美主义者不可避免地感到挫败，没买任何东西就离开了。

因此，在交互设计中，商城必须明智地限制给这类用户提供商品的数量，用过滤分页的做法，限制每行或每列只显示固定数量的商品，并提供一个默认或“建议”商品，促使完美主义型用户更精确的选择想要的商品。
<h2>知足常乐型</h2>
知足常乐者与完美主义者恰恰相反：这类用户选择了能满足她们最低或当前需求的第一个产品。我们观察到这些用户从网页顶端开始往下滑动，在找到匹配的商品后立即停止滑动并购买该商品，不管别的选择有多少。

对知足者来说，时间就是金钱。她不想浪费几个小时来寻找最好的选择。她宁愿利用这段时间来做别的事情。所以当她的要求被满足时就立即采取行动。这不意味着她能随意被满足；她的标准可能非常高，可她一旦找到了一个符合标准的选择，她就满足了。

因此，在交互设计中，筛选功能很关键，让她直接跳到最符合她需求的选择。这与百货商店里的售货员是类似的，售货员们往往对她说“请告诉我你想要的颜色和尺寸，我去拿给你”。零售网站或App则可能也会通过品牌，用途和情感（浪漫，性感或趣味）来摆放她们的商品。";s:10:"post_title";s:46:"电商平台5种典型用户及其交互策略";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:136:"%e7%94%b5%e5%95%86%e5%b9%b3%e5%8f%b05%e7%a7%8d%e5%85%b8%e5%9e%8b%e7%94%a8%e6%88%b7%e5%8f%8a%e5%85%b6%e4%ba%a4%e4%ba%92%e7%ad%96%e7%95%a5";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-04 16:26:21";s:17:"post_modified_gmt";s:19:"2016-08-04 08:26:21";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1677";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}