�A�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1044";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-26 18:51:20";s:13:"post_date_gmt";s:19:"2016-07-26 10:51:20";s:12:"post_content";s:11757:"<div class="entry-thumb"><img class="attachment-codilight_lte_codilight_lite_single_medium size-codilight_lte_codilight_lite_single_medium wp-post-image" src="http://ddc.dianrong.com/wp-content/uploads/2016/07/helm_shot248.jpg" sizes="(max-width: 800px) 100vw, 800px" srcset="http://ddc.dianrong.com/wp-content/uploads/2016/07/helm_shot248.jpg 800x, http://ddc.dianrong.com/wp-content/uploads/2016/07/helm_shot248-150x113.jpg 150x, http://ddc.dianrong.com/wp-content/uploads/2016/07/helm_shot248-480x360.jpg 480x" alt="helm_shot248" width="800" height="600" /></div>
<div class="entry-content">
<h3><strong>四、着陆页由哪些内容组成？</strong></h3>
着陆页常常会用各式各样的创意去展现其内容，以吸引不同的目标群体。可以说着陆页根本不可能有统一的主题或结构，不过，着陆页需要提供的内容还是能够找出一些规律。页面的大小、包含多少模块、用了哪些视觉元素，这些都不是着陆页最重要的考虑因素，最重要的是如何让着陆页提供“有价值”的信息。

1

一般来说一个着陆页需要包含以下内容：

1）讲清楚你所展示的是什么（产品、服务、活动等），并提供刺激用户操作的元素。从用户的角度来说，他们要知道你能给他们提供哪些好处，即使没有非常具体的细节，至少用户能清楚地知道这些好处是什么并且这些好处确实有用。此时页面就可以同步地提供明显并且方便进一步查看或操作的按钮、表格填写、订阅服务等页面元素，吸引用户去点击。

2）口碑及信任感。人们总是倾向于相信那些被其他用户推荐的东西，也认为那些信息更有关注的价值。因此在着陆页上提供一些用户评价、社交网络的粉丝规模、获奖情况和资质证书等信息，可以让访问者产生更好的印象，从而更有可能进入下一步。

3）展现产品或服务的最主要的特征或卖点。这部分信息具有补充说明的作用，来丰富产品的展示和呈现。它能让用户得知更多细节，比如产品或服务所能达到的效用和应用的技术、能从哪些方面改善我的生活等。

要注意的是，这些信息会让着陆页变得更庞大，所以在提供这些细节信息是要通盘考虑整个网站的信息规划，而不是仅仅把信息都一股脑儿地堆到着陆页上去。

<img class="size-full wp-image-761 aligncenter" src="http://ddc.dianrong.com/wp-content/uploads/2016/07/5-1.jpg" sizes="(max-width: 800px) 100vw, 800px" srcset="http://ddc.dianrong.com/wp-content/uploads/2016/07/5-1.jpg 800x, http://ddc.dianrong.com/wp-content/uploads/2016/07/5-1-57x150.jpg 57x, http://ddc.dianrong.com/wp-content/uploads/2016/07/5-1-182x480.jpg 182x" alt="5" width="800" height="2112" />
<h6>图1</h6>
1

上图的案例来自Sergy Valiukh的着陆页设计，它提供了上文提到的所有内容元素。首先页面是一个有机食物商店的推广网页，包含了一些基本信息，例如商店名称、产品、服务的卖点、引导用户操作的各类按钮以及顾客评价的展示。设计者让整个页面信息很丰富，同时也不会过于复杂和冗长，有吸引力但也不会过于激进。

在滚动页面浏览时设计者还加入了动画效果，让整个浏览过程的体验更为丰富，各个视觉元素之间组成了页面的整体视觉主题，让重要信息更为突出。

<img class="size-full wp-image-763 aligncenter" src="http://ddc.dianrong.com/wp-content/uploads/2016/07/6.gif" alt="6" width="800" height="600" />
<h6>图2</h6>
1
<h3><strong>五、从哪些方面着手能让着陆页更有效？</strong></h3>
<h4>1</h4>
<h4><strong>1）目标用户分析</strong></h4>
每个着陆页的设计都离不开对用户群体的研究和分析。着陆页不是一个单纯的艺术品，而是市场推广和展示策略的融合。设计者必须将市场营销的目标和用户群体的特性牢记在心，把着陆页当做连接目标消费者和产品之间的桥梁。一个网页想要有高转化率，设计必须要事先进行对目标用户喜好、能力、心态的分析。不过要注意的是，没有一个着陆页可以让所有用户都喜欢，即便是最成功的商业运营也不会让每个人都满意。

1
<h4><strong>2）市场分析和竞争对手分析</strong></h4>
在设计着陆页之前你还需要分析现有竞争对手的策略。此前在文章《如何将广告策略运用到网页和App设计》里我们就讨论过如何将UX/UI设计和广告结合起来，其中的一个观点就是鼓励设计师去做竞品分析。着陆页是市场营销中的重要一环，市场分析也能帮助你产出更好的设计成果。更好地了解你的竞争对手，你才能少走弯路并且不让你的产品淹没在其它相似的万千产品中。

1
<h4><strong>3）精简你的文案</strong></h4>
广告界大咖David Ogilvy说过“每一个字都要斤斤计较”，在你设计着陆页的时候必须牢记这个简单的道理。必须经过研究和测试才能决定用多少字的文案去展示信息，因为这些字直接决定了用户会不会买你的账。

不过话说回来，并不是每一个着陆页都要保持极少的文字字数。比如当你要宣传的是一个著名的公司或产品时，少量的文字就足以说清楚并且吸引用户进行下一步操作，然而，如果你要推广的是一个全新的产品或服务，那么则有必要多花些文字去让访问者了解更多。

<img class="size-full wp-image-765 aligncenter" src="http://ddc.dianrong.com/wp-content/uploads/2016/07/7-1.png" sizes="(max-width: 800px) 100vw, 800px" srcset="http://ddc.dianrong.com/wp-content/uploads/2016/07/7-1.png 800x, http://ddc.dianrong.com/wp-content/uploads/2016/07/7-1-41x150.png 41x" alt="7" width="800" height="2921" />
<h6>图3</h6>
1

上图展示的是Polina设计的一个公益组织的网页，页面中谨慎地使用了信息文字，辅以视觉图片，让用户得以了解俱乐部的活动。

1
<h4><strong>4）品牌元素</strong></h4>
很明显，着陆页应该着重展示logo、主题色、字体、标语和其它身份特征元素，你必须在你所呈现的产品、服务、活动和公司及其品牌视觉语言之间建立紧密的关系，这就提高了一般营销策略的效率。

1
<h4><strong>5）视觉设计</strong></h4>
在此前的文章里我们讨论过在界面中的视觉设计，人们通常对视觉元素更敏感，也更容易识别和认知视觉元素，即使它们是高度抽象的图片。在大多数情况下，人们认知和处理如图标和插图等图像化的内容比处理文字更快。大部分用户出于本能，也更容易被视觉元素所吸引。在上文列出的插图中，页面都提供了很有吸引力、具有信息量的图形化设计，它们让着陆页更吸引眼球，在访问者快速浏览时，能让他们产生审美的愉悦，同时减少阅读大段文字的时间。

1
<h4><strong>6）找到卖点并吸引用户操作</strong></h4>
着陆页的设计有两个关键因素。USP (Unique Selling Point) 独特的产品卖点，是顾客最关注的产品特性和优势。CTA(Call to Action) 是鼓励用户进行下一步操作的入口，你通过它们来实现用户的转化。有效的着陆页能够快速的传达卖点，并用醒目的、关于CTA的设计解决方案以及技术都值得用另开一篇文章，我们会在TubikBlog的下篇文章进行讨论。

1
<h4><strong>7）减少加载时间</strong></h4>
加载时间的长短是影响设计效果重要的元素之一。用户不喜欢浪费时间，同样也不会在为了看一个着陆页而等待太久。所以千万别让访问者等待，你要在设计着陆页的时候就要考虑设计方案是否会导致加载时间的延长。

1
<h4><strong>8）视频展示</strong></h4>
动态效果是一种很好的产品呈现方式，还能够避免用户花费精力看文字。视频能被运用在任何页面场景里，让网页更为动感和有趣。然而必须记住，视频很容易大大延长页面的加载时间，所以你得好好设计视频，让它们值得用户等待更多的加载时间。

1
<h4><strong>9）响应式设计</strong></h4>
几年前的《Think with Google》一文中提到了“响应式设计”这个有趣的概念，也从统计学的角度验证了响应式设计在网页设计中的重要性：
<ul class="list-paddingleft-2">
 	<li>61%的用户表示，如果他们在手机浏览网页时无法快速找到目标信息，他们就会立刻放弃，去访问其它站点。</li>
 	<li>79%的用户遇到不喜欢的页面，会返回重新搜索其它站点。</li>
 	<li>50%的用户如果一个服务在手机网页上很难浏览或操作，即便这个服务在功能上再成功，他们也不愿意经常使用。</li>
</ul>
有可能上面这些统计数字在今天会变得更高，因为越来越多的用户每天都使用移动设备，所以千万别忽略了着陆页在手机等移动设备上的显示效果。

1
<h4><strong>10）减少让用户分心的元素</strong></h4>
前文已经提过，着陆页应该让用户能够保持专注力，所以你得去除页面上那些会让用户分心的信息，并加强会影响转化效率的关键信息的展示。越少的额外链接越好，应该以最容易被注意到的方式展现引导用户进行下一步操作的元素，以便用户能够找到并完成他们的操作任务。

<img class="size-full wp-image-767 aligncenter" src="http://ddc.dianrong.com/wp-content/uploads/2016/07/8-2.png" sizes="(max-width: 800px) 100vw, 800px" srcset="http://ddc.dianrong.com/wp-content/uploads/2016/07/8-2.png 800x, http://ddc.dianrong.com/wp-content/uploads/2016/07/8-2-150x113.png 150x, http://ddc.dianrong.com/wp-content/uploads/2016/07/8-2-480x360.png 480x" alt="8" width="800" height="600" />
<h6>图4</h6>
1

上图为Ludmila Shevchenko设计的着陆页，目标是展现SwifyBeaver开发的MAC应用程序，在页面上设计元素十分简洁，用户的注意力都会集中在标题文字上，而标题下方即为申请免费试用的按钮，整个页面没有任何多余或无用的链接，仅仅提供了必要的点击入口，让用户不会分心从而更有可能被转化。

1
<h4><strong>六、如何测试你的着陆页？</strong></h4>
在早期的文章《设计师基本指南，什么该做什么不该做》里我们列举了不少实际案例来说明测试的重要性。

可用性测试方面的专家在不断的实践中已经证明，任何一个项目都不是完全客观的，尤其是那些长期的项目。设计师也并不能奇迹般第让那些产品的使用者一下子变成对产品了如指掌的专家。因此，仅仅只是创造概念还不够，你还需要用实践和数据来改进你的设计。

David Ogilvy还说过一句名言：在广告里最重要的一个词是“测试”，只要你坚持去做测试，你的广告就会变得越来越好。对着陆页进行测试，能更好的了解用户行为，并改善着陆页上那些无效又不友好的设计。

在设计着陆页的实际过程中，不少研究已经能证明，一点点微小的改进，例如操作按钮的颜色、公司LOGO的位置，都可能提升页面效果，而标题文案、辅助说明的改进，则可能会大大提高你的转化率。收集用户统计数据并进行分析，是让设计变得更有效的途径，同样也能让你的用户转化和营销策略更为成功。

</div>";s:10:"post_title";s:48:"如何设计Landing Page以迅速提升转化率";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:120:"%e5%a6%82%e4%bd%95%e8%ae%be%e8%ae%a1landing-page%e4%bb%a5%e8%bf%85%e9%80%9f%e6%8f%90%e5%8d%87%e8%bd%ac%e5%8c%96%e7%8e%87";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-26 18:51:20";s:17:"post_modified_gmt";s:19:"2016-07-26 10:51:20";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1044";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}