tːZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1310;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-28 16:27:21";s:13:"post_date_gmt";s:19:"2016-07-28 08:27:21";s:12:"post_content";s:7449:"<img src="http://img.zcool.cn/community/02c67a57996a030000018c1b5182e6.png" />

随着人们日益增长的高标准需求，使得各行各业对于“高逼格”、“高大上”的讨论愈来愈普遍！同时也使得设计得以更加重视，不再满足于传达信息，更要求达到有<strong>品牌感、有内涵、有格调</strong>的视觉效果！

&nbsp;

在谈到产品“逼格”之前，先引用“唐纳德·诺曼”的一句关于产品的描述：

“产品必须是吸引人的，有效的可理解的，令人快乐和有趣的。”

&nbsp;

诚然，好的产品必然是针对性的服务于它的用户，100%为它的用户群进行合理的设计，所以对于一个产品而言，是否具有“高逼格”，不仅仅在于视觉美观与否，还应该拥有更好的用户体验，更实用的产品功能，还应该具有产品“独特的个性”。本文仅从视觉层面探讨产品的独特“高逼格”！

&nbsp;

外观视觉永远是用户接触一个产品一个物体第一步的过程，提升产品的视觉格调对用户能起到更好的吸引、提升用户对产品的喜爱程度，也能够升华产品的内涵和文化品牌感！但是却也不能一味的追求超脱于产品目前本身定位的视觉效果，例如一个新产品刚起步，受众面还很小，此时一味的把产品打造成千万级用户类型的“高逼格”产品，只会显得产品本身空洞空虚，没有足够的数据作为背后支撑，那这个设计必然是考虑不全，甚至是失败的，所以合理的追求产品目前定位进行设计，逐步提升产品的视觉内涵，才是更为重要的。

&nbsp;

说了很多理论的东西，下面介绍一些个人对于合理的“高逼格”视觉设计的看法。

<strong>一、“逼格”是有趣</strong>

对于一个产品从最初定位到落案执行，必然是已经深思熟虑的结果，好的产品必然是有趣能吸引用户的，而最终到设计师手上，也必须通过视觉来展现这一有趣的效果！

<img src="http://img.zcool.cn/community/02675357996a040000012e7eeb508d.png" />

（图片来源于网络－我的天气 app截图）

&nbsp;

“我的天气”app是我见过的天气类设计中最有趣味性的，它的有趣不全在于好玩，而是它并没有运用大块的背景来展示天气的变化，而是把设计集中在精致的icon上，而且针对于不同的主题，设计了不同风格icon，让视觉更贴于生活化，同时精致的排版以及个性的字体使用加上舒心的色彩运用，呈现了一个“特别”的天气预报界面！

<img src="http://img.zcool.cn/community/029fd157996a040000018c1bdbb8e6.png" />

（图片来源于网络－其他主题设计截图）

&nbsp;

<strong> </strong>

<strong>二、“逼格”是呼吸自然</strong>

<strong> </strong>

看一个设计是否舒服，其一要看色彩，其二在于留白，欣赏一个设计就像在呼吸一口空气，污浊的空气必然会让人屏住呼吸，同样设计的臃肿也会让人心情压抑，所以设计留白是必不可缺的。

&nbsp;

<strong> </strong>

<img src="http://img.zcool.cn/community/027e7157996a050000012e7e287888.jpeg" />

(图片来源于网络)

这个web设计在留白上做到了很合理，主体产品的文案合理排版，没有过多的文字描述，也没有过多的背景铺垫，简约的背景处理，重点突出产品本身，空间上留有更多的区域，不仅没有浪费，反而更好的体现了产品，整体阅读下来呼吸顺畅，自然舒适！

&nbsp;

&nbsp;

<strong>三、“逼格”是高贵冷艳，亦是清新活泼的气质</strong>

<strong> </strong>

部分设计师在体现“高逼格”的时候通常会表现为更深邃的背景，更强的质感，更亮眼的点睛色，以此达到一种深邃大气的高贵冷艳的效果，诚然这是一种表达方式，但却不是唯一的方式，清新活泼也可以更有格调。

<img src="http://img.zcool.cn/community/021a0957996a060000018c1b009b67.jpeg" />

（图片来源于网络）

暗色的背景凸显了整体深远高贵的品质，纯白的文字加上极高的排版技巧，使得信息传递直观，视觉高贵大气！

&nbsp;

<img src="http://img.zcool.cn/community/022d3b57996a060000012e7e20d988.jpeg" />

（图片来源于网络）

完美的色彩搭配，个性的插画设计，纯白的底色背景，清新舒适的氛围跃然眼帘，气质独特，“高逼格”不言而喻！

&nbsp;

<strong>四、“逼格”是不同寻常</strong>

<strong>不同寻常不代表是“杀马特”，更应该是区别于大众化具有自己鲜明特点，文化内涵的表现。互联网的兴起让早期各类第三方服务公司赚了一笔，很多公司宣传着实力雄厚，人才众多，高端的设计服务，然而在对待自家官网宣传的设计中，往往大同小异，无法跟自己的宣传达到一致，一定程度上让一些客户望而却步，例如最凸显自己相关服务的栏目设计上，有逼格的公司往往会更注重服务项目在视觉上的不同寻常</strong><strong> </strong><strong>，概念文化！</strong>

<strong> </strong>

<strong> </strong>

<img src="http://img.zcool.cn/community/0246e157996a070000012e7e1e0bee.png" />

（图片来源于网络）

偏概念化的设计，不同寻常的icon视觉，使得自己公司本身的设计能力和创新能力更得以高度展现，瞬间拉开了和大众化的设计公司的距离，“逼格”自然爆表！

&nbsp;

&nbsp;

<img src="http://img.zcool.cn/community/02154457996a070000018c1b243ca3.png" />

（图片来源于网络）

亦是偏概念化的icon设计，仅通过线条和圆圈组成不同的形状，配以文案说明，更独特的感觉自然而然便产生了！

&nbsp;

<img src="http://img.zcool.cn/community/02052857996a070000018c1ba4d304.jpg" />

&nbsp;

(图片来源于网络)

当看多了大同小异的电商平台后，突然欣赏到这样一个独特排版和气质的电商设计时，你是否会感到很庆幸很开心呢？大块的图片排版不仅展示了精美的商品，同时整体上也带来了不一样的视觉感受，独特却并不杂乱，“逼格”自然展现！

&nbsp;

&nbsp;

<strong>五、“逼格”是细节爆表</strong>

<strong> </strong>

任何设计想要达到更高水准，更好的视觉气质，必然要把细微的地方做到极致，色彩的搭配，对比的张弛有度，字体的合理选择，元素间距的细微把握，统一有序的图标设计等等，细节无法做到高标准，再怎么凸显氛围，再怎么独特的排版也是徒劳无功！做好基本功才是“高逼格”的最有力支撑！

&nbsp;

<strong> </strong>

<img src="http://img.zcool.cn/community/026d5857996a080000012e7e511c10.png" />

（图片来源于网络）

&nbsp;

&nbsp;

写在最后的话：

每个人对于“高逼格”都有自己的理解，但是任何设计都是为用户而服务的。设计是用以解决问题，创造价值的，而明确的产品定位才能有更高价值的设计，才能有更好的设计，谢谢！

&nbsp;

文章来源：<a href="http://www.zcool.com.cn/article/ZNDIyMzg0.html">站酷</a>";s:10:"post_title";s:64:"原创/自译教程：浅谈“高逼格”产品视觉设计！";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:171:"%e5%8e%9f%e5%88%9b%e8%87%aa%e8%af%91%e6%95%99%e7%a8%8b%ef%bc%9a%e6%b5%85%e8%b0%88%e9%ab%98%e9%80%bc%e6%a0%bc%e4%ba%a7%e5%93%81%e8%a7%86%e8%a7%89%e8%ae%be%e8%ae%a1%ef%bc%81";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-28 16:27:21";s:17:"post_modified_gmt";s:19:"2016-07-28 08:27:21";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1310";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}