�A�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"913";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-25 21:29:44";s:13:"post_date_gmt";s:19:"2016-07-25 13:29:44";s:12:"post_content";s:23664:"<blockquote>几天前写的关于<a href="http://www.woshipm.com/it/377220.html" target="_blank">全栈pm（一）</a>的概述中，只是引出了一个概念。有些朋友跟我私信或者回复中都说到，这个就是他们现在正在做的事情，但是这样是不是合适，下一步要怎么发展，未来会怎么样，也是很迷茫的。所以这些问题我将在接下来的系列文章中来重点来说。我将用大约五章的篇幅，从全栈pm的概念，技能树，管理方式，成本控制，工作方法等维度来进行梳理。希望能给众多产品运营人一点有用的启发。</blockquote>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/07/chanping.jpg"><img class="size-full wp-image-377233 aligncenter" src="http://image.woshipm.com/wp-files/2016/07/chanping.jpg" sizes="(max-width: 680px) 100vw, 680px" srcset="http://www.woshipm.com/wp-content/uploads/2016/07/chanping.jpg 680x, http://www.woshipm.com/wp-content/uploads/2016/07/chanping-404x190.jpg 404x" alt="chanping" width="680" height="320" data-original="http://image.woshipm.com/wp-files/2016/07/chanping.jpg" /></a>

在讨论细节之前，我要指出，“全栈pm”并不是一个我凭空生造出来的概念，它是实实在在发生在现在众多互联网公司的产品运营人员的现状，我们虽然借用“全栈工程师”的“全栈”，但毕竟和开发领域是不一样的，具体的差别我后续会说。所以大家也不用非要去套用全栈工程师的一些概念和结论，差别真的很大。

好我们开始第二章：全栈pm的技能树及学习路径

全栈pm，和现行管理结构下产品/运营以及产品/运营内部的岗位割裂状况，最大的区别在于其万金油属性，即“什么都会”。但万金油只是一个表象，万金油的表象背后其实是超强的“学习能力”。但学习这个事情吧，总会有投入有产出，时间有限情况下，学习哪些东西算是基础，能为以后学习其他东西打下更好的基础，让学习其他事情变得更容易，就是我们这次要着力探讨的问题。

首先，本着以终为始的原则，我们要明确“全栈pm”的核心价值和竞争力，再去谈怎么建设和培养打造这些价值和竞争力。

任何一个互联网产品，总得创新，总要不断的在创新的方向上试错。而论及试错，就会有成本的高低。你直接招一个资深xx，再招几个高级xx和几个初级xx（xx代指各种被割裂的岗位如渠道运营，产品经理，新媒体运营等），上来什么都没干一个月几十万工资开出去了，然后发现不行，产品没人用或者市场环境不合适，砍掉这个团队或者转岗——这是试错，高成本的试错。你找个人，先让他摸索，且不论人愿意不愿意（有相当概率是不愿意的，毕竟可能远离自己以为自己的主要职业方向），让他自己从0开始尝试，一步步学习，几个月学习成本太高（毕竟很多东西之前没接触过），然后错过了市场机会，这也是一种试错，成本低的试错。

高举高打和小步快跑，在策略上讲，都是一种选择。巨头做某个东西，资源充足，当然要高举高打，恨不得直接气势如虹的霸占市场，创业小公司做某个新东西，资源紧张，当然也得小步快跑，最小投入下验证新东西靠不靠谱。所以成本高低其实不重要，重要的是在这些成本投入下，我们是否能验证“这个方向有戏，继续加大成本投入”的结果，继而判断出这些成本是不是值当呢？答案很显然是不一定的。

而我认为，全栈pm，及全栈pm带领的团队，就将是平衡这些成本的一个很好的方式。在有限的资源下投入数量可控的全栈pm，直到这些新业务足以被验证“是否要加大投入或者砍掉”，再接着往下推进。如果加大投入，无非变成一个新业务新部门，如果砍掉，没关系，他们还可以做别的事情。这就比招了一票专业的人结果发现这个方向没得做，而他们也无法实现内部转岗，导致不得不裁员（或者等着大家辞职）的悲剧要好。我相信这个场景很多人应该都经历过吧。

所以，全栈pm的核心价值在于两点：1、创新业务的发展初期最大程度节约成本；2、业务发展中后期有可以纵览全局的管理者。成本优势和全局业务掌握能力就成为了全栈pm相比普通团队和管理者最大的竞争力。（遇见过xx出身的经理根本不懂oo但是却对△△指手画脚的情况么？你懂我在说什么。）

这事儿其实很好理解，具体的成本核算和管理方式我会在后续的章节中讨论，这里先不展开了。（其实还有一个隐藏价值是防止产品的核心资源过渡集中在某1-2个核心岗位的人员身上，算是鸡蛋不能放在同一个篮子里的感觉吧，因为一个全栈pm去replace另一个全栈pm其实是很简单的一件事情。这里咱们后面再说）

所以围绕这个核心价值，我们再来看看一个全栈pm的天赋树应该怎么点。（全天赋图附后，先不要看这个，读完了再看）

首先，在最最一开始，有三个核心基础技能方向，以及对应的核心进路（approach）
<ol>
 	<li>产品设计（核心进路：原型设计）——站在远端思考用户。</li>
 	<li>获取用户（核心进路：渠道投放）——站在中间观察用户。</li>
 	<li>深入用户（核心进路：用户运营）——站在近处倾听用户。</li>
</ol>
在三个大方向下，基于这些核心进路，可以扩展到整个互联网产品运营的方方面面，而且这些工作中积累的基础，会成为快速学习的保证。

现行的岗位割裂机制下，我们很容易见到离用户极远的产品人员，为kpi机械投放的渠道人员，天天鸡毛蒜皮说用户要爆炸了的运营人员。如同盲人摸象一般，每个人理解的都不一样。你是产品经理，用户的反馈在你看来只有大小，优先级之分，而不是一个个活生生的个体；你是渠道经理，对你来说只有成本--下载--激活的路径，用户是谁你可能根本不用关心；你是运营经理，你觉得用户无小事，一千个用户反馈的问题和十万个用户反馈的问题你认为同等重要。即使偶尔我们会装模作样的做一些用户调研和访谈，但这些事情真正能解决问题么？我们都心知肚明。

所以我们需要能平等的从不同距离感知用户的全栈pm。他们要做的事情不是画出多漂亮的高保真原型图，架构多复杂的产品逻辑，或者精通多么完美的渠道引流细节和建立超级完美的死忠用户社群，他们要做的是在每个方面都能做到70分即可，对，不是80分（还可以）也不是60分（刚及格），而是让人说好也不行说差也不行但是勉强可用的“70分”，而且在这一点上，能力越平均越好。

无论你曾经的工作是什么，强项是什么，如果你想做一个优秀的全栈pm，你需要在这三个核心大方向上能力越平均越好。因为你的能力越平均，就意味着你看问题更容易回归到用户-产品这个最简单的逻辑关系中去，任何一个超出其他能力太多的方向，都可能会因为离用户的远近，给你带来一种偏颇的视野去理解这个关系。你要破除的就是“以产品/渠道/运营的角度看用户及用户产生的问题”这个观念，重新建立一种对【用户-产品】的关系过程密切关注的研究方法。即不要以用户为中心，而要以用户对产品从陌生到熟悉的过程去发现问题和解决问题。

某些有技术背景的同学可能就会忽然想到：这不就是面向对象和面向过程的区别么？我只能说真的很像。

（PS：这里的越平均越好，和我上一章所说的“某些具体技能掌握到90分100分”是不冲突的。毕竟总有些东西我们学习和掌握的就是比别人快和好，这个只是具体的一些实操技能的熟练程度而已）

我们接下来再看看这三个技能方向中，有哪些基础的你应该掌握以及为什么要掌握。
<h2>一、产品设计</h2>
产品设计这个方向上有这么几类具体的技能：
<h3>1、需求分析——掌握基本的需求分析方法</h3>
可能涉及（就是举个例子，实际上远不止这么点）：表单工具——mikecrm；数据获取工具——百度指数，竞品参考——it桔子，行业报告——艾瑞等
<h3>2、原型设计——画出可实现的产品原型草图</h3>
可能涉及：原型工具——axure，visio，墨刀，epub360，纸笔）
<h3>3、逻辑架构——原型后端的产品逻辑</h3>
可能涉及：mindmanager/xmind，office（数据参数文档），visio
<h3>4、沟通协作——和程序员/设计师等沟通</h3>
可能涉及：需求管理工具——trello，网易云协作，teambition等；沟通工具——嘴、邮件，ppt/keynote

这里面，最重要的就是【2、原型设计】，这也是我认为“产品设计”的核心进路。

所以你其他几个可能没做过，可能不精通，但如果你想成为一个合格的全栈pm，你必须要能作出非常好的原型产品。这里的“好”并不是值你做的多么漂亮，多么规整，而是逻辑足够清晰，足够简单，符合用户的需求。

在不断钻研原型设计的方向上，你会很自然的摸到需求分析，逻辑架构和沟通协作或者其他产品能力的门。因为你反复会去想用户最终看到的东西是什么，这个东西好不好，我自己喜欢不喜欢。在你思考“应该给用户什么东西”的时候，其他技能都只是为了更好的完成这一目的而已。你如果不断在“用户要什么”这个领域中精进，那么其他技能和能力也都是水到渠成会被带动提升的。

所以，在产品设计的大方向，顺着原型设计这个进路爬，你最终一定会：
<ul>
 	<li>知道从哪里和怎样弄数据来支持需求分析；</li>
 	<li>能把产品最终呈现的基础草图描述出来；</li>
 	<li>能梳理清楚产品各个元素之间的逻辑关系和数据流转；</li>
 	<li>能把设计的东西让研发/设计师同学帮忙搞上线。</li>
</ul>
只需要”能“即可，具体工具的使用上可以熟练和精通，你说我确实有能力用keynote做个漂亮到极致的slide也可以，但在结果上，要考虑投入和产出比，毕竟有很多别的事情也等着你去做。（当然比如你开个产品发布大会来无数记者和媒体和用户，那你做个漂亮的东东确实是投入值得的——前提是你找不到专门做slide的大师帮你搞，不然还是交给他们好一点）
<h2>二、获取用户</h2>
获取用户这个大框架下，有无数的细分岗位。怎么获取用户，有无穷无尽的技能和方法，但在这其中，渠道投放，为什么是最好的核心进路呢？

何为渠道投放，说粗暴点就是花钱买流量。你花点广告费进去，然后只要不是骗子渠道，那么总会有一些流量进来你的产品，至于他们会不会下载或者激活或者注册，那是另一个问题了。你说我做了一个给xx用户群用的产品，现在产品上线了，有什么比直接去xx用户群聚集的地方直接先来两斤流量更快来验证你的产品好不好用呢?或者你的产品可能再细分，有几类用户（无论你是按男女分还是按城市分还是按行业分），那么分头去买1000个流量来看转化漏斗，一定是比你苦哈哈找一些特定的用户来试用更能直观反映陌生用户的观感。

因为你需要的是数据，而直接花钱买量能帮你更快的获得数据，来验证你现在干的事情是要继续接着投入还是砍掉。

一个强大的的渠道投放能力会帮助你花最少的钱，最快的买到你想要的用户行为数据，那么基于此，有以下几个点你是必须要达到的。
<ol>
 	<li>熟练掌握1-2个主流广告投放平台的操作（百度竞价，新浪粉丝通，腾讯广点通等）及相关的投放经验（pc+移动平台总花费100万rmb大约是一个我认为及格的经验）；这个工作能帮你迅速建立起对用户群体量，获取价格，转化率等的认知，很多时候一毛钱不用花光看看买的关键字或者广告位的曝光量就足以印证你的一些想法了。就算公司暂时没有条件投放，我认为完全应该找朋友公司或者自己搞一个户来研究。百度的http://www2.baidu.com和腾讯家的http://e.qq.com和新浪微博的http://tui.weibo.com和淘宝直通车都可以认真研究，其他平台也可以看看，不过在面对流量推广toB服务方面，有一些文艺网站的广告投放后台，我只能用不专业来形容了。</li>
 	<li>独立设计完成landingpage（着陆页，销售页，活动页）的能力，包括设计（这里和产品方向的原型设计能力强相关，每个优秀的原型设计师都可能是一流的着陆页设计师），撰写文案，设置转化路径等；</li>
 	<li>善用工具进行数据分析（转化分析工具：google analytics，百度统计；app监控工具：应用雷达，app annie等）；熟练掌握数据统计和分析方法（ab测试，交叉分析，回归分析）；</li>
 	<li>能潇洒的和渠道商谈成合适的deal，渠道商包括但不限于：论坛，qq群，pc媒体，app应用商店（如果你的产品是app的话），甚至渠道商也包括你们公司内部的其他部门，这很常见。能以最小代价迅速搞到足以验证的流量，当然你说你有xx网站的关系，免费给你不用花钱买，这当然是最好的了，但不用花钱并不意味着你可以用蹩脚的landingpage和不合理的转化路径去浪费你的流量。</li>
</ol>
所以我们发现，当你为了更好的建设你的“渠道投放”能力的时候，你慢慢地学会渠道拓展、数据分析、文案写作、合作谈判，活动设计等核心能力，而这些能力是你做新媒体、商务BD、KOL拓展（即邀请意见领袖），软文营销等等其他获取用户的方式的极大助力，也是在获取用户层面上胜任全栈pm的基础。
<h2>三、深入用户</h2>
很多人说，用户很聪明。

还有人说，用户很蠢。

还有人说，用户很蠢但是你要让他们觉得自己聪明。

还有人说，用户很聪明但是你要把他们当成又懒又蠢得傻瓜。

这些就是盲人摸象方式下最容易得出的简单结论。

用户不是一个抽象泛化的概念，用户也不是统计工具上的数字和kpi，用户是实实在在的个体的集合。我们要接近用户，理解和倾听用户，但是，也不能离他们太近，不然被他们的情绪感染和灼伤是很容易的事情。

因为屁股决定脑袋，你离用户越近，你看到的用户的痛苦，不满，抱怨，就越容易成为你的痛苦不满和抱怨，继而干扰你，影响你对你要做的事情本身的判断。

割裂职能下，产品和运营的撕逼，很多时候来自于对用户的接近程度不同。

当然，一个全栈pm，因为你也要深入用户，所以你也会不可避免的被用户感染。但正因为你是全栈pm，所以你会不至于离得太近，你还会获得足够的距离和"跳出来看问题“的机会。这固然是矛盾的，但这种形态的切换，无疑对产品-用户的关系本身是有帮助的。

深入用户这个大方向下，方法也有很多。你看用户在产品内的行为数据，你和用户面对面访谈，你定期开会组织KOL讨论，你和用户情真意切的在社交媒体上交流，你当一个优秀的客服解决用户的各类乱七八糟问题……这些都是深入用户的方法，但这种种，没有比直接运营一批死忠用户群更有效和直接的方式了。

大多数产品都会有数量不等的死忠用户，而你要做的，就是聚拢一批你cover的过来的死忠亲卫队。聚拢的方式可以是q群，可以是知乎关注，可以是微博微信。他们会定期给你提建议，反馈问题，你也会去倾听他们的抱怨，交流他们的感受和你的想法。用户运营是深入用户最核心的手段，你需要以此为基础，去保持你和用户的距离不至于过远。

那么如果你在用户运营这个进路里不断的学习和成长，你会得到什么呢？
<ol>
 	<li>最快获得新版本/改动/功能迭代的需求反馈，甚至这些反馈在你原型设计刚出来的时候就已经开始了。（link to 产品设计）</li>
 	<li>基于死忠用户的个人社交网络分发扩散，获得第一批数据。（link to 获得用户）</li>
 	<li>获得购买产品、消费产品本身的用户声音，理解一线执行者的问题和痛苦，更好的进行团队管理和培训。（link to 管理技能——这个会单独之后说）</li>
 	<li>死忠用户的新增，分级，激励和惩罚，会更有利于你构建更大全局范围内的用户规则。</li>
 	<li>你会熟知qq，yy，新浪微博，微信公众号等一大堆交流工具的玩法，必要时候还可能得学会mysql等数据库挖掘用户行为的方式。</li>
</ol>
当然还有很多，你的预调研问卷，你某些大功能改动的试水，你针对特定用户的访谈，一切的一切和用户保持联结的方式，都可以从基础的死忠用户运营之中开始。

关于这块，还有很多看起来更冷血的东西，比如不能让用户成为管理者的”私人部队”，尤其是一些资源型用户（例如校园推广，地推渠道，销售网络等等）。身为全栈pm，你适当的和一些核心用户保持接触是很有利的防范措施。不要忘了，如果你的业务线有地推或者销售，他们也是你的用户哦。这就不展开讲了。

总之，我们关注的是“过程关系”，而不是用户。

以用户为中心，看起来是好的，但除非组织有一个强力，绝对权威的人来控制（像乔布斯那样），不然就会在各部门屁股决定脑袋情况下，因为和用户接触方式/距离远近不同，产生无穷的隔阂和撕逼，想想看你们现在是不是？

用一张草图来总结，大概我是想表达这个意思（图比较简陋，暂时没空画好看的，左图除了三个核心职能岗位人员以外还应该有其他类型的，意思到就好）

好，说完了。

以上我所说的很多方式方法，会随着工具的进一步优化，和套路的标准化（有非常多的产品和团队都在致力于实现这个目标），我们学习的成本只会越来越低。几年前axure，mindmanager还是个高门槛需要开课讲的东西，现在满大街的教程和文章，学习成本急剧降低。在这种情况下，我们会发现某些岗位的价值越来越低（如百度sem，产品助理/专员，基础用户运营等），低到一个实习生或者更刚毕业一年以内的新丁就可以很快做到80甚至90分。而只要你的公司对某个岗位不是核心依赖，那是没必要做到100分的（精益求精不是不对，而是要看投入产出比）。

所以一年以上，或者三年以上的产品运营呢？他们做什么？还只能做基础的岗位么？那你的职业发展和收入就会被束缚在这个机械的模块上无法动弹。

所以从一个只做一件事情的执行者——扩展到“亚全栈pm”（就是指专精于产品设计、获取用户、或者深入用户这些大方向的pm，抱歉我又生造词语了但实在是不知道怎么表达这个中间状态）——升级到可独立拓展/支持业务的创新——成为业务负责人带领团队下一步持续创新……这个过程，是所有现阶段割裂状态下产品运营人的必经之路。

当然，现有公司管理架构，如果还是原始的那套职能业务部门分裂，那当然是不适用的了，组织架构几乎一定是需要创新的，而这一点应该是没有大小企业之分的。大公司总有创新的新业务，天然就需要全栈pm，小公司本身就在不停的试错，天然每个人就应该是全栈pm。唯一的困惑可能发生在中型公司，就是一方面既需要有专业能力的人来补足专业岗位稳固已经打下的江山，另一方面又需要保持不停的跑。在现在市场的人才能力结构下，是不足以支撑足够的全栈pm团队的（团队很重要，因为全栈pm最好的学习对象就是另一个全栈pm）。

这个公司管理的问题，是每个互联网公司中现有的管理者可能都会关注的，所以我后面会用专门一章来讲全栈pm的公司管理问题，敬请期待。

<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/07/120160725114522.png"><img class="size-full wp-image-379964 aligncenter" src="http://image.woshipm.com/wp-files/2016/07/120160725114522.png" sizes="(max-width: 626px) 100vw, 626px" srcset="http://www.woshipm.com/wp-content/uploads/2016/07/120160725114522.png 626x, http://www.woshipm.com/wp-content/uploads/2016/07/120160725114522-404x258.png 404x" alt="120160725114522" width="626" height="400" data-original="http://image.woshipm.com/wp-files/2016/07/120160725114522.png" /></a>

专精方向和技能鱼骨图（先随便画个草的，核心意思就是在“原型设计”“渠道投放”和“用户运营”三驾马车的带动下，不断触碰和学习到新的相关技能）至于具体技能学到什么，每个产品都不一样，意思到就好。

<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/07/220160725114522.png"><img class="size-full wp-image-379965 aligncenter" src="http://image.woshipm.com/wp-files/2016/07/220160725114522.png" sizes="(max-width: 671px) 100vw, 671px" srcset="http://www.woshipm.com/wp-content/uploads/2016/07/220160725114522.png 671x, http://www.woshipm.com/wp-content/uploads/2016/07/220160725114522-404x245.png 404x" alt="220160725114522" width="671" height="407" data-original="http://image.woshipm.com/wp-files/2016/07/220160725114522.png" /></a>

一些概念的清晰：
<ol>
 	<li>产品：当我们在讨论产品设计，用户-产品的过程关系等概念中的“产品”，指你的业务线，你要干的那件事情。当我们在讨论产品能力，产品人员时候，指的是现在以需求分析、原型设计、沟通交流等工作为核心业务的岗位。</li>
 	<li>运营：大运营其实是涵盖渠道+用户运营的，但我们稍微狭义化一下，把渠道投放和运营分开谈论，渠道投放背后代表的是一大票和“获取用户”也就是我们俗称的“拉新”相关的大运营工作。“用户运营“背后所代表的是一大票和我们俗称的”留存“+”促活“相关的大运营工作。</li>
 	<li>以上两个概念其实我都不想再提了，都是原始的以用户为中心的产品运营理念下的概念。但也没办法，观念的扭转需要时间，我更愿意用”产品“”产品阶段“”产品阶段下的具体工作“来进行结构化具体的工作。这个个人想法，可以不用在意。</li>
 	<li></li>
</ol>";s:10:"post_title";s:50:"关于产品，关于运营，关于“全栈pm”";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:128:"%e5%85%b3%e4%ba%8e%e4%ba%a7%e5%93%81%ef%bc%8c%e5%85%b3%e4%ba%8e%e8%bf%90%e8%90%a5%ef%bc%8c%e5%85%b3%e4%ba%8e%e5%85%a8%e6%a0%88pm";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-25 21:29:44";s:17:"post_modified_gmt";s:19:"2016-07-25 13:29:44";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=913";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}