�
�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1312";s:11:"post_author";s:1:"3";s:9:"post_date";s:19:"2016-07-28 16:40:59";s:13:"post_date_gmt";s:19:"2016-07-28 08:40:59";s:12:"post_content";s:12908:"<img class="load" title="纯干货：如何练就高薪人士的高效沟通技巧？" src="http://file.digitaling.com/eImg/uimages/20160726/1469530966108830.jpg" alt="纯干货：如何练就高薪人士的高效沟通技巧？" width="508" height="337" border="0" vspace="0" />

来源：<a href="http://mp.weixin.qq.com/s?__biz=MzIyMzE4NjIzNA==&amp;mid=2649971660&amp;idx=1&amp;sn=7acfe84e6358c79bf5e9b2ac5d29bebe&amp;scene=23&amp;srcid=072697TmDNTqFY8iurG4THa8#rd" target="_blank">张良计</a>

开始今天的话题之前，先看下面两个场景。
<blockquote>场景一：和好朋友聊天。聊着聊着突然她说起来，你知道吗？最近Linda跟她男朋友又闹分手了，那个小三还没放手，小三说已经怀了男方的孩子，Linda也不是省油的灯据说她已经叫人调查这个小三了。镜头切换到你，What? 你不知道什么小三，也不知道你的好朋友Linda要分手，更不知道还有一个孩子，事情的来龙去脉你一无所知，当你朋友把这些一股脑跟你倒出来的时候你觉得信息量太大你要捋一捋。

场景二：你被突然叫入参加一个会议。会议上坐了七八个人，大家你一言我一语讨论地热火朝天，你完全不知道前因后果，不知道发生了什么事情。你心里着急想着手头还有别的工作亟待完成。会议结束，你的老大突然跟你说，刚才大家说的你都记下来了吧。这个新项目需要你来协助，你先把工作内容规划整理一下。你听完不知所措一脸懵逼地呆在那里， Excuse me?</blockquote>
以上两个场景在职场和生活中经常会遇到。当我们在和别人沟通一个事情时，如果信息量太大，往往会让听的人完全摸不着头脑，不知道你想要讲什么。同样的，当我们在听别人叙述一个信息庞杂的事情时，如果对方讲的没有逻辑条理，我们也会听不下去。

那么今天 Boy就分享一下关于在工作和生活中练就高效沟通技巧的方法。

首先，任何一个事物的叙述逻辑，都可以分为两种：<strong>时间线式和分部式。</strong>

<img class="load" title="纯干货：如何练就高薪人士的高效沟通技巧？" src="http://file.digitaling.com/eImg/uimages/20160726/1469524671812243.png" alt="纯干货：如何练就高薪人士的高效沟通技巧？" width="640" height="436" border="0" vspace="0" />

<img class="load" title="纯干货：如何练就高薪人士的高效沟通技巧？" src="http://file.digitaling.com/eImg/uimages/20160726/1469530275328714.png" alt="纯干货：如何练就高薪人士的高效沟通技巧？" width="640" height="436" border="0" vspace="0" />

时间线式的叙述，要将事物的发展按照以下逻辑进行拆解：

<img class="load" title="纯干货：如何练就高薪人士的高效沟通技巧？" src="http://file.digitaling.com/eImg/uimages/20160726/1469524699895547.png" alt="纯干货：如何练就高薪人士的高效沟通技巧？" width="640" height="436" border="0" vspace="0" />

所以文首的第一个例子，按照时间线式的叙述逻辑，可以这么来讲：
<blockquote>Linda之前谈了一个男朋友叫Will. 他们在一起2年了，感情一直很好。直到上个月的时候Linda突然在Will手机里发现了一个叫Lisa的女人，然后她还发现Will和Lisa之间有持续的信息往来。（起因背景）

这个事情Linda一直瞒着Will，她知道Will爱玩，但对她一直是“真心真意”，她以为Will只是和Lisa在夜店认识两人和朋友喝酒出来玩玩而已，并没有太放在心上。直到突然有一天Linda接到了一个电话，对方是Lisa，还说自己已经怀了Will的孩子，让Linda跟Will分手。（发展）

Linda听到这个消息人都炸了，马上去找Will. 没想到Will死不承认，说跟这个Lisa根本不熟，两人只是朋友介绍互相在酒局上认识而已，平时发消息也都是工作上的一些往来而已。（结果）

Linda还是不信，于是花钱找人去调查这个叫Lisa的女人。据说现在已经把她微博微信找出来了，不知道以后还会爆出什么东西来，到时候Linda可要跟这个女的大撕逼了。（未来）</blockquote>
这样说，无论对方对这个事情知道多少，都会觉得非常清楚，交谈可以顺利地进行下去。

说完了时间线式，再来说分布式。分布式的叙述逻辑如下：

<img class="load" title="纯干货：如何练就高薪人士的高效沟通技巧？" src="http://file.digitaling.com/eImg/uimages/20160726/1469524824325563.png" alt="纯干货：如何练就高薪人士的高效沟通技巧？" width="640" height="436" border="0" vspace="0" />

分部式是将一件事物按照一定的属性进行归类。例如按照人物（以某个人物的视角进行经历叙述，典型的例子如《权利的游戏中》的POV人物叙述法），按照发生的地点（发生在同一地点的事件集合），按照事物主体的性质（例如按照部门分类，按照行业分类等），分别进行说明。就好像我们看电影小说里不同主角各自的故事线剧情一样。分部式通常会和时间线式的叙述相结合。比如像文首第二个例子，我们就可以这样进行叙述：
<blockquote>这次会议讨论的主题是A客户接下来三个月的市场宣传方案的修改问题。上周我们已经给客户进行了第一轮提报，总体而言客户比较满意，但是有一些地方我们需要进行调整，因此今天把各部门的同事召集到一起，就各自需要修改调整的地方进行说明。（起因背景）

创意部门：客户对创意方向还有一些考虑，建议我们尝试从社会新闻事件的角度去切入，通过以小见大的方式来表现创意内容。创意对接人为Endy.（子事件1）

策略部门：竞品调查还缺失几个案例的研究，会后客户部门的Emma会整理具体的列表出来。策略对接人为Jame.（子事件2）

技术部门：客户对于H5中的3D旋转功能有顾虑，担心加载过慢影响用户体验，我们看看是否有别的替代方案。这个部分的技术对接人为Tony.（子事件3）

客户服务部门：Emma将今天讨论的问题记录下来，会后会发出会议记录，各部门同事请根据上面的要求进行各自方案的修改。两天后我们再开会汇总一次。感谢大家的鼎力配合！（子事件4）</blockquote>
假如你是Emma, 这样的表述是不是让你对自己的工作内容有了更加清晰的了解？各部门对接人清楚了，自己的职责范围也比较清楚，就不会手忙脚乱。

上面介绍的这两种叙述表达逻辑，大家可以在工作和生活中多多运用，不仅是面对面沟通，你写方案，做演讲，写文章都可以用到。除此之外，下面我总结了一些日常沟通中的小Tips，供大家参考：
<h3>Tip 1.了解对方对信息的接受阶段</h3>
这点在沟通之前一定要知道。通常我把沟通对象分为三个阶段：
<h4>阶段1：一无所知</h4>
这个阶段的沟通对象对于你要告知的信息完全不了解。这个时候你就要从事情最初的起因背景开始讲起，按照时间线和分布式的逻辑将事物完整的情况告诉他。处在这个阶段的沟通对象需要你耗费更多精力。
<h4>阶段二：知晓一部分</h4>
这个阶段，沟通对象可能之前已经对你要说的事情有了一些了解。那么在沟通时我们可以简单做一个前情概要，一般不超过一分钟。简单回顾事件之前的重要信息，然后开始说对方所不知道的信息。比如：“上次不是说到......,现在.....", "之前有提到......事情后来有了发展......"
<h4>阶段三：完全了解</h4>
这个阶段的沟通对象，通常全程参与和知晓事件的经过。那么我们不必跟对方多说废话，可以直接告知事情最新的进展。不用再做前情回顾，直奔重点。

还是回到文首第一个例子，当沟通对象处于第一阶段一无所知时，我们就要从起因背景，发展，结果一直讲到未来。而当沟通对象处于第二甚至第三阶段时，我们就可以直接跳过起因背景和发展，直接告诉对方现在的结果和未来可能事情的走向，这样是不是就节省了很多时间？

知晓对方对信息的接受阶段很少有人注意到，但其实这是高效沟通的一个大前提。很多时候我们听一个信息容易云里雾里就是因为沟通者不知道我们对于信息处于哪个接受阶段。当我们对事物一无所知时，对方却以为我们已经身处其中，滔滔不绝讲了一个小时却并没有让我们得到清楚的了解。所以当我们下次再沟通时，可以先简单了解一下对方处于信息接受的哪一个阶段，比如问：“对这个事情你知道多少？”，然后根据对方的回答来酌情筛选你接下来要沟通的信息，大大节省了时间成本。
<h3>Tip 2 .判断对方的情绪</h3>
<strong>很多时候我们沟通的信息本身自带情绪属性。</strong>比如“这个设计稿又要重新做”，没有一个设计师听到这个消息心里会高兴；再比如“我家人不喜欢你”，你男朋友听到这种消息也不会开心；或者“客户要求我们把价格下调20%”，你老板知道了应该会很不爽......

所以在沟通信息之前，你要先对这个信息的情绪属性进行判定，对方得知这个信息会是怎样的情绪反应。然后选择适当的时机和场合去沟通。有一个小窍门大家不妨试一下，我叫它情绪反差沟通法。当你要告知一个让人不好的信息时，尽量选择对方情绪平稳或开心的时候告诉他；当你要告知一个让人高兴的信息时，选择在他有点郁闷的时候告诉他会有奇效；当你要沟通一个需要麻烦对方的信息时，在对方比较空闲的时候告诉他;当你要跟男朋友说分手时，不要选择在他最爱的球队输球的时候说（当然如果你想让他加深印象你可以这么干......）。

<strong>总之你要先预判这个信息会给对方带来怎样的情绪反应，避免负面情绪加深，尽量增强正面情绪的引导。</strong>
<h3>Tip 3.明确自己的目的，剔除干扰信息</h3>
我经常会遇到这样的情况。对方和我讲一个事情讲了一个小时，最后却只需要我做很简单的一个事情。在这一个小时的时间里他跟我说了大量和目的无关的信息，一开始我以为他要我帮他找一份报告，听了一阵我以为他要我推荐给他一个人，最后我才知道他的需求是让我将团队里的一个小朋友借用到他部门一天。这种沟通在日常工作和生活中比比皆是。想想你家的七大姑八大姨要给你介绍相亲对象的时候都是怎么开场的：

“哎呀现在国家经济形势真是差呀......好工作真不好找........生活成本那么高，出去吃个饭动不动就几百块.......我楼下那个老王家的女儿，一个月拿一两万咧，每个月都没存款的......现在房价也那么高，上海边边地区都要四五万了......现在年轻人生活压力大啊.......结个婚都结不起了......房子车子小孩教育这以后都是钱......我上次看了个新闻，现在结婚不算房子都要起码100万了......哎哟想当年我们那时候结婚哪有这么多规矩......所以啊，找男朋友一定找个条件好点的你说是吧......哎，小琳，你现在还没男朋友吧，阿姨这里有个朋友的儿子还不错的，要不给你介绍介绍？”说实话，这铺垫真的让人听不下去。

<strong>高效沟通中，直奔主题是最好的方法。</strong><strong>当你明确了自己的沟通目的，那么和这个目的不相干的信息都应该予以剔除，否则很容易让对方产生错觉，混淆视听。</strong>借用人直接说借用人，介绍对象直接说介绍对象，你要担心的不是对方会不会反对你的提议，而是想办法证明以及说服对方接受你的提议。

麦肯锡有一个著名的“30秒电梯法则”，如何在与客户同乘电梯的这30秒钟内说服对方接受你的解决方案？这么短的时间里，客户是不会听你噼里啪啦说废话的。你只需要告诉对方，<strong>我的方案是什么？为什么这个方案对你有利？这个方案未来会有什么风险，但是我们如何控制风险？</strong>

这个同样也可以运用在生活和工作中。下次大家可以试试如何在30秒或者1分钟之内，完整地讲一个故事，或者概述一部电影的剧情。这些小练习都对提高沟通技巧有很大的帮助。";s:10:"post_title";s:60:"纯干货：如何练就高薪人士的高效沟通技巧？";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:180:"%e7%ba%af%e5%b9%b2%e8%b4%a7%ef%bc%9a%e5%a6%82%e4%bd%95%e7%bb%83%e5%b0%b1%e9%ab%98%e8%96%aa%e4%ba%ba%e5%a3%ab%e7%9a%84%e9%ab%98%e6%95%88%e6%b2%9f%e9%80%9a%e6%8a%80%e5%b7%a7%ef%bc%9f";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-28 16:40:59";s:17:"post_modified_gmt";s:19:"2016-07-28 08:40:59";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1312";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}