�
�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"720";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-22 17:51:08";s:13:"post_date_gmt";s:19:"2016-07-22 09:51:08";s:12:"post_content";s:7764:"<img class="load" title="2016 年广告圈趋势 11 条" src="http://file.digitaling.com/eImg/uimages/20160713/1468395733765842.jpg" alt="2016 年广告圈趋势 11 条" width="700" height="325" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160713/1468395733765842.jpg" />

一个朋友写了他所看到的广告圈的一些趋势，受到感染，我也来写写我观察到的一些行业现象。

根据以往经验，趋势文大多都会成为四不文章：阅读不高、转发不高、点赞不多、留言不多。管他呢，该说的话还是得说，留言你看到的趋势吧？

来源：<a href="https://mp.weixin.qq.com/s?__biz=MzA5MDg5MTYyNw==&amp;mid=2651834242&amp;idx=1&amp;sn=6338cf17ba6673a4adf5b837b617e91b&amp;scene=1&amp;srcid=0708AgKEVlFJa3gczNrZNG0Z&amp;from=groupmessage&amp;isappinstalled=0&amp;key=77421cf58af4a65363759dc876694694c569b36449c261560c3a878a2daf7d17e7fd98f1aa14027fc2666b9d4f5d8521&amp;ascene=1&amp;uin=MTk0MDE2NTk1&amp;devicetype=iPhone+OS9.3.2&amp;version=16031610&amp;nettype=WIFI&amp;fontScale=100&amp;pass_ticket=x9kCwHtbcYrtswhI8ishYRX1xLsjkvWFCoTnw5pIp4Q%3D" target="_blank">写给非广告人的广告常识</a>（微信号：adernous）
文字：鬼鬼（ojsngg）
图片：写给非广告人的广告常识
原标题《2016年广告圈趋势11条（浅度短文，附赠奇闻怪状）》
<a href="http://www.digitaling.com/" target="_blank">数英网 DIGITALING</a> 用户原创文章，转载请联系原作者
<h2>1、国内广告公司拥抱资本的心态开放。</h2>
省广股份、蓝色光标等老牌集团向国际同行追赶的步子加快，利欧数字与实业的联姻，火橙股份108将合伙人的扩张头角崭露。广告人对创意的独立执拗少了些，把创意当生意的经营意识强很多。资本的介入或许是创意的春天。

&nbsp;
<h2>2、单点创意刷屏依然百试不爽。</h2>
不知道为什么，就是想打个广告，加多宝六月飞雪，阿里闲鱼拍卖节的520唇印，报纸大幅留白再烧到社交媒体的联动效果有目共睹。豆瓣首支TVC、小肥羊首支TVC、红星美凯龙更好的日常、NB李宗盛每一步都算数等是影视广告一支片子引来无数讨论。腾讯NEXT IDEA穿越故宫来看你，宝马该视频已被BMW快速删除等H5创意在技术的外衣下非常鲜亮。朋友圈幸运签、高考准考证等基于大众年代心理的洞察，表现粗糙但传播势头盖过好多广告战役。

<iframe src="http://v.qq.com/iframe/player.html?vid=k0303dedw76&amp;tiny=0&amp;auto=0" width="700" height="480" frameborder="0" align="none" allowfullscreen="allowfullscreen"></iframe>
了解项目详情请移步：<a href="http://www.digitaling.com/projects/17931.html" target="_blank">《小肥羊：他们用138种食材搭建了世界，向你表白初心》</a>
<h2>3、利益分配不均或观念分歧严重致使新锐团队分手的现象增多。</h2>
北上广及内地有好几家业界名气作品爆棚的新锐广告公司，团队核心爆出不和散场，令人唏嘘。分手带来的直接恶果就是作品执行力的下降，或者执行风格单一。新锐广告公司离散重组的速度快赶上灵活多变的地产广告公司了。

新锐广告公司持续经营的抗风险能力还是老大难问题，我看新公司看十年，能活过十年还创意坚挺的业务自洽形成生态。

&nbsp;
<h2>4、新的传播方式赢在敢做。</h2>
六间房、YY、优酷等网站打磨了很多年都不温不火的直播，今年突然爆成类大众社交工具。

今年利用直播做广告的案例像去年蜂拥的H5，但是直播过程的不可控，导致突发事件增多，原百度用户体验总监刘超在IXDC演讲被嘘声是典型的因准备不足带来的负面。

万科2015年度股东大会的直播，我全程观看了，即便有斗鱼TV全方位支持，转场的流畅、画质的清晰还是蛮多瑕疵。股东提问环节，吵架、失礼的场面此起彼伏，但是它对我们了解万科和王石、郁亮团队这件事儿上，意义很大，未来是否能作为企业透明交流制度的一个点呢？

直播传播尚在初级阶段，准备充分不犯低级错误的情况下，敢做是最重要的，杜蕾斯直播百人试戴战役被不少人吐槽，但不掩盖它的拓荒意义。

&nbsp;
<h2>5、朋友圈分享力被收藏力稀释。</h2>
去年说微信公众号多如牛毛，和今年比都是小巫见大巫。去年朋友圈转发大号文章是很多人朋友圈的日常，如今转发自己写的公众号文章是普遍现象，好的文章很多人会选择收藏，很多分享是红包或奖励诱导下的行为。

准确的说，稀释是分享回归理性了。

&nbsp;
<h2>6、广告圈自媒体大V多局限在微信公众号。</h2>
凭借着勤奋、才华和早期红利，一批广告圈大V从微信公众号崛起，数量比微博真是几何级增长的。

有趣的是，从微信公众号再反向进入知乎、今日头条、简书、微博、豆瓣、百度百家、一点资讯等平台，独立再做成大号的屈指可数，缺乏引流不是主要原因，没有根据给平台有策略的创作内容是根本。

经过三年的疯狂成长，读者对公众号写稿人的要求更高了，写得不真诚一眼就能在文字里揪出来。

微信公众号变现的尝试让公众号粘性下降及运营者的信用贬值，无需紧张，坚持用好内容，筛选掉伸手党长期是好的。

&nbsp;
<h2>7、行业媒体被软文水文侵蚀。</h2>
当行业文章与金钱结合，一个怪现象出现了：没给钱的好案例可能被放成反例，给了钱的水案例可能被以次充好。有好几个网站有被软文攻陷的苗头窜升。

我理解好案例花钱做案例推广，可惜很多是水稿。给有软文鉴定家附体的读者分享个心得：有质量的软文不可怕，水稿才可怕。

行业媒体也好，自媒体也好，商业化之路都无可厚非，不能因钱不误导是底线。其实，读者都是聪明人。

&nbsp;
<h2>8、地产广告和国际4A转型急切。</h2>
唱衰地产广告和国际4A的声音这几年愈演愈烈，地产广告急着转做快消，有的不惜丢掉原来的生存业务。国际4A收购、开辟互动及Social业务，效果特别好的还是个例。

有多少钱就试多大错，历史来看，体系转型鲜有不成功的，丢掉原来业务转型的可能夭折。

&nbsp;
<h2>9、广告人讲课普遍，一人一堂手艺课是常态。</h2>
直播、微信群、活动APP的大批出现，让广告人讲课成本和时间前所未有的低。每位广告人都有自己最擅长的创意方法论，好几年内不变是人之常情，时间多的可体系的开一系列课，大多数广告人会一堂课讲清楚自己的核心创意观。

&nbsp;
<h2>10、以产品思维做广告，以广告迭代出产品。</h2>
作品容易烙印广告人的个人执着，而产品则是用户导向，对甲方和乙方都是直面市场，以市场反馈做调整，产品和广告你中有我我中有你。

分答和值乎很好的从单一功能的传播战役，迭代成一个成熟的产品，这种互逆再次缩短了互联网商业模式的验证时间。

就广告圈来说，国际创意热店Anomaly上海办公室发起了一个叫The Unreasonable的全球采访计划。

&nbsp;
<h2>11、戛纳国际创意节获奖的尴尬。</h2>
抄袭和造假不是我想讨论的议题，我想说的是另一点：不少在国际4A任职时戛纳狮子拿到手软的广告人，创业后就再也无缘戛纳奖项，为什么？";s:10:"post_title";s:30:"2016 年广告圈趋势 11 条";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:72:"2016-%e5%b9%b4%e5%b9%bf%e5%91%8a%e5%9c%88%e8%b6%8b%e5%8a%bf-11-%e6%9d%a1";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-22 17:51:08";s:17:"post_modified_gmt";s:19:"2016-07-22 09:51:08";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=720";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}