���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1927";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-08-12 16:50:46";s:13:"post_date_gmt";s:19:"2016-08-12 08:50:46";s:12:"post_content";s:6532:"<blockquote><strong>小编：</strong>在之前<a class="okmemo-dragging" href="http://www.xueui.cn/design-theory/thinking-about-service-design.html" target="_blank">《关于服务设计的思考》</a>的文章中，我们学会了什么是服务设计。今天给大家分享的是@<a href="http://i.ui.cn/ucenter/130189.html" target="_blank">Razer_YjJj</a>J带来的用户体验地图的设计分享。本文主要介绍的是用户在使用产品整个流程中的体验过程，痛点和痒点。当接触一个新知识点的时候难免会看不懂，看不懂怎么办，多读两遍吧！加油~（笑，我不会说小编我也是看了好几遍呢）</blockquote>
<img class="alignnone size-large wp-image-70516" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/Banner-1024x317.png" alt="Banner" width="1024" height="317" data-bd-imgshare-binded="1" />

前情提要，同事媛媛在收买了我后让我在这里帮她发表一篇文章，希望从此名声大噪，当然已经一盆冷水浇下，出于内容优秀（weibiliyou）的情况下，同时也是亲身参与过此次用户体验地图制作的情况下，让我们大家一起来看看，服务设计中的一个环节－－用户体验地图。

前不久在UXPA中国·华东站专业工作坊中有幸参与了一场茶山同学主持的服务设计分享，并且以“阿里西溪园区访客中心”为项目背景，围绕“全链路”的接触点布局、“各场景”的接触点布局、服务成本及价值的量化，这三个方面进行服务设计的练习。

注：<strong>服务设计中的接触点即指物理接触点（Hardware)、数字接触点(Software)、情感接触点(Humanware)</strong>

有兴趣的同学可自行去了解一下，这里就不多做解释了。

随手上三张现场照

<img class="alignnone size-large wp-image-70515" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/34-1024x608.jpg" alt="3" width="1024" height="608" data-bd-imgshare-binded="1" />

<img class="alignnone size-large wp-image-70514" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/21-1024x628.jpg" alt="2" width="1024" height="628" data-bd-imgshare-binded="1" />

<img class="alignnone size-large wp-image-70513" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/16-1024x604.jpg" alt="1" width="1024" height="604" data-bd-imgshare-binded="1" />

<strong>服务设计</strong>的概念在近几年越来越火，尤其在茶山同学将韩国的服务设计案例在国内UX设计圈内普及后，服务设计更是成为各行业<strong>用户研究员、交互设计师的重要思维方式</strong>，随之而来的用户体验地图也重新不断的被提及。

那么这两者究竟有什么关系呢？

<strong>-服务设计</strong>：一种能让设计师以“服务”角度从全局考虑问题的思维方式，提供一整解决方案；

<strong>-体验地图</strong>：整套服务设计中的阶段性产出，制作体验地图是用研同学用于梳理整条业务链上各个用户体验点的方法，需要用到一些用研技巧，比如用户访谈、观察法、文献研究、竞品分析、可用性测试、脑暴等。这张图并不是最终目的，就像拿到这张图的人也并不一定就能够懂得服务设计，重要的是这个过程能够帮助用研、交互全局去思考设计，找到新的业务突破口或者设计突破口，同时也能帮助大家把StakeHolders聚合到一起。这个过程就是做体验地图的意义，然后便开始真正的服务设计之路。

下图为今年年初制作的体验地图，我们的产品使用者为长途/短途货运司机，所以将<strong>找货-装货-运输-卸货-结算作为全链路接触点，通过访谈32位用户获取各接触点中的用户情绪体验点，从而确立了新的产品功能方向和设计思路</strong>。

<img class="alignnone size-large wp-image-70520" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/%E4%BD%93%E9%AA%8C%E5%9C%B0%E5%9B%BE%E3%80%90%E5%8F%B8%E6%9C%BA%E3%80%91-1024x289.png" alt="体验地图【司机】" width="1024" height="289" data-bd-imgshare-binded="1" />

考虑到良好的阅读体验，下面仅简单列出本次制作体验地图中的五个关键步骤，有兴趣的同学欢迎回复进行交流。

<strong>Key Steps:</strong>

<strong>-准备工作</strong>：找到相关StakeHolders进行一场脑爆，根据以往用户研究资料与用户行为数据模型确定各关键行为节点，即接触点；例如，找货这一节点包含了物理接触点（用户通过公路港信息大厅中的传统LED显示屏寻找货源）与数字接触点（用户通过陆鲸APP进行线上找货）；

<strong>-线下访谈</strong>：主要目的为验证并确定各关键行为节点，挖掘用户在各接触点上的正负情绪体验；

<strong>-流程整理</strong>：收集访谈数据后，再一次聚合相关StakeHolders共同根据访谈数据提炼FlowModle，为确保个人主观导致的误差，以两人为一小组各自根据共同的数据进行提炼，各组将各接触点上的情绪体验点写在便利贴上，并贴在相应位置；

<strong>-剔重复查</strong>：所有成员共同对便利贴上的内容进行查重筛选，去掉同一接触点上重复表述的观点；

<strong>-情绪赋值</strong>：赋予各行为接触点上的每个体验情绪一个值，如+1（高兴）、+2（惊喜）、-1（难过）、-2（打击）、0（中性无情绪）；

<strong>-归纳分类</strong>：通过鱼骨图将各接触点上的具体情绪体验进行维度命名并归纳，新产生的内容维度命名在体验地图上的坐标值即为该维度下所有情绪体验点的坐标相加之和（如-1-2+2=1）

<strong>-设计优化</strong>：将完成的体验地图草图通过skech或PS进行优化，如通过色块将各行为节点进行区分，提升信息可视化程度。

部分制作过程照片：

<img class="alignnone size-large wp-image-70517" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/IMG_3012-1024x1024.jpg" alt="IMG_3012" width="1024" height="1024" data-bd-imgshare-binded="1" />

关于服务设计中的用户体验地图就介绍到这里了，感谢你的耐心阅读！

&nbsp;

原文地址：http://www.xueui.cn/design-theory/experience-map-in-service-design.html

&nbsp;

&nbsp;";s:10:"post_title";s:30:"服务设计中的体验地图";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:90:"%e6%9c%8d%e5%8a%a1%e8%ae%be%e8%ae%a1%e4%b8%ad%e7%9a%84%e4%bd%93%e9%aa%8c%e5%9c%b0%e5%9b%be";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-12 16:50:46";s:17:"post_modified_gmt";s:19:"2016-08-12 08:50:46";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1927";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}