Y��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"847";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-25 10:25:16";s:13:"post_date_gmt";s:19:"2016-07-25 02:25:16";s:12:"post_content";s:5739:"最近发现一个问题:就是现在文章太多了，很多人看过之后其实就忘了，或者收藏起来根本没看的(当然不包括那些特别认真的，比如我)。很少人会去做笔记，做总结，做规划。

针对这个现象，我打算以后的文章内容做到尽可能的少，以及尽可能的精。让大家看完之后就能学到一点东西，而不是看一眼就想收藏(以后基本就不会打开了，又比如我)。

<strong>正文</strong>

上面说过，现在文章太多，基本上都不深入，只是点到某个知识，跟大家说个理论的东西，然后罗列出所有导航的形式，每个形式都用几十个字概括下。读者看了之后跟没看是一样的，遇到问题还是没法解决，只知道有这类导航存在而已。

有人说导航仅仅就是方便用户操作的小东西而已，没那么神奇。是的，对于小众的产品来说，确实没那么神，因为神你也看不出来。去看看Facebook为什么把抽屉式导航改成标签导航，就知道导航对一个App的影响有多大了。

导航分很多类别，如标签导航、抽屉式导航、九宫格导航、混合组合导航、列表式导航、Tab导航、平铺导航等等。之前在我的读书笔记中也有提到过三类导航:平铺类、标签类、列表类。

现在用到更多的导航其实是标签导航，它随处可见，相信目前大部分的App用的导航都是标签形式的。所以，是不是知道今天要说啥了？嗯，就是标签导航。

<strong>理清产品框架</strong>

相信很多设计师在设计导航时，一上来就开始YY自己的导航要放什么，因为这个时候他已经被标签形式的导航洗脑了，认为自己的App就应该用标签导航。然后继续YY产品的功能，自己理出个最适合的，放上去就好了。

其实不然。做好一个导航要考虑的问题其实非常多，还要考虑产品后期发展的延展性。必须定好整个产品的框架，把最核心的功能放在第一层页面，再根据产品的深度来设计导航的模式。

我们作为交互设计师，需要把握产品的整体架构，这不仅仅是产品经理的工作。所以在前期我们要付出很多努力，才能把一个产品的线框图画好。

<strong>标签导航的优劣势</strong>

先来看个图:

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/2/0/6/717602.png" alt="Image title" width="900" />

（路人：又特么是微信，呆总敢不敢来个新花样！！！）

不要看上面的列表，就看下面的标签。是不是特别熟悉？很多App都是用这类标签式导航来引导用户切换功能。

那它的优势是什么呢？

<strong>1.简单高效，操作方便。</strong>

下面的四个功能可以快速切换，用户在使用的过程中不会迷失方向，且简单清晰，层级明确。

<strong>2.更好的用户体验</strong>

试想一下，一般在使用App时，用户更多的会怎么使用手机？双手还是单手呢？肯定都有。所以单手使用手机的用户碰到的App是标签导航时，可以更方便的操作，不需要一定得使用另一只手。而某些导航如果不用两只手是没办法操作的。

<strong>3.快速了解App主要功能</strong>

一般来说，用户第一次使用产品，会关注这个App有什么功能，它能帮助自己完成什么任务。所以标签导航可以很好地帮助用户了解产品的主要功能，让用户看到的第一眼就知道自己能做什么。

然后再来看看劣势:

<strong>1.功能不能过多</strong>

有些产品功能过多，但是却又都是必要的，不能做删减。而一旦超过五个，就不适合用标签导航。因为标签导航不适合做滑动，所以功能多了可点击区域(热区)就变小了，操作上会有一定影响。

<strong>2.占用一定屏幕尺寸</strong>

标签导航占用了屏幕下方不少的位置，所以有些App就不适合用标签导航，比如阅读类的App。先不说一屏内少了很多字展示，就说在滑动的时候不小心点到了其他功能是不是很烦？

<strong>标签导航的延展</strong>

有的人会问，如果我的产品很想用标签导航，但是又超过了5个功能，那有办法解决么？看个图:

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/3/0/6/717603.png" alt="Image title" width="900" />

当你的主功能超过5个又一定要使用标签导航的话，那知乎的这个解决方案很适合你（最右边的功能是“更多”）。

还有一类情况是:主功能是标签导航，次要功能也是标签导航。有没有听着很乱？继续看图:

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/4/0/6/717604.png" alt="Image title" width="900" />

主功能是“新闻”，次要功能是顶部的“要闻”、“NBA”等等，如果在某个主功能中，你的次要功能很多，就可以使用这类方式来解决这个问题。还有很多类似的，标签导航能解决不少问题，但是前面说过，一定要注意规划，理清产品框架，不要一上来就随便定个导航形式。

<strong>小结</strong>

今天详细的讲了关于标签类导航的几个知识点，希望可以帮助大家在工作中更好的运用。最近出的文章大多是偏向交互、产品的。可能有些人初入这个行业，平时还涉及不到这类工作，所以下周我会出一篇文章，教大家如何学习（可能谁都会），就说说我自己是怎么走到现在的吧，虽然现在也就这样。嗯，来一篇不是鸡汤的鸡汤文。";s:10:"post_title";s:30:"标签式导航的设计思路";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:90:"%e6%a0%87%e7%ad%be%e5%bc%8f%e5%af%bc%e8%88%aa%e7%9a%84%e8%ae%be%e8%ae%a1%e6%80%9d%e8%b7%af";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-25 10:25:16";s:17:"post_modified_gmt";s:19:"2016-07-25 02:25:16";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=847";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}