^ߐZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"354";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-19 23:04:18";s:13:"post_date_gmt";s:19:"2016-07-19 15:04:18";s:12:"post_content";s:7662:"<h1></h1>
<img src="http://img.ui.cn/data/file/7/9/5/202597.jpg?imageView2/2/w/900/q/90" alt="网站上最不能容忍的5大用户体验错误" data-image-src="http://img.ui.cn/data/file/7/9/5/202597.jpg?imageView2/2/w/900/q/90" />

又是一篇13年的老文章，有些设计上的问题总在不断的说，也在认识到错误以后不断的又犯，文章写的很好，希望大家仔细阅读！

过去的几年，网站的用户体验有了突飞猛进的提高，但还是有些网站会给人带来“设计人员想什么呢？”的疑问。

从<a href="http://uxmag.com/topics/design%22%20/t%20%22_blank">设计</a>的角度看，内部的人员经常会彼此大吵大闹（“不行不行，这个<a href="http://uxmag.com/topics/content-and-copy%22%20/t%20%22_blank">内容</a>必须放到首页正中间”），或者被乱七八糟的工具和方法分散注意力（“我说这个项目干脆用精简用户体验模式”）。在这种情况下，我们经常会忘掉，其实在屏幕那一头坐着的人不会参与这些决策，这个人只是想要获得自己所需要的信息、购买产品或者在等地铁的时候休闲个五分钟。

下面是五项大家仍然经常会犯的而且最不能容忍的用户体验错误，列出来大家引以为戒。

<strong>1.把过多的注意力放到了宏观却在微观上加以克扣</strong>

大方面的决策（比如网站<a href="http://uxmag.com/topics/information-design-and-architecture%22%20/t%20%22_blank" target="_blank">主信息架构</a>、页面整体布局网格）固然重要。但是细微之处的交互经常也会糟蹋掉整体体验。

最近，我看了一个非营利机构的网站。这个网站有非常棒的<a href="http://uxmag.com/topics/interface-and-navigation-design%22%20/t%20%22_blank" target="_blank">导航</a>、非常棒的内容和非常棒的布局，但是在点击捐款按钮的时候弹出来的控制选项非常不直观、不好用，界面在你每执行一项操作的时候就会刷新一次。

有的公司在用户体验方面人手不足时，就会让用户体验方面的人去做高层级的设计，同时把“低级”的交互留给经验不足的人，或者干脆不留时间处理用户体验的细节方面：这种错误往往会付出高昂的代价。

人都希望技术的进步能够紧贴人与人之间<a href="http://uxmag.com/topics/interaction-design%22%20/t%20%22_blank" target="_blank">互动</a>的模式。仔细想想，你怎么判断是个人是否善良？是否在乎你并且维护你的利益？并不是通过他们所穿的衣服或者口音是否好听，而是在于他们所为你做的小事，以及是否会在紧要关头为你着想。对于网站也是同样的道理。我们判断一个网站是否能用、好用的标准就是它能否执行这些细微之处的交互。

<strong>2.在主页设计上投入了太多时间</strong>

你在主页（而不是所有其他页面）的设计和再设计上投入了大把的时间和精力。但是很有可能大多数人完全不会看你的主页。你的营销和社交媒体宣传内容很可能把访客直接引导到其他登录页。

当然设计精良的主页也是必不可少的，但不能因为在主页上投入了太多时间和精力就牺牲其他重要内部页面的用户体验。多用分析技术了解用户实际进入网站的位置，然后想办法让这些页面做到最佳。

<strong>3.过多倚重于文字</strong>

你与网站访客沟通的主要方式是什么？你的内容中文字占比是多少？图像、音频或视频的占比又是多少？网站上用文字本没有错，只不过大家可能不会去读罢了。

除非你的网站的唯一作用就是提供文字文档，否则就应该思考如何以其他形式提供内容。<a href="http://www.pnas.org/content/early/2010/07/13/1008662107.abstract%22%20/t%20%22_blank">根据对人脑的研究显示</a>，人在听别人说话时脑部活动会与说话者同步。听的人与说的人脑部同步率越高，听的人理解内容的透彻程度就会越高。

所以说，要<a href="http://www.theteamw.com/2013/01/22/4-reasons-why-online-video-is-compelling-persuasive/%22%20/t%20%22_blank" target="_blank">多使用音频和/或视频</a>，不要单纯依赖于文字。

<strong>4.设计与受众存在代沟</strong>

我经常问一个问题。受众中有多少人年纪大于55岁？多少人在30-55岁之间，又有多少不到30岁。我们的受众中有大多数人位于中段，也就是30到55岁。这就是所谓的X代。在战后婴儿潮出生一代（年纪大于55岁）占了人口中的一大部分，而千禧年一代（不到30岁）所占的比重更大。

这就说明大部分针对这两大部分人的设计都是由最年轻的一代人做的。这个重要吗？当然重要。研究显示，不同年代的人对于技术的预期和心理模型有着代沟似的差异。

你在8到10岁时盛行的技术会从根本上改变你对技术的看法。所以说，如果你觉得自己设计的网站上的内容、功能和交互都不错，那很有可能另一个年代的人群觉得不怎么样。

举例来说，婴儿潮期间出生的人都希望技术能够帮他们办事。他们不要求有多渠道的体验，同时他们对不同的渠道有着鲜明的区分。他们觉得电视和互联网之间有着本质的区别。

X代的人需要有的技术能拿来办事，有的技术拿来休闲。X代的人认为界面和交互的定制化和个性化非常重要，而这个想法对于其他年代的人可能不是很重要。

千禧年的一代则根本不思考“技术”这个词。对于他们来说，所有东西都是技术。他们的思考方向集中在自己要做的事上，而不是技术所做的事上。婴儿潮一代会说：“上网查查。”千禧年一代则会简单说：“去查查。”

而更年轻的人则根本不会把台式机和笔记本看作一项技术。他们更多考虑的是智能手机和平板电脑。不管你属于哪一代，你都很难理解另一代人是怎么想的：<a href="http://uxmag.com/topics/user-acceptance-testing%22%20/t%20%22_blank">所以一定要做测试</a>。

<strong>5.忽略多屏行为</strong>

我们都知道移动和多屏的使用频率正在快速的升高。大家都在用智能手机和平板电脑访问网站。他们会先打开手机，然后又转到平板电脑。他们会在用笔记本看东西的同时在手机上看其他内容。他们会在坐车、走路或说话的同时浏览网站。

而我们在做设计时，还是会不自禁想象一个人安静地稳坐在电脑前面的画面。除非你明确知道目标受众会像你想的一样访问网站，否则就必须考虑多屏幕的主动式体验。

这就是难点所在。我们大部分的设计工具目前还没有跟上这个理念。诚然，针对多屏体验进行代码编写不是不可能，而且现在响应式设计也是大势所趋，但你作为设计师而不是程序员又应该怎么做呢？你能轻松地做出多屏或响应式体验的原型吗？假如你是一个网站所有人，要用WordPress创建网站，这时候该怎么办？你自己一个人能设计出多屏及/或移动优先网站吗？另外，又应当如何做多屏体验的用户测试呢？你一个人做得到吗？

当然，我们希望这些工作以后能更加简单，不过与此同时，我们还需要想出自己的解决办法来保证自己不再扎在“一个人，一台电脑”这种思维定势中。";s:10:"post_title";s:49:"网站上最不能容忍的5大用户体验错误";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:145:"%e7%bd%91%e7%ab%99%e4%b8%8a%e6%9c%80%e4%b8%8d%e8%83%bd%e5%ae%b9%e5%bf%8d%e7%9a%845%e5%a4%a7%e7%94%a8%e6%88%b7%e4%bd%93%e9%aa%8c%e9%94%99%e8%af%af";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-19 23:04:18";s:17:"post_modified_gmt";s:19:"2016-07-19 15:04:18";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=354";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}