�+�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"358";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-19 23:20:42";s:13:"post_date_gmt";s:19:"2016-07-19 15:20:42";s:12:"post_content";s:5427:"<h1></h1>
<img src="http://img.ui.cn/data/file/8/6/9/210968.jpg?imageView2/2/w/900/q/90" alt="所谓“简约”的问题" data-image-src="http://img.ui.cn/data/file/8/6/9/210968.jpg?imageView2/2/w/900/q/90" />

<strong>打造客户眼中堪称简单的产品或服务往往是设计师高高供奉的圣经</strong>。Duncan Stephen曾有妙语云“我们作为设计师的目标，就是让东西对用户来说越简单越好。”

如此说来，我们对Apple和Google在用户体验相关发行物方面所实现的简约美感给予革命一般的敬意是完全理所当然的。然而，虽然我们不约而同地将很多界面认定为简约派，但也有很多产品或服务不一定在所有地方都透露出简约的味道。

这是什么情况？

<strong>所谓“简约”的问题</strong>

万人爱戴的作者Antoine de Saint-Expuery曾说过一句著名的话“什么叫完美？完美就是让你看过就不会再想。”

虽然这句话让很多人产生了共鸣，但是在软件开发圈子里还是对界面的完美是什么样有着不休但良性的辩论。设计师讨论的焦点总是集中在简约性上，也就是说，少就是多到底是不是真的？在很多情况下，在谈到功能的多少对简约性的影响是正面的还是负面的这一点时，讨论会激烈化。

一方面，Nick Bradbury这一派实干家认为简约就是要功能少这个想法是错的。另一方面，也有很多设计师表示简约的系统就是要东西越烧越好。Luminary John Maeda甚至在他的<a href="http://www.amazon.com/gp/product/0262134721/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0262134721&amp;linkCode=as2&amp;tag=uxma0e-20&amp;linkId=UHYAE3V2547IO5UI%22%20%5Ct%20%22_blank">《简约性法则》</a>一书的开头就写下了一段话来说明实现简约性的最快捷方法就是删。他的第一条法则说到“实现简约性的最快捷方式就是通过全面的删减。”

这一思路（越少就是越简单）已经在设计产出物上有了多年的体现。比如，在2010年，设计师Trent Martens就围绕“少就是多”这一理念写下了一篇思考性文章。在文章结尾，他评论并提问到：“我们从体验中拿走哪些内容才能让用户更加轻松的做出决策？”

<img src="http://s1.nq.com/img/cnnq/20150331/20150331150204_microsoft-word-interface.png" />

Microsoft Word界面上的一团乱

简约取决于环境简约依赖于文化简约受制于主观

但是，尽管大家都赞同上述引用Antoine de Saint-Expurey的话中令人困扰的有关“完美”的定义，不过到底让人看过就不会再想的点在哪，大家还是争论不休。

<strong>少就是多</strong>

也许设计界围绕简约性的问题谈的不是数量，更多是我们考虑简约性的方式。

Fog Creek Software的创始人Joel Spolsky曾很好地道出了这个难题：

如果你用“简约性”这个词来描述能够让用户模型与程序模型紧密呼应的产品，那么这个产品的使用肯定会很简单。行，算你对。如果你用“简约性”这个词聊描述视觉外观简单干净的产品，那这个词就沦落成了一个审美领域的词汇，就好像你把Ralph Lauren牌子的衣服叫做是“高端大气“一样。行，也算你对。极简主义审美最近很流行。但是如果你以为简约就意味着“功能不多”，或者“专注于一项功能”，那么我首先为你的诚实鼓掌，但是一个刻意抛弃功能的产品，是走不远的。甚至连iPod都有免费提供的纸牌游戏。

Spolsky很好地将有关这个理念的细微差别和复杂性锁定到了对“简约性”这个词的思考上。通过以不同的方式审视我们使用“简约”这一形容词的方法，他描述出了我们应当如何将有关简约性的讨论缩小成一个有关更多还是更少的游戏。之后，他提出了一个绝妙的论点：iPod的纸牌游戏，也就是说，这么一个被人广为认作是“简约”的产品也包含了很多设计师看作是“非关键”的元素。

所以，我们不能再把简约等同于“少”甚至字典里的定义也明确说明了简约和数量没有关系。简约的定义是简明、好理解、简单，而不是：尽量少。

<strong>保持“简约”</strong>

在设计方面，要实现简约没有简介途径。虽然有一些基本原则和<a href="http://www.slideshare.net/AbbyCovert/information-architecture-heuristics%22%20/t%20%22_blank">久</a>经考验的启发法，但它们对我们设计的帮助是有限的。简约取决于环境简约依赖于文化简约，不论从哪个角度说，都是主观的。

降低设计复杂性的最佳方法就是经常观察人们与产品和服务的互动方式，从而不断重新思考我们对什么是简约的固有判断。正如Don Norman所说：

逻辑不是解答这些问题的途径：人类行为才是关键。避免工程师和经济学家的谬误：不要用理性寻找解决方案——观察真实的人。我们要遵从本来的人类行为，而不是心中理想的人类行为。

真正能帮助我们将设计迭代地更为简约的是用户，而不是我们自己。我们要不断、尽早地寻求用户反馈。我们要提倡多多观察，作为提倡简约性的关键。";s:10:"post_title";s:27:"所谓“简约”的问题";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:63:"%e6%89%80%e8%b0%93%e7%ae%80%e7%ba%a6%e7%9a%84%e9%97%ae%e9%a2%98";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-19 23:20:42";s:17:"post_modified_gmt";s:19:"2016-07-19 15:20:42";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=358";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"1";}}