0ՐZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"778";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-23 15:25:10";s:13:"post_date_gmt";s:19:"2016-07-23 07:25:10";s:12:"post_content";s:14893:"从亚马逊近10亿美金收购Twitch开始，视频直播行业一直是热门话题，随着Facebook、Twitter等巨头的加入不难看出，视频直播已经成为互联网巨头在社交应用布局上一颗非常重要的棋子。彬彬有礼节目直播“线下100人陌生男女床聊”，线上60万粉丝彻夜观看;papi酱直播首秀获赞近亿。摩尔定律和反摩尔定律的相互作用，实现了软件和硬件上的快速平衡展，4G时代和五年后就将到来的5G时代，已经把一个庞大的网络信息流世界赋予给每个人。在这样的基础环境下，孕育出了移动直播并且移动直播平台一定会茁壮成长。

互联网的发展给传统媒体带来了前所未有的挑战，从多媒介的融合到社会化媒介的兴起，媒介产品的数量和品种日趋丰富，受众的需求也日益个性化。报纸、广播、电视传统媒体单一化的发展己经无法适应媒介市场的发展要求。受众的接受方式也随着媒介生态系统的发展而产生变化，人们不再愿意被动的从媒介接受信息，而是更加青睐于主动参与的体验式、互动式营销活动。而移动直播正好拥有实时互动，感官最佳体验的基因，手机平板使用方式的便捷，又有低成本传播的优势，所以，通过移动直播平台进行营销传播，获得良好的效果是毋庸置疑的。

<strong>　　一、移动直播平台的营销发展现状</strong>

<strong>　　(一)、营销市场的发展</strong>

2015年起，全国刮起了移动直播风，大大小小直播软件竞相爆发，直播睡觉、直播吃火锅、直播挖竹鼠等各路主播纷纷直播，随后，直播发布会、直播讲座、直播峰会论坛等新兴营销传播方式也纷纷诞生。在2016年初，业界便推崇移动直播领域为新的风口。主推全民直播的映客、花椒;主推游戏的龙珠、斗鱼等等直播平台纷纷砸钱发力。陌陌最近刚推出的网页版是醉翁之意在直播，Twitter、Facebook等巨头也跃跃欲试，在自己产品里添加直播功能。速途研究院分析师团队通过收集整理国内移动直播市场的相关数据，并对用户进行相关调查，解析了2016年第一季度移动直播市场发展状况和未来趋势。如下图《移动直播应用评分排行》

<center><img src="http://www.pmtoo.com/uploads/allimg/160721/264-160H1212641104.jpg" alt="" /></center>　　榜单前十名依次是：虎牙直播、KK唱响、斗鱼、秀色秀场、映客直播、么么直播、繁星直播、微播美女直播、战旗TV、熊猫TV。从直播软件的下载量可以推出，直播领域有着数量庞大的用户支撑，这就是在直播平台营销的基础。

由于移动直播是传统直播的分支，近几年刚刚脱离了PC端，所以下载量和用户数相比PC端少一些，但是用户增长速度远远高于传统媒介，如花椒直播，截止2015年10月，运营半年，就已经快速积累3000万用户数，可见移动直播的传播效果之快。2015年9月16日，乐视音乐公布数据称，李宇春WhyMe十年演唱会直播预约人数已突破355万;2016年5月份，花椒首明星养成计划直播首播当日观看人数达120万;2016年6月13日的聚美优品直播营销推广中，人气明星“小丈夫”杨玏现身聚美优品直播间，当晚在线人数突破300万。这些数量庞大的观看群体足以证明了新媒体产品移动直播平台的营销发展现状非常乐观。下面是2016年第一季度移动直播应用的综合评分排行，可以看出大众对移动直播的传播方式很受欢迎。

<strong>　　(二)、营销方式的发展</strong>

网络营销最先开始于企业网站，随后营销推广渠道发展成邮件推广，在邮件中加入公司的URL。随着邮件营销的普及，又诞生了新的媒体营销，就是网络广告，网络广告包括很多种类型，诸如网幅广告、超链接文本、弹窗广告，视频广告等等，网络广告的出现颠覆了传统媒体的营销方式，它的开放性、实时可控性和双向交互性把公司和消费者的距离大大拉近。与此同时，博客的出现，构建了一个庞大的社交网络，博客营销产生。随后微博营销、微信营销也出现。平台用户的基数决定了营销传播的效果，而体验的好坏决定了用户的数量。直播平台的飞速发展，正是因为它拥有很好的感官体验。PC端的直播由于运行环境限制，最早出现的是秀场类，随后出现游戏直播，但迟迟没有企业的直播宣传营销，在斗鱼或YY中主播个人会通过直播宣传自己个人的淘宝店，狂战目前为超过100位主播做电商代运营，有影响力的大主播几乎都在其下，他们的淘宝店在2015年流水达到亿级，可想而知直播平台的营销潜力巨大。2015年初，“花椒”、“映客”等移动端app开始广为人知，其中绝大部分是秀场类内容，“花椒”做过明星的婚礼直播、并且定期做发布会直播; “微吼”专门做讲座直播;2016年4月27日杜蕾斯做了一场声势浩大的营销直播，这些移动端、PC端同步直播的营销方式，已经或即将成为目前公司企业或个人营销传播的新形式。

<strong>　　二、移动直播平台的营销特点和比较分析</strong>

<strong>　　(一)、移动直播平台的营销特点</strong>

<strong>　　1、实时互动的信息交流</strong>

ULOOK是一家移动互联网视频直播平台，所有内容均由播客自主产生。任何用户下载APP后，就可以成为播客发起直播。在2015年七夕情人节，ULOOK视频直播平台发起了一个七夕实验：“一只‘单身狗’用多长时间才能和100个妹子合影”。一部手机，两个小时不间断直播，这场直播吸引了上千名观众在线收看，在直播的过程中不断有出谋划策的弹幕划过，能够实时与网友们交流成功帮助选手完成任务。2015年8月中旬，ULOOK发起“我和宁泽涛有个约会”的直播，直播宁泽涛在华中师范大学游泳馆的现场实况，当天预约观看人数又创下新高，ULOOK的广告语是“不在现场也能身临其境”。花椒和映客经常会组织平台上的当红主播前往明星发布会的现场，或录制专访的现场，让用户从第一视角参与活动当中，并且回答粉丝的提问，做到信息的实时交流。这种实时的信息交流，不会造成内容上的折扣，也避免了传播过程中的偏差。

<strong>　　2、线性播放获得持续性注意力</strong>

心理学家斯蒂芬森将媒介视为玩具，认为人们接触媒介是带着游戏的目的的，人们使用媒体主要用于消遣娱乐，大众传播是一种游戏性的传播。在游戏性的传播中，工作性传播先天所具有的功利性压力不再存在，处于其中是主动积极的。即便游戏存在着困难，带来劳累，这种主动参与的心态也使游戏中的人内心始终保持快乐。

专门做商务视频直播产品的“微吼”，目前IBM、微软、腾讯、中欧商学院等在内的世界500强企业都在使用。创始人林彦廷认为，同步直播具有线性播放的持续参与感，能有效促进行业研讨、巡展、峰会、网络会议等活动的传播效果。

诺贝尔奖获得者赫伯特·西蒙指出，在信息爆炸的今天，信息已经不再是最有价值的东西，最有价值的是大众的注意力。从传播学角度讲，没有引起人们的注意力，就做不成任何事。所以现在是一个注意力经济的时代，通过移动直播的互动性、便携性、线性等良好体验，仅仅抓住受众的注意力，此时营销的目标就实现了。

<strong>　　3、设备的便携性和低门槛</strong>

在国外，移动在线直播趋势更加明显。英国一家咨询机构IAB的调查显示，有36%的用户表示他们用智能手机观看长视频(时长超过5分钟)，而58%的用户则表示他们常在移动端看一些短视频(时长5分钟以内)。诸如Meerkat和Periscope这样的新兴直播平台的崛起，提供自主直播或已成为主流。后者现在已经拥有超过1000万的活跃用户。传统电视媒体直播都是用专业设备操作完成，普通人要想尝试一次直播体验不太容易现实。而如今，大量的直播类应用在移动端快速普及，映客、易直播、大象等直播软件都提倡人人做主播的理念，使得直播的门槛大幅度降低。手机技术的不断革新，为移动端视频直播的推广提供发展土壤，而网络环境持续的技术性优化则降低了视频内容产生和资金成本，这给移动端视频直播带来了无限可能。

<strong>　　(二)移动直播平台的营销比较分析</strong>

任何一种新的互联网应用都会产生相应的营销方式，但随着科学技术的发展又会呈现出新的特点，因此把其他平台营销的经验简单地应用于移动直播营销是行不通的，从传播内容特性和营销手段等方面看都有着有明显的不同。将移动直播营销与电视媒体、短视频移动应用进行比较分析，对开展移动直播平台的营销具有积极的意义。

<strong>　　1、与电视媒体的比较</strong>

传统的电视营销是点对面的传播模式，传统电视直播作为一种节目形式，是经过编导组织化和结构化了的，无法照顾到每个受众的情感需求和信息取向。即使电视直播的形式和方式变得越来越趋向多样化，也一直没能摆脱“点对面”的单一模式。而移动直播相对地给受众提供了一个自在的状态和流程，同时也提供给受众一个虚拟的大平台进行信息的交流与反馈，相比于传统电视营销来说更加开放，直播内容和形式也不那么的固定，主播的实时讲解做到了更好的双向互动。

<strong>　　2、与短视频移动应用的比较</strong>

Papi酱、艾克里里等网红的出现标志着2016年短视频的爆发，快手、美拍、秒拍等类似的短视频平台作为直播平台的上游，是网红经济的孕育起点。基于粉丝经济的支撑，碎片化知识的泛滥，加之硬件设备支持，使得短视频快速蔓延开来。一分钟以内的短视频把制作和传播的门槛都降到了最低。美拍中有多达几十种的滤镜、背景音乐、色调和剪辑模式，普通用户就可以制作出精美的小视频内容，利于传播。2014年十月，美图公司在美拍app推出的“全民社会摇”活动，创下“最大规模的线上自创舞蹈视频集”纪录。它在短短两周内就吸引了102万人参与，席卷了30多个国家和地区，由此可见短视频的营销力度之大。易传播分享、观看门槛低是短视频的优点，但是由于长度的限制只适用于比较小的信息量。移动直播的区别在于一种跨距离的身历其境的体验，持续收看，接收的信息量大，适用于时间、规模较大的营销活动直播。它的魅力还在于，直播这种带有仪式感的内容播出形式，能让一批具有相同志趣的人聚集在一个平台，情绪相互感染，达成情感气氛上的高位时刻。如果品牌能在这种氛围下做到恰到好处的推波助澜，其营销效果一定也是四两拨千斤的。

<strong>　　三、营销中存在的问题</strong>

<strong>　　(一)、秀场经济无法摆脱</strong>

以直播应用“花椒”为例，它的初衷是打造陌生人交友平台，提出“人人都是主播”的概念。而直播类要求时间长，想要创造高质量的UGC门槛很高，那么如何能让大家在长时间里都不感到厌烦呢?要么内容精彩，唱歌跳舞脱口秀，要么颜值高，有脸有胸声音好。“人傻钱多”的土豪们刷两台“法拉利”就能博得美人一笑，于是经过市场筛选，秀场经济所造成的大量低质量内容充斥平台，渐渐蚕食着初衷较好的花椒。因此，现阶段秀场经济依旧是移动直播行业无法摆脱的痛点。

<strong>　　(二)、缺少情感沟通</strong>

不同于博客、SNS网站、微博等网站的形式，直播平台没有受众抒发情感的板块。电视广播的信息传播是单向的一对多，移动直播比传统电视广播的直播多了实时互动，但是仅限于播放的过程中，结束直播后没有提供抒发情感或交流的版块，所以在留存率上效果较差。微信内推广告之所以效果好，就是因为基于熟人朋友的关系网的强大，用户多，留存率高，打开次数多，广告曝光次数多，营销效果好。而直播应用只会在开始直播后聚集人气，结束直播后观众“各回各家”，很难形成过后的讨论无法形成大家的共鸣。追求实时性的它，本身却很难与用户碎片化使用习惯兼容，无法全面推广到社交场景之中。被传播者们相互陌生的关系，也不利于情感沟通。

<strong>　　四、通过移动直播做营销前景如何?</strong>

随着互联网商业形式上的相对固化，内容正日益成为竞争的焦点。视频移动直播行业也是如此，前期用户被秀场模式吸引而来，但之后便会渐渐失去新鲜感，如果没有其他有价值的内容让用户继续留下来的话，用户流失便在所难免，失去了用户的基础，营销效果也就无从谈起。可以预计，视频移动直播在经历前期的秀场拉新之后，即将迎来内容竞争的时代，依靠纯粹的UGC模式在视频移动直播内容生产上是走不通的。比如光圈直播就采取了自制生产内容和合作引入两种方法;映客也在不久前签下了台湾知名自媒体《翎芳魔境》，将与其合作打造国内首档手机直播美食生活类节目。和现在视频网站大战自制剧一样，未来视频移动直播应用之间很可能在自制节目上展开激烈角逐。直播内容的好坏成为营销效果的衡量因素。

除了直播行业商业模式的改进迭代以外，据工信部数据显示，2014年中国移动互联网用户数已接近10亿人，4G用户数已达9728.4万，移动社交行业正在越来越深人地影响人们获取信息、沟通、商务等方式，在庞大的人数基础下，直播营销还会随着硬件科技的发展而进一步强化。AR、VR的迅速普及，4K手机的出现，google眼镜的问世，意味着消费者很快就可以身临其境的观看讲座和参与到发布会中，新想法与新技术结合，可以迸发出无限的生命力。";s:10:"post_title";s:52:"站在风口，移动直播+营销将何去何从？";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:153:"%e7%ab%99%e5%9c%a8%e9%a3%8e%e5%8f%a3%ef%bc%8c%e7%a7%bb%e5%8a%a8%e7%9b%b4%e6%92%ad%e8%90%a5%e9%94%80%e5%b0%86%e4%bd%95%e5%8e%bb%e4%bd%95%e4%bb%8e%ef%bc%9f";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-23 15:25:10";s:17:"post_modified_gmt";s:19:"2016-07-23 07:25:10";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=778";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}