Y��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"560";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-21 12:42:43";s:13:"post_date_gmt";s:19:"2016-07-21 04:42:43";s:12:"post_content";s:12840:"<div class="article-content-bd">

我们已经在之前的文章中提到过，我们在设计Tubik工作室博客中开放了问答平台。最新的一期主要集中在一个问题上，而这个问题必须经过深思熟虑。所以我们请来了我们的同事——来自印度的UX/UI设计师Kenil Bhavsar，同时也非常高兴和Tubik工作室的设计师们聚在一起，针对于这个实际而深刻的话题捕捉到了一堆想法。那么，让我们开始吧。

问题是：什么样的理想化的ux流程，能够使产品具有病毒式传播力？我们通常避免谈论什么理想化，因为这是相当矛盾的范畴。不过，我们非常热切地想分享关于在UI/UX阶段让产品具备病毒传播力的想法。今天我们就跟Medium读者分享这些观点。

&nbsp;

病毒式营销的本质

病毒式营销概念的背后，是能让用户快速理解，以及在用户体验过程和传播过程中，拥有简单的产品自我升级功能。像一种传染性的疾病，它从一个人传染到另一个，并且不需要对这个过程有特别的干预，而是一个顺其自然的过程。这类产品的有机增长来自于推荐和分享。而使得产品在市场上变得更具病毒式传播力，是每一个客户的梦想，因此设计师应当非常敏锐地创造一些东西以期产品变得被广泛熟知。

起初像这种带有“病毒式侵略性”和“感染性”产品的生产，被委托给市场调研机构以及广告商。它们分析目标观众，分析市场，以及根据直接或间接影响愿意分享产品的使用者来制定策略，最后确定市场真实的存在。而在产品传播力提升这一规则圈中，有一个广为熟知的定律：最好的广告是基于个人口口相传的推荐。策略和使得产品具有病毒式侵略性的意义不单单是将产品创造出来，更在于较早地在心理层面以及概念上的创造。

不过，现在病毒式营销远远超出营销过程，特别是涉及到网页或是app产品时。试验证明一些事情值得思考，一些机制应该被应用到UX/UI的设计流程中，目的是使得产品或多或少具有病毒式传播力，从而节约时间、金钱以及整个其他在营销过程中的努力。

&nbsp;

前设计阶段

任何一个设计师都知道前期调研与实际设计创作同样重要。设计应该是基于解决问题以及给出积极的经验，所以它不只是视觉上的，更应该是心理层面的。这一过程对任何类别的产品都是至关重要的，但是如果有想要把产品变得具有病毒式传播力的目标，它就需要更多的关注以及更深的分析。所以，以下是一张关于在这一阶段对于有潜力带有病毒式传播力的产品的清单。

1.     找准关键点再开始

部分产品的失误在于它们总是尝试在一瞬间解决许多问题。这样简单粗暴方式并没有由于在前期经过深度分析，因此对于用户来说很容易搞混，他们一下子不能分辨出产品真正的目的。所以首先要清楚地定义好谁是核心的目标用户，以及什么是主要用户痛点最后怎么帮助他们。不要企图一石二鸟，否则尽管你可以创造一个多功能产品，但却很容易无法进行病毒式营销。最好一步一步扩大目标用户而不是一下子就开始任何事情。

&nbsp;

2.     分析目标用户和潜在的情绪反应

当你已经定义了你的目标用户而且只想通过一张嘴来提升产品，你应该直击它们的心灵和感受。如果你创造出了强烈的感受，你会使大家都在谈论这个产品。因此，你应该分析他们的需求和典型的人口特点来创造显著的情绪反应，这种情绪愿意与他人分享。顺便说一句，这种反映的不同取决于产品的目标不同：你可以敬畏他们，震撼他们，惊讶他们，鼓励他们，迷惑他们——任何强烈的感受将会鼓励用户告诉其他人这种体验，并且与他人分享。

<img src="http://img2.tbcdn.cn/tfscom/TB1Rk_3JVXXXXczXFXXwu0bFXXX.png" alt="" />

Eventflow App concept by Dima Panchenko for Tubik Studio

&nbsp;

3.     维持一个简单的原始想法来团结大家

这里有许多实际的例子关于简单的想法怎样有助于成功，这些想法基于广泛传播的需求，愿望或是习惯。拿Instagram举个例子，一开始只是为那些喜欢展现自己的人提供简单的分享照片的服务，拿Pinterest来说，开始于对简单的有趣的事情的储存。现在有许多大规模的多功能服务不单是为了个人，也有商业上的需求，但是它们开始于非常简单的需求以至于不能以快速和简单的方式满足于许多用户。找到困扰大家的问题是非常重要的，最后能找到解决办法。

&nbsp;

4.     针对共同的问题创造一个独特的解决办法

这里有两个有效的方式使你的产品快速提升，但是首先第一点你要决定你的预期是长期的还是短期的。如果你想要创造一个长期的产品，这就变得非常重要，你的方法是全面的考虑这个问题以及创造一个原始的产品来解决共性问题。这将投入更多的时间和精力，但是这能够走出一条长期的有未来的路。另一个方面，如果你想要让你的名字投入少，快速传播的，这里有一种方法：你可以在现有的流行产品找到缺点和漏洞，然后为他们找到解决办法。这是短期的方法，但这有助于将在已经成熟的产品用户群体里变得知名。

&nbsp;

在以下两个例子中，关注于原创性是非常重要的。不要尝试创造第二个Facebook。应该尝试找到自己产品的特点，它能够解决之前那些产品不能解决的问题或者是使得之前的解决方法更好，更快或者更简单。

<img src="http://img1.tbcdn.cn/tfscom/TB1Yl3aJVXXXXcaXpXXwu0bFXXX.png" alt="" />

Skydeck app concept by Konst for Tubik Studio

&nbsp;

5.     仔细考虑趣味性和娱乐元素

人们喜欢被给予不单单是深层次严肃的事情，更喜欢类似于游戏元素或是有趣的事情。甚至是那些非常科学性或是商业类的产品可以包含一些好玩的元素，这些元素使得产品更具讨论性。

&nbsp;

6.     创造借助朋友能到达到自己目标的需求

在许多案例中，为自己点赞是一种最有效的技术。当你创造了一个伟大的产品，它本身的品质使得人们谈论它，同时也会吸引许多关注力。但是，如果你向其他人承诺一些有用的，能带来好处的东西，他们就会开始在满足自己需求的同时，吸引新的用户直接使用你的产品。好比虚拟储存有更多空间，比赛中有额外奖金或是商品折扣——顺便说一句,这是将用户变为你提升产品最有利的武器。

<img src="http://img2.tbcdn.cn/tfscom/TB11DwcJVXXXXagXpXXwu0bFXXX.png" alt="" />
<p align="center">Event app concept by Tamara for Tubik Studio</p>
所有以上提到的点最好在开始UX/UI设计流程之前就要做出决定，所以在这个阶段你可以依次改进策略。

&nbsp;

UX设计阶段

在设计具有潜在拥有病毒式传播力产品的过程中，主要的目的是尽可能创造愉悦的用户体验。请记住以下几个步骤。

1.创造选择的错觉

用户实际上并不喜欢他们花精力去做某件事情。为了使体验非常愉快，你应该、并且甚至在一些明显的事情上，想一下怎么样创造选择的错觉。用户应该通过导航以及布局而被引导，但同时，他们应该感觉到自己在步骤的制定上才是真正的决定者。一旦缺失这种特征，对于一个拥有病毒式传播力的产品来说是非常危险的。

&nbsp;

2.思考关于游戏性体验

游戏的难度可以非常高，所以并不一定是为孩子准备的。所以产品本身越严肃，它的游戏元素就被隐藏的越深。产品的哪个部分将被直接或间接地植入游戏病毒，这是由你决定的，但是如果你弄明白这些复杂的的事情，它将对产品的传播起到作用。

&nbsp;

3.给予产品感情和灵魂

我们经常听到设计师应该给予产品一部分自己的灵魂。这并不是一个玩笑，特别是遇到具有含病毒式传播力潜力的产品时。设计师必须潜心在任务中、并且像解决自己的问题那样解决它，当设计师透过用户的问题看透它时，它将会给予产品高质量的用户友好度和UX体验。用户不单单是在使用产品，更是在感受产品，感受它的脾性、活力。当设计师创造一个诚恳的，并不是体制化的产品时，用户将会非常喜欢它。

&nbsp;

<img src="http://img3.tbcdn.cn/tfscom/TB1vqUqJVXXXXXlXXXXwu0bFXXX.png" alt="" />

Recipe app concept by Ludmila Shevchenko for Tubik Studio

&nbsp;

4.在用户需要时提供必要的功能

这是在UX阶段中需要思考的主要观点。不只是分析产品的整体概念，更要对用户所要走过的所有步骤进行分析，这些都是有必要的。这个时候的用户体验历程以及案例，对进程非常有帮助。当你仔细考虑过这些问题后，你能够在用户非常需要的时候将这些特点体现出来。这样就容易形成良好的体验，而这些体验将通过推荐传递给其他用户。

&nbsp;

5.与社交网站更快，更简单地做连接

社交网对产品来说是实施病毒式营销的基础。所以怎么样对其操作很重要。你可以简单地用社交网进行登录或是注册，你可以想一下怎么样鼓励大家分享他们的成就，或是告知朋友跟随它们使用你的产品。结果就是创造强烈的以及各式各样的网站表现，也会打开通向产品升级的大门。

<img src="http://img1.tbcdn.cn/tfscom/TB1eQIhJVXXXXcWXXXXwu0bFXXX.png" alt="" />

Echo project by Sergey Valiukh for Tubik Studio

&nbsp;

UI设计阶段

UI的阶段更多的是在网站或是在app产品中的视觉表现，所以很容易觉得在这里没有什么事情可做，因为大多数最重要的病毒式营销的基础已经在UX阶段完成了。其实在这一阶段仍旧有许多可以扩展开来的点，其中也包含我们所关注的产品病毒式营销的重要的点。整理如下：

•使得产品时尚和好看

•确保界面不能过载

•查看功能中应当迭代包含所有有效的解决办法

•UI元素偏向于更加洁简

•创造独一无二的视觉特点（包含图表、吉祥物、以及其他的）

•拥有有趣的动画以及转场

•提供直观的界面和自然的动效

•包含高质量的平面元素

<img src="http://img2.tbcdn.cn/tfscom/TB1CxkfJVXXXXXMXpXXwu0bFXXX.png" alt="" />
<p align="center">Tutorial App by Daria for Tubik Studio</p>
在这一阶段仔细思考高质量的平面元素和细节是非常重要的。依靠产品本身和目标用户，你可以创作出有趣的图表，漂亮的照片，有意思的表格，使得在网站自身或者在体验上拥有视觉吸引力，使得用户不由自主地喊出“真好看！”、或者“真是太时尚了！”，随后这些就将会被分享给他们的朋友或者同事。一般的交流会像这样：“你看见新界面上的那只猫了么？没有？我简直不敢相信，它太可爱了！”这对于产品传播非常有帮助，甚至是当产品在自身问题上并没有获得好的解决办法之时。

&nbsp;

潜在的陷阱：好用VS好看

当你在思考怎么样使得产品从当它还是一个概念的时候就得变得具有病毒式传播力，你就落入两难的境地。一种观点是这种使病毒式传播力成为产品最有力的特点，视觉应当围绕这一点开展。另一种相反的观点则是只有视觉上的特点才能使产品变得具有病毒式传播力。根据上面提到的假设，我们提倡找到平衡点。这就是为什么在不同设计阶段相处不同策略的重要性。当技术的选择取决于产品性质以及目标用户时，这并不意味着你要应用到上面提到所有的策略。然而，仔细考虑所有的策略，应用我们所称赞的这些东西，将会在病毒式营销方面带来巨大的收获。在这个例子中，通过功能性，可用性和好的视觉，你的产品将会变得真正具有病毒式传播力。所有的特点都将会带来有利条件，这点非常重要，它们将会使得用户想要与他人分享产品，进而提升它。

&nbsp;

</div>
<div class="article-comment"></div>";s:10:"post_title";s:33:"病毒式营销中的用户体验";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:99:"%e7%97%85%e6%af%92%e5%bc%8f%e8%90%a5%e9%94%80%e4%b8%ad%e7%9a%84%e7%94%a8%e6%88%b7%e4%bd%93%e9%aa%8c";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-21 12:42:43";s:17:"post_modified_gmt";s:19:"2016-07-21 04:42:43";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=560";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}