T��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"366";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-20 10:27:09";s:13:"post_date_gmt";s:19:"2016-07-20 02:27:09";s:12:"post_content";s:22152:"<h4><strong>患者：找工者和整理癖</strong></h4>
症状：情绪时而亢奋，时而低落，逐渐出现多种人格分裂的症状。可能偶然伴随脸上爆痘痘的情况出现。

本期关键字：<span class="wp_keywordlink_affiliate"><a title="查看 作品集 中的全部文章" href="http://www.uisdc.com/tag/%e4%bd%9c%e5%93%81%e9%9b%86" target="_blank">作品集</a></span>，简历，求职，整理，外面的世界

本期目录：

<img class="alignnone size-full wp-image-192063" src="http://image.uisdc.com/wp-content/uploads/2016/07/ms201607103.png" alt="ms201607103" width="800" height="383" />
<h4><strong>你为什么需要作品集</strong></h4>
1）院校学生:在职场，特别是初入职场的学生，最为弱势。如果你是艺术生还好，在学校的经验能填补作品集的空虚；如果你非艺术生，作品集有技巧的打造，更容易踏入设计师的大门。

2）专业人士:一般，按经验能分为三类。初阶，争取时间多尝试不同的作品；中阶，挑选最具有代表性和针对性的作品；高阶，你这个人本来就是作品。还有超神级，作品已经和人类历史捆绑在一起了。

3）留学党：基本所有国外的艺术院校，都需要准备作品集才可以申请。有趣的是，这份作品集更关注你设计过程的纪录，而不仅仅是最终效果。

4）艺术爱好者：作品集可能是个笔记本，可能是些图片，可能是朋友圈里的动态。形式对你已经不重要，好好享受玩设计的过程。
<h4><strong>一、投递作品集有什么基本技巧？</strong></h4>
坐下来，喝口水，继续作品集话题。下面的文字，主要针对是上面所述前三类人群。如果你研读过《学习之道》，你能体会到技巧，有时候就是快速学习的捷径。针对不同的环境，都能快速找出最佳的路径。
<h4><strong>1）邮箱投递方式</strong></h4>
最常见的投递方式，也是最容易出错的部分。邮箱具体作用是什么大家绝对都很清楚，如果仅仅是平时联系，很多东西确实可以不用那么讲究，可是，真正投递简历方式理应讲究。

邮箱选择的错误：

或许很多人会忽略，当年最酷的邮箱都是@gmail.com。不过，现在由于某些不可抗拒的原因，如果你以它发正式带作品集的简历邮件，往往对象的邮箱收不到。国外的公司和机构在涵盖在此范围内。

邮件标题和正文的不友好：

往往人力资源的邮箱塞满了这类邮件：
“某某某的简历“”，这种标题本身并不友好。就像偌大的超市，一排排货架里只放着”李小鹏设计师“、”王小甜PHP程序员“和”陈大田前端工程师“。那么他们间有什么区别呢？似乎从标题完全看不出来。

附件作品集的打开方式不对：

作品集不要大于10M，相信很多人都知道。最好能有重点的突出与目标公司相关的作品，很多人也明白。

除此，我个人是建议，尽量将作品集附件变成PDF格式。你或许会问为什么？

1）方便全文检索。
2）易于控制正确的打开方式。
3）显得很职业。

<img class="alignnone size-full wp-image-192077" src="http://image.uisdc.com/wp-content/uploads/2016/07/ms2016071017.jpg" alt="ms2016071017" width="800" height="375" />

重要的事情说三遍，没有特殊情况最好用用PDF格式。

辅助技巧：一个好的标题充满信息

清晰地注明你的名字，并适当地添加重要信息。什么是重要信息呢？重要信息指的是让对方快速了解邮件信息的内容，如：对方要求的专业是UI设计，那“UI或界面”字眼就是重要信息了；如果你学的是相关专业，且学校能被大部分人知道，那“学校的名字”就是重要信息了；对方要求的是经验，那“x年相关工作经验”字样就是重要信息了；如果你不是应聘，而是交付项目，那“项目版本（进度）”就是重要信息。
<ul>
 	<li>“应聘XX岗位——XX大学XX专业”</li>
 	<li>“随时可到岗的XX专业XXX——应聘XX岗位”</li>
 	<li>“XXX_应聘XX岗位_X年相关工作经验”</li>
 	<li>“XX项目版本号_XX单位_XXX”</li>
</ul>
辅助技巧：一封邮件里好的正文是有温度

1）正文开头请写上招聘信息中的联系人。
如果招聘信息中，没有写任何人，那么就可以用“尊敬的女士/先生/XXX公司”这样的词句来代替。

2）正文内容要有针对性的写，且不用滚屏即可完整阅读完毕为准。一般招聘信息中都会有核心信息“XX年工作经验”、“会某种技能优先”、“能承受较大的工作压力”等等要求，那么，你的正文就可以把这些要求作为问题，用1、2、3的方式在邮件正文中进行针对性作答。

3）末尾记得落款和添加祝福话语。一句祝福的话，也许不会影响别人对你的判断。但如果你加上了，那样的正文才叫完美。譬如，我每次都会为客户定制一句话『晚安，祝愿你的心情如同月亮一样恬静。』

<strong>小结：</strong>

认真对待每一次简历的投递这样才会得到别人的认真对待。只有自己注意这些问题，才能更方便目标的浏览。
<h4><strong>2）网址投递方式</strong></h4>
网址是线上投递简历另一个很重要的展示渠道。特别是为了证明你有项目经历时，这是证明实际效果的最好例子。本来，作品集就不应该是短期行为。只是在找工作时，才想到临时做作品集，不是很好的习惯。

理论上，每年都应该刷新自己的作品集和简历。就算你不需要找工作，这也是能总结自身，发掘潜在客户的好办法。

<strong>1）考虑对多终端的支持</strong>

我们不知道对方是用什么设备打开你的网址，如果你做的项目恰好对手机适配不是很好，要不就不要放或者标注好只针对电脑浏览。普通的人，看到被缩小的界面，以及可能被积压变形的结构，观看的心情都打折扣了。

辅助技巧：放置适配多终端的网址，没有的话，标明只适配的类型。

<img class="alignnone size-full wp-image-193198" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp201607181.png" alt="lpp201607181" width="800" height="643" />

<strong>2）不用放太多网址</strong>

理论上，每个人时间有限，自己曾经收到一份介绍其项目经验的简历。里面包含着21个网址。当打开邮件，看到那一长条的项目网址时，我的内心是崩溃的。

在很多有经验的人面前，这种做法，显得不专业。理论上，你应该准确描述出哪个是你最得意的作品。哪怕你放100个网址我并不拒绝，只要标明重点项目。其余做辅助处理即可。

辅助技巧：放置小于或等于3个最重要的项目网址。

<strong>3）网址和目标岗位/期望匹配</strong>

如果你想应聘的岗位是UI设计师，却在最重要的地方放置大量涵盖大量平面设计以及室内设计的网址。如果是急着招人的公司，可能有机会面试。如果是面对着大量的求职者，这种做法很不专业。

譬如别人要的是“马”，你却给他很多“牛”。属性上他们一致，都是动物性质。就如同界面设计，平面设计以及室内设计同属于设计领域，但是，其具体操作细节差异是蛮大。

辅助技巧：根据目标职责重新组合你的最强网址配置
<h4><strong>案例：</strong>Ursus Wehrli（TED整理的艺术讲者兼艺术家）</h4>
Ursus Wehrli是个很有趣的人，从他官网就可以看出来。他向我们分享他对艺术的展望。一种更干净﹐更工整的艺术形式。先解构所有当代艺术大师的作品﹐再按着颜色﹐形状﹐大小排列整齐。特别是上面那部TED，对很多设计师的思维拓展很有帮助，简单来说，就是怎么通过整理的方式弄出新的玩法。

网站：<a href="https://www.kunstaufraeumen.ch/en" target="_blank">https://www.kunstaufraeumen.ch/en</a>

讲演《整理的艺术》：<a href="https://www.ted.com/talks/ursus_wehrli_tidies_up_art?language=zh-cn" target="_blank">https://www.ted.com</a>
<h4><strong>案例：</strong>佐藤可士和（知名设计师）</h4>
这个无需多介绍，大部分人都知道他。上面是他早年的官网，也确实在折射他的设计理念。

看了这么多人的东西，你会惊讶的发现，其实他们的站点都有个特征，只能代表TA们本身，换做其他人，这种模式就不成立了。而设计师，我们要学的就是这种独一无二。

<img class="alignnone size-full wp-image-193196" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp201607183.png" alt="lpp201607183" width="800" height="404" />

△ 佐藤可士和官方网站旧版
<h4><strong>3）书本投递方式</strong></h4>
想当年，去公司和美院面试时，都带着一本纸质作品集。相对比屏幕上的设计，纸质的东西更具有人情味。就像这个时代，你收到一封手写的感谢信，会感觉印象深刻。

物以稀为贵，处理不好，带着纸质作品集的风险很大。

<strong>注意错别字太多，语言逻辑不通的问题</strong>

和视觉部分关系不大，却很致命。设计师都是强迫症，纸质的东西印刷出来后不容易修改，需要每次校验。

另外，由于纸张会放大视觉聚焦点，容易发现在屏幕看不到的问题。特别是文字部分，错别字，标点符号的问题会放大。

<strong>清晰的导航目录和适当的作品数量</strong>

清晰适度的作品组合很重要，纸质印刷品尤为重要。潜在目标是以此评估你的能力范围和深度，以及产品和服务质量。10-20项作品数量是合适。太少的话，看上去像业余玩家；太多的话，观看者会感到眼花缭乱。

同时，记得为作品分类，并配置清晰的导航。每一页内容都能让观者知道自己现在看的究竟是什么内容。清晰的逻辑能看出作者是否具备的交互能力。想必，对具有美感且逻辑清晰的设计师，大部分产品团队都不会拒绝这样的人。

<img class="alignnone size-full wp-image-193195" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp201607184.jpg" alt="lpp201607184" width="800" height="400" /><img class="alignnone size-full wp-image-193194" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp201607185.jpg" alt="lpp201607185" width="800" height="533" />

<strong>保持作品节奏，不妨给它们配个小故事</strong>

罗列作品很容易造成平淡的感觉。当每页都充斥着数量相近，质量类似的作品时，翻看的人感受是什么样的？就如同查看一块无任何起伏变化的白纸。

理想情况，罗列作品是要有层级关系，并不是包罗万象。有些作品可能需要花两三页介绍，反之，一页就可以包含一堆作品。

<img class="alignnone size-full wp-image-193192" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp201607187.png" alt="lpp201607187" width="800" height="450" />

<strong>讲讲重点项目的思考过程，而不只是结果呈现</strong>

适当配合些文字，注意板式结构，确实能让作品看上去更精致。特别是在诉说整体设计过程时，思路比最终结果更为重要。其实设计作品并没有好坏之分，因为站在不同的角度看，结果都不一样了。

而判断设计师真实水平应该是整体思路，如何构思，如何呈现，如何沟通，这些才是设计的全部。相信条理清晰的设计师，结果都不会太差。

<img class="alignnone size-full wp-image-193191" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp201607188.jpg" alt="lpp201607188" width="800" height="533" /><img class="alignnone size-full wp-image-193190" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp201607189.jpg" alt="lpp201607189" width="800" height="533" /><img class="alignnone size-full wp-image-193189" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp2016071810.jpg" alt="lpp2016071810" width="800" height="533" /><img class="alignnone size-full wp-image-193188" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp2016071811.jpg" alt="lpp2016071811" width="800" height="533" />

（来源：TransWorld Surf Magazine.作品）
<h4><strong>进阶技巧</strong></h4>
<strong>辅助技巧：拒绝模板，有自己的个性</strong>

模板绝对是扼杀设计师进入更高阶段的挡路石。但凡到高级设计位置，理论上怎么也有自己的一个杀招。在游戏中，每个高阶职业都有特定的招式。

那么，怎么算杀招呢？我记得身边有这么一个UI设计师，他的杀招在图标设计领域，能短时间画出很精致的图标。他的进阶能力是，在5分钟画出1个精致的图标。
<blockquote>客户问他：“如果画错了怎么办？”
他直接回答：“那就重新画一个吧。”</blockquote>
这是如此霸气的回复，十分让人难忘，特别有个性。

以米田为例，职业是视觉设计师。理论上，大致的职业特征和大部分从事这个职业的小伙伴一致。唯一有很大不同的是，我有极强的搜索力，客户提出的要求，我基本能在5分钟响应到可能会有匹配的文字、图片等信息。
<blockquote>客户问我：“为什么能那么快响应到需求？”
我轻敲键盘，回答：“我有个很强大的第二大脑。”</blockquote>
<strong>辅助技巧：与目标属性匹配</strong>

如何判断重点放什么，从需求方需要什么做起，简单来说与目标属性匹配。譬如是专门做Html5的设计职位，放App 界面设计是相似技能；放网页设计作品的有点偏差的技能；放平面设计作品是有点沾边的技能；放室内设计作品是基本脱离的技能。

可能你会说我上一家公司确实就做这些东西，那么劝一句，尽量准备充分点再投递，这么做，从需求方的角度看，其实我们准备的并不充分。

<img class="alignnone size-full wp-image-193187" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp2016071812.png" alt="lpp2016071812" width="800" height="450" />

应对不用的岗位，作品集侧重点应该是完全不同

高手间过招，永远知道在适当的时间给予对方适当的东西。

就像《寿司之神》纪录片里一细节，寿司师傅永远不会问客人，你今天想吃什么？鱼生切得薄一点还是厚一点？因为他最清楚自己手头的食材怎么搭配才是最黄金的组合，会对客人察言观色，捏出最合适的寿司。
<h4><strong>作品集神器</strong></h4>
初作者的作品集：可视化图表、HTML5建站

这两块相信大家已经相对熟悉，每个模块都有很成熟的工具可以使用。具体使用方法在它们的帮助里均有详细介绍。这里只简单以傻瓜式和进阶式罗列相关的工具。
<h4><strong>一、图表类工具：</strong></h4>
这里介绍的主要是拖拽就能生成的图表工具，如果你能用更高级的方法处理，当然时更好的事情。起码，在个性化这块明显能做出差异感。如果你对这块不熟悉，下面的工具应该适合你。
<h4><strong>1）<a href="https://infogr.am/" target="_blank">infogr.am</a></strong></h4>
实时刷新，能支持多终端展示。

<img class="alignnone size-full wp-image-193186" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp2016071813.png" alt="lpp2016071813" width="800" height="440" />
<h4><strong>2）<a href="https://www.canva.com/" target="_blank">Canva</a></strong></h4>
能支持中文，操作更类似于幻灯片，能直接在软件内处理素材。

<img class="alignnone size-full wp-image-193185" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp2016071814.png" alt="lpp2016071814" width="800" height="419" /><img alt="" />
<h4><strong>3）<a href="https://piktochart.com/" target="_blank">Piktochart </a></strong></h4>
与上面的软件类似，不过更专注于处理图表类任务。

<img class="alignnone size-full wp-image-193184" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp2016071815.png" alt="lpp2016071815" width="800" height="466" />
<h4><strong>HTML5类工具：</strong></h4>
与大家熟知的html5一键生成工具不同，下面的工具更为复杂。可实现的交互动画更为强大，自定义部分同样更为丰富。本文这部分不为展开。
<h4><strong>资深者的秘密武器：朋友圈，微博以及任何社交媒体</strong></h4>
行业上均流行着，资深设计师往往不需要投递简历。因为，理论上，你本身就是简历。与普通的一纸简历相比，这种方式更为客观。

如果你了解过大公司的招聘，以及初始团队核心团队的招揽，都能发现，内推是最有效率的模式。内推的逻辑与朋友圈和微博动态相似，与其找陌生人，不如找朋友的朋友靠谱。

与专业能力相比，日常性格与为人处事，这些都很难通过短时间交流准确获得信息。

善于利用社交媒体的人，往往获得的机会要比别人多。当然，如果你的朋友圈充斥着大量无聊，鸡汤，甚至微商信息时，该仔细想想是不是在投资关系了。
<h4><strong>案例</strong></h4>
Juliezhuo （FB产品副总裁，medium活跃设计分享者）
<h4><strong><a href="http://www.juliezhuo.com/" target="_blank">Juliezhuo</a></strong></h4>
她的个人站点很简单，只有大图+常出没社交地点。网站就这么点东西，其他都没有。因为精力有限，同时维护很多网络上的资源是很浪费时间的事情。当你已经在其他地方很活跃时，不妨试试这种直接简单的呈现。

<img class="alignnone size-full wp-image-193183" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp2016071816.png" alt="lpp2016071816" width="800" height="473" /><img class="alignnone size-full wp-image-193182" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp2016071817.png" alt="lpp2016071817" width="800" height="450" />

Juliezhuo分享的内容，普通设计师和高级设计师的不同

不过这确实是她最为核心的标签，你能看到她在这些社群有多么的活跃。
<h4><strong>大神的制作思路：设计外的东西</strong></h4>
大部分真正到这个程度的设计师，已经不是关注设计技巧的人。这时候，设计已经不是一种职业，而是一种认识世界，改变世界，让世界了解你的方式。简单来说，设计已经是一种生活方式了。

当然我是远远没达到这个境界。这群人有个特点，每个人身上都有一个明显的标签。或许与设计有关，或许与设计无关。

最常规的标签：
各种细分设计门类，譬如字体设计，版式设计等

更广泛的标签：
与设计相关的门类，譬如课程营销、搞笑段子、书籍出版、演讲等

最不合常规的标签：
完全垮学科的标签，譬如过目不忘，打咏春拳，骑行西藏，跨越珠峰等。
<h4><strong>案例</strong></h4>
明和电机

（代工公司，设计师以及表演团体）

明和电机(Voice Mechanics) 日本新锐设计及表演团体，以自制的乐器表演并且贩售而闻名于日本。
<h4><strong><a href="http://www.maywadenki.com/" target="_blank">Maywadenki</a></strong></h4>
<img class="alignnone size-full wp-image-193181" src="http://image.uisdc.com/wp-content/uploads/2016/07/lpp2016071818.png" alt="lpp2016071818" width="800" height="450" />
<h4><strong>你还需要注意些基本点</strong></h4>
<strong>1）保证原创性</strong>

原创是每个设计师最起码的职业准则。相对于专业，道德显得更为重要。设计能力不好，其实通过后天培养很容易到达平均水平，但是，人品出了问题就没办法搭救了。

特别是抄袭作品被发现时，是会遭到整个行业的鄙视。特别是在面试时，被发现出了这个问题，就和学历造假，工作经验造假一样，直接被毙了。

原创是作品集最能表现与众不同的地方。

<strong>2）尽量有礼貌</strong>

相信有礼貌的人，人缘都超好。我还清晰记得一同事，无论晴天雨天，每天到办公室必然向每个人都问好。受他感染，我现在发出去的每封邮件结尾处必然留有一段祝福话语。譬如，“夜深了，月亮和我说明天会转冷，记得多穿件衣服。”

每次我见面试者，同样会问他们亲手倒杯水，双手端好递到他们面前。虽然你是面试官，但是我觉得这是对每个能来的人，最基本的礼貌。

有礼貌的作品集，本身也在体现着你的素质。

<strong>3）做个好奇的人</strong>

这就不必展开了，好奇心是驱动忍不断学习的原动力。特别是对新事物的敏锐度，这点学生，刚毕业的人以及创业者都表现得很好，对周遭也充满着好奇。

回想一下，职业生涯里，进步最快的时间，是不是就是上述的时间节点？

当作品集技能里出现新趋势的名字，必然是加分项。
<h4><strong>总结</strong></h4>
打造完美作品集，其实一点也不简单。可能只是短短数页，甚至一页纸的内容，却要求你浓缩数年的东西。

反过来想，其实它更像每段人生都总结。不一定是要找工作时才草草勾勒，更多是要求我们平时善于整理与归纳。

作品集，对于工作只是敲门砖。而对于自己，那就是一段段完整的人生，一段没有办法走回头的路，且做且珍惜，加油。";s:10:"post_title";s:66:"腾讯高级设计师：如何规划有格调的设计作品集？";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:198:"%e8%85%be%e8%ae%af%e9%ab%98%e7%ba%a7%e8%ae%be%e8%ae%a1%e5%b8%88%ef%bc%9a%e5%a6%82%e4%bd%95%e8%a7%84%e5%88%92%e6%9c%89%e6%a0%bc%e8%b0%83%e7%9a%84%e8%ae%be%e8%ae%a1%e4%bd%9c%e5%93%81%e9%9b%86%ef%bc%9f";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-20 10:27:09";s:17:"post_modified_gmt";s:19:"2016-07-20 02:27:09";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=366";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}