��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1065;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-26 19:32:22";s:13:"post_date_gmt";s:19:"2016-07-26 11:32:22";s:12:"post_content";s:7146:"相传1917年，当广告教父奥格威还是个撒尿和泥的6岁男孩时，在美国的圣路易斯，几家广告公司为了杜绝价格恶性竞争，歃血为盟要定下行业规矩---联盟中的广告公司在为客户做投放时必须要收足媒介广告刊登费的15%作为佣金，否则就会被逐出协会……而近百年后，高达15%的佣金早已成了广告公司想都不敢想的传说，但这个组织不仅奇迹般地活下来了，且获得还挺滋润。没错，它就是4A（American Association of Advertising Agencies）

<img class="load" title="今年已经 99 岁的 4A 为什么还没有死？" src="http://file.digitaling.com/eImg/uimages/20160725/1469430471557127.jpg" alt="今年已经 99 岁的 4A 为什么还没有死？" width="400" height="200" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160725/1469430471557127.jpg" />

不可否认，作为广告行业的旗帜和代名词，4A曾经是无数广告新人魂牵梦绕的圣殿，只要挂上4A的招牌无论是哪间公司都值得去膜拜投靠。当然，赢得过多少赞美就必须得吞下多少诋毁。几乎每年都必要有几位大咖专家跳出来痛斥4A已近日暮。2004年，曾合著过《定位》的里斯满腔怨念地扬言“公关第一  广告第二”，而后各类4A广告公司里的人一边出逃，一边叫嚣着要“革4A的命”、“要成为升级版的4A”……再然后，数字营销兴起4A又是众矢之的，传统电视广告占比稍有下降，一群人就竭力唱衰传统4A；再碰巧赶上某家4A公司北京办公室的开开关关，转身就被演绎成4A广告已经风雨飘摇……

但，十多年过去了，几家知名的4A广告公司如今依旧生龙活虎，掌握着大量优质的客户，赚着让同行艳羡的策略顾问费，同时触角早就渗透到了公关传播、数字营销层面。人们不禁要问，为什么99岁了的4A还不肯死呢？
<h3>一、4A代表着营销领域的系统和理念</h3>
从逻辑上讲，广告、公关、数字营销……本应属于同一个层面，都肩负着品牌或产品信息传播扩散的工作，只是所使用的媒介平台和手段略有不停罢了。而在其之上，负责统筹指导它们工作的理论体系应该是<strong>【市场营销】</strong>。

<img class="load" title="今年已经 99 岁的 4A 为什么还没有死？" src="http://file.digitaling.com/eImg/uimages/20160721/1469110710525137.jpg" alt="今年已经 99 岁的 4A 为什么还没有死？" width="600" height="277" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160721/1469110710525137.jpg" />

只可惜近现代（尤其在中国）市场营销起步太晚，企业主们往往已经习惯把有关卖点、产品包装、用户调研、定价、竞争区隔（定位），甚至是促销活动的服务等市场营销范畴的工作，统统交由广告公司去做。这使得广告行业积累了丰富且广泛的经验，而4A广告公司作为业内翘楚，拥有者更多的资金和资源，很快便提炼出大量观点和经典理论，进而为市场营销构建出较完整的理论体系。

<img class="load" title="今年已经 99 岁的 4A 为什么还没有死？" src="http://file.digitaling.com/eImg/uimages/20160721/1469110753298537.jpg" alt="今年已经 99 岁的 4A 为什么还没有死？" width="600" height="246" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160721/1469110753298537.jpg" />

几乎所有的企业及从业人员都曾在广告行业中汲取过市场营销知识，大部分营销著作也出自广告大师之手。大家对广告行业的认知早已不是单纯的[广告]而已。就这样，牢牢握住[上层建筑]的4A广告公司，获得了不可比拟的竞争优势。这就像是，一位参与过教科书编写的童鞋，怎么可能在考试中不及格呢？
<h3>二、4A代表着一个成熟系统，有适应力和自组织能力</h3>
人们常说“拳怕少壮”、“青出于蓝而胜于蓝”，但真正纵横武林笑到最后的霸主大多是老谋深算的掌门人，这道理放诸广告营销也适用。中国消费者对新科技新形式有着难以理解的痴迷，从博客、人人网、到微博、微信，再到现如今的直播，任何新平台的出现都会激发起消费者和企业极大的兴奋，不假思索的投身其中。而在浪潮下一些对新技术更敏感、出拳更快的公司甚至是个人都有机会脱颖而出，社会化媒体、HTML5、内容营销成就了不少“弄潮儿”。

但当技术和平台已经不够新鲜，后期在市场营销的就变成了创意&amp;资源的比拼，这时4A广告公司的竞争优势便凸显出来了。更精致的创意，更完善的媒体组合规划，更丰富的资源关系和更雄厚的资金，为更多知名企业提供了更好的营销服务，也有机会制造更多的获奖案例。

这就像是一个拳场上的老油条，挨上几拳后马上就评估出新打法的特点，并利用经验和成熟的套路迅速将比赛节奏拉回到自己擅长的领域，并最终成为赛场的获胜者和市场利益的收割者。
<h3>三、4A代表着行业最认可的标准和实力</h3>
想判断一个组织系统是否具备强劲的生命力，看看加入它和离开它的个体质量就够了。在中国，无论本土广告、数字营销、甚至是知名公关公司，只要企业发展到一定阶段都会非常迫切的希望获得“4A”（本土）的资格，哪怕之前它们是如何咒骂4A的落后和僵化，此刻为了入会也都得按照标准逐条达到。何故？不外乎名和利，在这样一个大的利益共同体中，每家公司不但能喝到汤，还有机会一起分蛋糕吃肉，轮流登台领奖，这要比单打独斗轻松得多。

另一方面，且不说跨国公司大多与4A广告有着纠缠多年的旧交，中国企业的市场部往往藏着这样一个潜意识---“如果有钱的话，老子一定要请家4A广告公司来服务我”，这跟国人对待奢侈品牌的观念一模一样。无论企业基于的真心向往还是存心为难，“有钱就请最好的”这理由已经帮4A广告公司赚的钵满。

这样的威逼利诱下，无数之前口出狂言的叛逆小子，最终都乖乖的接受了招安，不管体系是否真的完全接受了他们（鄙视链上4A公司还是会鄙视所谓本土4A），但每少了一个质疑对抗的对手就意味着4A的影响力增加一分，寿命血槽就多增加一格。
<h3>结  语</h3>
所以，无论营销风向如何变化，也无论4A体制下个别公司的兴衰，只要市场营销的理念和体系没有被全盘颠覆、只要在4A体制下仍可以输出大量的利益、只要没有同样庞大的组织产生，4A就一直会保持着旺盛的生命力，4A广告公司就一直会是市场利益的沉稳收割者。反观那些实力不济却期待踩着4A名头上位的公司和专家，也许早就飘零在四方了。";s:10:"post_title";s:50:"今年已经 99 岁的 4A 为什么还没有死？";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:134:"%e4%bb%8a%e5%b9%b4%e5%b7%b2%e7%bb%8f-99-%e5%b2%81%e7%9a%84-4a-%e4%b8%ba%e4%bb%80%e4%b9%88%e8%bf%98%e6%b2%a1%e6%9c%89%e6%ad%bb%ef%bc%9f";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-26 19:32:22";s:17:"post_modified_gmt";s:19:"2016-07-26 11:32:22";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1065";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}