�ːZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:764;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-03-23 13:54:12";s:13:"post_date_gmt";s:19:"2016-03-23 05:54:12";s:12:"post_content";s:7856:"编者按：新手设计师最担心的，可能是停留在软件操作层面迟迟无法进阶，所以今天提到的这10个好习惯，大家不妨试一试，无论是审美、职场还是个人品牌，都附有简单干练的方法，建议阅读哟。
<div class="post-body">

想想看我们周围生活的一切都是从设计开始的。你的办公桌、鞋子、手机……电脑、床，甚至平时用的书夹，还有跑步时产生的想法都是设计，可见设计师有多么的重要。

设计师让世界看起来更加的美好，由于互联网的便利，我们每天花费大量的时间在网上浏览学习，我们能看到世界各地的优秀的设计师的作品，同时越来越多个人网站和优秀的设计师出现。

那么如何成为一名优秀的设计师呢？希望下面这10个习惯能够帮助你

<strong>1，找出你最擅长的</strong>

设计涉及很多的方面，无论你掌握多少技能，总有一方面是你最擅长的，而且在这一方面你一定是不断的超越自己，设计出一个比一个精彩的作品，那么这个方面就是你的优势。

找出你最擅长的并且坚持下去，它能成为你赖以生存的技能，希望在你的设计生涯中能够做出一个伟大标志或者网站，让人们看到它们就能想起你的名字。

专注是你成为优秀设计的第一步。

<img title="640.jpg" src="http://www.mijishe.com/upfile/201607/2016071156206093.jpg" alt="640.jpg" data-bd-imgshare-binded="1" />

<strong>2，学做你不擅长的事</strong>

虽然集中精力做一件事你终会成名，但是也不意味着不关心除设计之外的一切事物。可能你在其他的领域虽然不像在设计这方面做的这么好，但也不意味你要彻底放弃它。

记住，成为一个伟大的设计师之前，先要成为一个多才多艺的什么多可以做的艺术家。

另外，如果把那些琐碎的工作细化那么你提供的服务范围再宽泛也能够被消费者接受，而这些额外的收入正是来自于你逐渐的专业化。

<img title="2.jpg" src="http://www.mijishe.com/upfile/201607/2016071156227377.jpg" alt="2.jpg" data-bd-imgshare-binded="1" />

<strong>3，练习、练习、再练习</strong>

即使你已经成为优秀的设计师，也应该永远不要停止练习。有经验的设计师会找各种方法来练手而且也懂得短暂的假期回来之后更容易进入最佳状态。

在个人项目中，你可以得到大量的练习和成长，也能定期的学习，有人说需要一万个小时才能成为伟大的设计师，不能确认这句话是不是100%真实的，如果目标是一万个小时的话，你需要做的就是尽可能的多练习。

<img title="3.jpg" src="http://www.mijishe.com/upfile/201607/2016071156278173.jpg" alt="3.jpg" data-bd-imgshare-binded="1" />

<strong>4，多获取反馈</strong>

每个人的生活习惯都不相同，不能总打着“艺术许可证”的标签让用户使用你的产品。

一个好的设计师具备的特点之一的就是处理反馈意见的能力，无论是正面的还是负面的。其实负面的反馈意见比正面的反馈意见能反映出更多的问题，也有利于产品的优化，当然，正面的反馈可以提高我们的信心。但是负面的反馈能够让我们冷静下来，思考和分析不足，这也是一个不错的学习方式。

做了改进之后，再去听取用户的反馈，让听取反馈成为你工作必不可少的一部分。

<strong>5，每天寻找灵感</strong>

可以找几个你喜欢的设计师，多看他们的作品，分析他们的手法，了解他们的设计思路，观察他们的灵感来源，然后回到你的作品中，你会发现你的创造力得到了提高。

周围的生活也能给你带来灵感，可以确定一个方向或者想一下你下一步该做什么，写下你的目标让你灵感去指引你追求的东西，这也意味着，你的灵感是有选择性的，这个选择性体现在你的工作上。

<strong>6，建立自己的品牌</strong>

为了获取灵感也不意味着需要去模仿别人的一举一动，虽然模仿是成长最快的方式，但是它并不能使你成为优秀的设计师。

建立自己的风格，寻找最适合自己的方法，并将它们运用到你的工作之中，让用户看到产品就能知道这是你的作品。

不要害怕尝试，在你之前已经有很多的设计师这样做了，拥有自己的风格后你会有自己的标志，你会更加大胆富有创造力，一旦你建立了自己的品牌，就需要建立一个可以鼓励别人正面的形象，而不是负面的。

教程：《酒香也怕巷子深！超实用的设计师个人品牌打造指南》

<img title="4.jpg" src="http://www.mijishe.com/upfile/201607/2016071156302329.jpg" alt="4.jpg" data-bd-imgshare-binded="1" />

<strong>7，了解最新的知识和趋势</strong>

设计是一个不断学习的过程，需要我们不断的去浏览学习新的东西，不断的去了解整个趋势，比如logo、颜色，甚至是一些小众领域，如婚纱设计。

设计没有对错，但是如果非要说一件在设计方面对的事的话，那就是设计总是在不断的发展、不断的变化，这也是为什么要不断的更新自己的知识。如果你不了解新的趋势和新的工具，就只能被社会淘汰。

学习最新的趋势，可以到优设搜索VR设计。

<img title="5.jpg" src="http://www.mijishe.com/upfile/201607/2016071156325781.jpg" alt="5.jpg" data-bd-imgshare-binded="1" />

<strong>8，剔除无用的评价</strong>

在听取积极和消极的反馈时，我们也应该知道哪些该听哪些不该听，如果全部都听取，那就永远建立不了自己的品牌。毕竟总是会有人对你的作品指手画脚的。

关于反馈可以划定一个范围，还记得写下自己的目标吗？设置一个范围反思在这个范围内有哪些做的不好的地方，朝着自己的目标去努力。不要试图去寻求每一个人的认可，不然到最后你会发现你已经不是一名设计师，而是被人指挥的木偶。

<strong>9，注重细节</strong>

有没有发现自己会说“差不多”就行了。

作为一名设计师，这不应该是你的口头禅。记住、人眼是很厉害的，你没注意到的细节，别人会注意到，而这些细节会决定你的成败。

不要满足“差不多”试图做到“太棒了”！

怎么做到？通过注重细节。

确保每一行，每一个曲线，每一个点，每个像素都准确的放在它们该在的地方。可以通过放大镜检查每一个像素，不要因为一些不该犯的错误丢掉自己的客户。

<img title="6.jpg" src="http://www.mijishe.com/upfile/201607/2016071156344237.jpg" alt="6.jpg" data-bd-imgshare-binded="1" />

<strong>10，有选择的接项目</strong>

如果你入行的时间足够长的话会发现一些事情。

客户找你时会说，因为喜欢你的设计所以才找你。但是当你把成品发给他们之后，又会让你改来改去，因为这不是他们想要的。

在接单子之前，确保客户真正的理解你的工作，了解你的设计风格，不要仅仅因为他们是出钱的甲方就一直听他们的改改改，这可能会让你失去设计师这个身份。

设计行业是个不断变化的行业，但是万变不离其宗，都是围绕着最基本的原则变化的，所以不要忘记基本的知识，基础知识永远是你没有灵感时大脑挤压出灵感的来源。

<strong>那么，说了这么多</strong>，

<strong>你准备好成为下一个伟大的设计师了么？</strong>

</div>";s:10:"post_title";s:53:"不做美工！10个好习惯成为优秀设计师！";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:155:"%e4%b8%8d%e5%81%9a%e7%be%8e%e5%b7%a5%ef%bc%8110%e4%b8%aa%e5%a5%bd%e4%b9%a0%e6%83%af%e6%88%90%e4%b8%ba%e4%bc%98%e7%a7%80%e8%ae%be%e8%ae%a1%e5%b8%88%ef%bc%81";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-23 14:32:09";s:17:"post_modified_gmt";s:19:"2016-07-23 06:32:09";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=764";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}