��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"2311";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-09-09 19:17:12";s:13:"post_date_gmt";s:19:"2016-09-09 11:17:12";s:12:"post_content";s:8980:"<blockquote>既然三年是道坎儿，就理应找些法子给跨过去。想知道？且听作者娓娓道来。</blockquote>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/09/daokan.png"><img class="size-full wp-image-411458 aligncenter" src="http://image.woshipm.com/wp-files/2016/09/daokan.png" sizes="(max-width: 680px) 100vw, 680px" srcset="http://www.woshipm.com/wp-content/uploads/2016/09/daokan.png 680x, http://www.woshipm.com/wp-content/uploads/2016/09/daokan-404x190.png 404x" alt="daokan" width="680" height="320" data-original="http://image.woshipm.com/wp-files/2016/09/daokan.png" /></a>

今天又来聊职场，起因是看到一条后台留言，比较有感触。这条留言是这样说的：
<blockquote>亮叔，你一直都写一些针对刚毕业或者是零基础的运营推文。能请教你，毕业2年的运营要怎么认清自己的位置吗？最近在找工作，毕业两年，做过新媒体运营，活动策划运营，产品运营，给我offer 的公司都是一些类似微商的电商公司，或者是薪资没达到要求的互联网公司。想当初自己是鼓起勇气放弃教师投奔互联网大潮的，现在竟然觉得迷茫，感觉很对不起当初的自己，没做出点成绩，更加对不起未来的自己。虽然我知道这种问题应该要自己想清楚，自己解决，但，我就是想跟亮叔聊一聊而已。</blockquote>
看了其实挺有感触的，虽然我的回复很简单：
<blockquote>通常其实是三年一道坎，2年的话，确实没办法有更多的筹码，除非你做的非常牛逼，但牛逼是需要运气的，即使你方法论都对也是如此。你可以考虑去薪资没达要求，但规模较大一些的互联网公司，这样，运气至少会好一些。</blockquote>
后来得知提问的同学自己的想法和我的建议基本一样，我很欣慰。但是在这里，可能就得聊聊这件事儿了。
<h2>第一道坎儿是三年</h2>
如果你细心，去51job、智联招聘，或者拉勾、内推等等招聘平台上去看，通常在工作经验的分类上，大家出奇的一致：1-3年，3-5年，5-10年，10年以上。

另外还有两个选项，一个叫「不限」，一个叫「应届毕业生」。当然，你可能会困惑，不限和应届有啥区别？

区别是，你可能不是一个应届毕业生，但你对你想要从事的行业或岗位并没有对应的工作经验。

所以，你要明白，通常我们在说工作经验时，谈的是：<strong>在某一行业或某一职位上，有匹配的工作经历的年限。而不是，你开始工作到现在的年限。</strong>当然，如果你一直是从事某类岗位，那么其实是可以这么算的。但是，如果你工作了5年，其中干了2年程序猿，后来干了3年产品经理，那么这件事情，其实就有点尴尬了；而如果你工作了10年，其中5年在快消品做销售，后来5年在互联网做商务，那其实比之前那个例子会更尴尬。

跑题了。

<strong>为啥第一道分水岭是3年而不是2年呢？</strong>

让我们先来做个算术题：

正常来说，一年的工作日是250天，那么，两年就是500天，三年是750天，不算加班，8小时工作制；那么，一年的工作时间是2000小时，两年是4000小时，三年就可以达到6000小时，五年是10000小时，十年是20000小时。

这个算术谁都会。

那么，下来是个小统计。

如果你肯把工作年限与工作机会放在一起比的话，你大概可以看到：

<strong>拉勾：</strong>
<ul>
 	<li>拉勾的运营类目下，应届生的机会是9页；</li>
 	<li>1-3年和3-5年一样，是30页；</li>
 	<li>5-10年是19页；</li>
 	<li>10年以上是6个。</li>
</ul>
<strong>51job：</strong>
<ul>
 	<li>51Job的运营关键词下，无经验要求是6000个不到；</li>
 	<li>1-3年是20000+个</li>
 	<li>3-5年是10000+个</li>
 	<li>5-10年是8000+</li>
 	<li>10年以上是1000+</li>
</ul>
其他的我懒得看了，但结果应该差不多。你会发现3年这件事情非常有意思，你去看1-3年经验，基本都是「专员」岗位，3年以上的工作机会，「专员」出现的少了，「经理」开始多起来，而5年以后「资深」的字眼开始出现，10年以上，基本都是「总监」和「VP」级的岗位了。为什么呢？

因为通常，一个优秀的人才，从刚进入行业做专员开始，最快也需要2年的时间才有机会成为一个小团队的Leader。如此一来，第三年通常就是作为Leader的工作经验，所以你经常会看到3-5年经验的「经理岗」都会要求「至少1年的管理经验」。

于是，当你只有2年工作经验时，你会发现根本不太可能拥有管理经验，而更多时候只能继续做一个小运营。这个时候，你想要求更好的薪资，就有点困难。<strong>所以，三年为第一道坎，有它的道理。</strong>
<h2>如何跨过这道坎</h2>
<h3>1、时间</h3>
时间到了，自然也就到了，但工作满了3年，可未必等于你获得了3年的工作经验。所以，时间只是一个必要条件。这个说法比较拗口，但是你仔细想想就明白了。

有人工作负荷比较满，有人则比较轻松，而轻松的工作，通常对刚入行的新人来说，获得锻炼的机会就少。

不同岗位的人，处理的事务是不同的。
<ul>
 	<li><strong>专员</strong>：你会忙于写策划、做测试、分析数据追求自己KPI完成的情况；</li>
 	<li><strong>经理</strong>：你会忙于安排别人的工作，向领导汇报，激励团队前进，考虑人员招聘；</li>
 	<li><strong>总监/VP</strong>：你要考虑如何分配不同team的工作，怎么去平衡上面给予的预算，向哪项业务倾斜，调动经理们的积极性，向更大的领导汇报，要求更多的资源，各个小组的架构人员需求，同时要考虑去协同不同业务模块，平衡各方的利益诉求。</li>
</ul>
如果你入行太闲，你的磨练就不够，那么看起来好多年的经验，其实没什么大用。

所以，我一直说新人应该忙到飞起，这样，配合良好的工作习惯，你的进步是会非常巨大的。
<h3>2、习惯从结果出发考虑问题</h3>
3年后，我希望成为一家公司的内容运营经理，请问，我现在应该怎么做？很简单，看看所谓的「运营经理」的JD要求是什么，然后看看自己缺少什么。把自己当作产品，定一个运营的KPI，并且去实现。既然你善于做运营，那么，就拆解KPI，匹配资源去达成目标。
<h3>3、做好时间管理</h3>
我来到新公司，有一大堆的事情要处理，简单列列：
<ol>
 	<li>熟悉业务</li>
 	<li>了解团队及跨团队沟通</li>
 	<li>处理各种人际关系</li>
 	<li>招募人员</li>
 	<li>制定工作计划并落地</li>
 	<li>各种汇报</li>
 	<li>各种合作邀约与分享讲课</li>
 	<li>个人公众号维护</li>
 	<li>欠出版社3本书</li>
 	<li>家庭生活</li>
</ol>
事情真的是一大堆，经常是上班9点半，下班8点半，路上1小时，回家陪陪小朋友，和老婆家人聊聊天，然后写稿写到凌晨，碰上有邀约，周末各种飞。
<blockquote>一个字：累。</blockquote>
我的时间管理能力不算很强，但其实已经可以从中受益匪浅，不强的原因，是因为早年没有意识到这件事情的重要性，习惯不够好。所以，不管你是新人还是有2、3年工作经验的人，时间管理这件事情，越早做越好。
<h3>4、随缘</h3>
并不是所有的人都能成功的到达彼岸，所以，始终要记得「随缘」。笔者曾经就干过好心办坏事儿，最后把通报奖励变成了通报批评。所以，「随缘」这件事儿还真的挺重要的。
<h3>5、跟对人</h3>
我至今都非常感激我头两份工作的领导，两位都是女性，但是她们给了我非常自由的空间，让我可以随心所欲的完成我的构想，并一步一步地走到今天。
<ul>
 	<li>第一任领导是主编，她说，你想做什么你就去做，但你要为你做的结果负责。</li>
 	<li>第二任领导是项目组的经理，她说，公司有资源，你有想法，那你就把你的想法落地，看看公司的平台能带给你什么。</li>
</ul>
于是，在她们的支持下，我一入行就在一个每天百万UV、千万PV的博客社区，然后又在盛大积分这样领先的积分计划里浸淫了5年，现在才能获得一点点小成绩。
<h3>#专栏作家#</h3>
张亮，微信公众号：zhangleo1983，人人都是产品经理专栏作家。知乎大V，互联网从业者；《从零开始做运营》作者。聊产品聊运营，偶尔深度。分享一切有益有趣的内容。";s:10:"post_title";s:102:"既然三年是道坎儿，就理应找些法子给跨过去。想知道？且听作者娓娓道来。";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:198:"%e6%97%a2%e7%84%b6%e4%b8%89%e5%b9%b4%e6%98%af%e9%81%93%e5%9d%8e%e5%84%bf%ef%bc%8c%e5%b0%b1%e7%90%86%e5%ba%94%e6%89%be%e4%ba%9b%e6%b3%95%e5%ad%90%e7%bb%99%e8%b7%a8%e8%bf%87%e5%8e%bb%e3%80%82%e6%83%b3";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2017-02-06 18:46:10";s:17:"post_modified_gmt";s:19:"2017-02-06 10:46:10";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=2311";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}