��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"905";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-25 21:23:49";s:13:"post_date_gmt";s:19:"2016-07-25 13:23:49";s:12:"post_content";s:8258:"最近身边经常有学员或者同事向我诉苦，说他们跟甲方、上司没法沟通或做设计没有灵感和方向之类的问题。我大概收集了以下他们的描述，整理写了今天这篇分享，称不上教程，算是我平常跟客户沟通的一些方式和注意事项。

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/07/yyy20160719.jpg" alt="yyy20160719" width="720" height="253" data-bd-imgshare-binded="1" />

我相信，许多设计师都跟我一样，要是客户跟我说了上面那些话，我会感觉受到十万点的伤害。但是有时候，我们其实反过来想一想，会不会是因为我们设计前期的沟通工作没有做到位，或者根本没有做，拿到需求就盲目的在网上找案例，做方案。最后往往白忙活，花费了很多的尽力去修改方案。
<blockquote>所以我认为：“其实设计师就像医生，而每个客户都有病。”</blockquote>
通常病人不知道自己有什么病，他只会告诉你他那里不舒服。而我们要做的，就是通过他的病症，给他使用合适的药物。并且告诉他，什么药不能吃！所以你不能直接问他你想吃什么药？他肯定不知道。他要是知道，就不会来找你。

这就为什么我们设计师平常在跟客户沟通，问他想要一个什么样的设计，往往得不到一个明确，具象的答案。因为他可能压根就不知道。一般他们最直接的方式，就是让你去做几个方案先让他看看，然后再跟你说他哪里不喜欢，或者他想要什么样的。往往这个时候其实并不是他在耍你，可能只是你前期的沟通工作没有到位而已。

那我们要怎样的沟通，才能得到我们想要的讯息和客户的真实需求呢？这个过程，我总结了三个关键点：
<h4><strong>1，给他出选择题</strong></h4>
选择性提问的方式，能让你更加快速的清楚客户内心的想法。重要的，是让客户自己更明确知道自己想要的设计，是一个什么样的。这个过程能让客户内心的想法更加的具象化，这是非常重要的一点。
<h4><strong>2，不要轻易认为客户不懂设计，审美低下</strong></h4>
确实大部分客户确实没有我们了解设计这份工作，包括审美。但这只是每个人的生活环境，所受的教育不同所导致的，是一种很正常的现象。但他可能比你更加的了解他所处的行业。
<ul>
 	<li>这个行业的属性、风向。</li>
 	<li>他所在公司的理念和特征。</li>
 	<li>他想通过这次设计所达到的目的。</li>
 	<li>以及之前的设计所给他们带来的实际效益和不满意的地方。</li>
 	<li>甚至是他对手公司的情况。</li>
</ul>
这些，都是他比你更清楚的地方。也是你可以了解的方向。通常情况下，前四项是值得你挖掘的重要讯息。
<h4><strong>3，沟通时，千万不要说“我觉得”、“我认为”</strong></h4>
像这类主观性质强烈的词汇。这会让客户对你的建议，保持强烈的怀疑态度。就好像你去看病，医生对你说：“通过你的描述，我认为你可能是某某病症。”“我觉得你可能要吃这个药物试试。”我相信你的第一反应，也会感觉像是当了一回小白鼠。从而觉得这个医生不靠谱，感觉自己被坑了。

那么当设计师对客户说：“我觉得你应该用这个版式、字体和颜色。”或者“我认为这样好看或不好看。”的时候，换做你，你会怎么想？

说完三个关键点以后，我们再讲讲在沟通之前需要做的四件事儿
<h4><strong>1，了解你的沟通对象，他目前的情绪状态</strong></h4>
沟通前可以通过他身边的人简单的了解一下，他目前的状态，以免触碰到霉头。也不是没有过一些客户，在自己被上司批了一顿以后，反过来向下属发泄的事儿。通常这种时候，你要是去了，估计根本聊不下去，因为他现在还沉浸在自己的情绪里。
<h4><strong>2，充分了解你手头上的资料</strong></h4>
这些信息是否有重点?有没有划分层级关系？如果没有，你在和他沟通之前，最好通过自己的理解，划分两到三个方案，并在你与他沟通时，发现他自己也不明确方向的时候，向他提出你的解决方案，让他有所选择。这样做能有效的节省你们的沟通成本，并且体现出你的思考过程。
<h4><strong>3，大致了解他本次设计的目的</strong></h4>
提前梳理好你对这次设计，他想要达到的目的，好在沟通时与他进行确认。确保在设计前，双方对本次的设计的目标达成共识，为后面减少不必要的麻烦。
<h4><strong>4，了解一下客户的喜好</strong></h4>
他大概喜欢什么风格、颜色、调性的设计。投其所好的沟通，往往能让你们的交流变得轻松愉快。很大程度上，直接的减少了你修改方案的机率。

剩下的我们就进入了正式沟通的环节。我相信，如果你做好了之前所说的准备工作，这次的沟通相对来说会变得比较顺畅。

做好了准备工作，接下来我们做好这三件事情就够了
<h4><strong>1，用对方听得懂的语言表达你的观点和建议</strong></h4>
有些时候专业术语并不是让你显得专业的有力武器，往往你讲的一些话，如果对方听不懂，你又需要花费大量的时间去解释，这样既会消磨对方的耐心，又会给你们之间后期的沟通制造障碍。
<h4><strong>2，使用的案例直接点</strong></h4>
我们经常会遇到一些客户提出一些比较模糊的观念，比如说：我要高端、大气！但往往客户理解的大气和我们所了解到的是有出入的。这个时候我们要让这个大气变得更加具象一点。

比如问他：“您要的“大气”是指地产行业那种金碧辉煌的“大气”？还是航天行业广阔蓝天的“大气”？还是政府部门庄严肃穆的“大气”？

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/07/yyy20160719.png" alt="yyy20160719" width="800" height="105" data-bd-imgshare-binded="1" />

有此可见，光是一个“大气”！只是简单的通过行业属性划分，都能衍生出这么多不同的设计方向。那他要的高端、奢华、有内涵呢？

所以在我们沟通时，要尽可能的，把他们的要求变得具象，可视化。
<h4><strong>3，站在设计师的角度帮他思考问题</strong></h4>
这一点，对他来说也是尤为重要，而且这也是我个人认为“设计师“这个职业存在的价值。我们之前说过，在沟通前，要了解很多东西，比如客户的情绪状态，他的目的，喜好。但做这些准备并不是为了去讨好他，而是是为了让这次沟通能更好的从根本上了解他们的难题，以及他想达到的目标。那么到了最后环节，我们通过沟通，明确了他的需求，了解了他的喜好。最后我们需要帮他们分析：
<ul>
 	<li>他所喜欢的，是否适合他公司本身的调性。</li>
 	<li>他所想要的效果，是否解决了他的需求。</li>
 	<li>他的要求，是否会给他的用户造成不好的体验。</li>
</ul>
所以并不是整个设计过程中，都围绕着他的喜好来，而是要在最后实事求是的更具他的需求给他选择最合适的方案，这才是最重要的。

总之，在沟通的过程中时刻记住沟通的目的，控制好自己的情绪，牢牢记住你即要站在自己的角度（设计师）想问题，又要换位思考，站在客户，甚至客户的客户的角度想问题。这样，他才能更加容易接受你的建议。

最后，一般来说，都是皆大欢喜，但是有时候，碰到了执念很深的客户，那你只需要做好两件事：
<ul>
 	<li>用你的专业知识表明他想法的方向错误。</li>
 	<li>按照他的要求来进行。</li>
</ul>
这样就可以了。

不然，你还想弄啥嘞！！";s:10:"post_title";s:38:"10个助你减少改稿的沟通技巧";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:110:"10%e4%b8%aa%e5%8a%a9%e4%bd%a0%e5%87%8f%e5%b0%91%e6%94%b9%e7%a8%bf%e7%9a%84%e6%b2%9f%e9%80%9a%e6%8a%80%e5%b7%a7";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-25 21:23:49";s:17:"post_modified_gmt";s:19:"2016-07-25 13:23:49";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=905";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}