2̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:534;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-21 12:07:49";s:13:"post_date_gmt";s:19:"2016-07-21 04:07:49";s:12:"post_content";s:8110:"<img class="fr-fil fr-dib" src="http://img.ui.cn/data/file/6/7/7/680776.png" alt="Image title" width="900" />

<strong>为什么日本的网站设计这么的特别？</strong>

序：最近一直在关注日本的设计，其实一直在找寻以下三个问题：1，日本设计这么优秀的根源是什么？2，如何利用日本的设计来辅助我们的UI设计？3，日本设计在国际上数一数二的，可是在互联网这一块儿却一直保持10年以前设计的原因？

<strong>之前一直在猜测目前还保持1998年的日本互联网设计的各种原因，但是今天看到了这篇文章，一个来自日本本土乐天的交互设计师自己如何看待日本的互联网设计，或许给了我们网易UEDC一个明确的答复，但是我们还是不止于此的去研究这一现象。</strong>

希望此文有同样困惑的同仁们看到，咱们一起来探讨探讨

<em>“设计不应当控制人类和物体，它应当协助人类，这是设计的使命“－－Dieter Rams</em>


我曾经在一家公司工作，经常让我举一些日本网站设计与众不同的例子。这个不能说我是直接和日本设计有关联的，而是很多次我都参与相关的一些项目

作为一个用户体验设计师，我发觉我经常被夹在提升用户体验和为商业利润做贡献这两者之间。当有人赞扬以用户为中心设计多么好，我就会看目前的网页设计，完全和网页表面是一脉相承的，我一点也不认为它是提供了以用户为中心的设计<img class="fr-fil fr-dib" src="http://img.ui.cn/data/file/4/9/6/680694.png" alt="Image title" width="900" />Top page of Rakuten Ichiba—accessed Nov. 16th.


可是，乐天的销售额却一直越来越强。甚至到现在，用了和上图相同的网页设计，乐天的销售额一年打破一年的销售记录。每月用户数量更是增长到5000 0000（根据2014年6月的数据），这样的数据相当于1／3的日本人每个月都会用这个网站
<strong>这样的网页设计它是怎么形成的？</strong>
尽管我说不到具体的细节，这个网站已经成为日本执行A／B测试的一个代表了，通过试错精确的调整网页设计，一直在寻找更高效更有创意的元素，排版和内容。
我在乐天的时候，公司已经采取了极其严格科学的途径，应用大量的方法，比如结果数据分析，建立假设和成体系化的解决方法。<img class="fr-fil fr-dib" src="http://img.ui.cn/data/file/2/0/7/680702.png" alt="Image title" width="900" />乐天网站过去10年的演变

乐天能在众多网站中脱颖而出的原因是它严格执行“商业第一 这个概念，但是我当时也挺吃惊的是，公司竟然也有用户体验中心这样的部门，他们会分配KPI到各个树形结构的用户流程当中，目的就是提高商业利润

在公司里，怎么样首次建立一个网站是一个很重要的点，原因就是大部分的日本人更倾向于保持现状，不喜欢改变。即使针对改变导致局面危难他们也接受，而且还有一个趋势就是排斥在稳定状态也要寻求改变的人

说回到乐天的网站，同样的道理。在大体量的改变一个如上所说的每月都会有百万日本用户访问的网站，这么做很冒险，更有必要的是从用户的角度探索因素的多样化
<strong>从众倾向</strong>
假如，一个网站在日本以外的国家相当独特，能发现很多文章来指出这类网站的背后理论
经常被说的原因有以下两类：
1，日文的复杂的文字书写系统，有平假名，片假名和汉字
2，日本人独特的行为比如消费行为和信息获取行为

尽管如此，我还是得从我既在日本生活又在美国生活的经验来表述一下我的观点，我觉得最本质的区别是在于“对压力的适应"

并非全部，但是大多数的日本人都有消极的态度。这是因为消极性是从小随着教育灌输到他们骨子里的。主流的日本教育，老师单向的讲课，而学生跟随老师的指导。在日本以外的国家，学生练习传递他们的想法给老师和同学，用比较易于理解的例子，也因此他们养成了一个良好的表述自己主的习惯<img class="fr-fil fr-dib" src="http://img.ui.cn/data/file/4/0/7/680704.png" alt="Image title" width="900" />日本高中的课堂景象. (c) 2008 Jeffrey Eric Francis Friedl，

老师呼吁鼓励学生给出他们的想法，但是他们还会在课堂上问“其他人还有问题吗？“因此鼓励学生抓住机会自愿的表述自己。正是这个原因，在自己表达的时候，学生必须得确认他们对事物有一定的理解，当出现一个问题或者答案的时候，适当的让他们自愿说出来。而且，通过听同学们的想法，其它学生能够重新思考自己的想法，在整个讨论和辩论中加深他们的理解和如何运用所学到的知识

这个大概听起来很熟悉对读这个文章的人来说，但是直到你们到日本来做一个演讲或者研讨会的时候，你们会发觉Q&amp;A环节和美国完全不同。而且在日本还有另外一个因素，不可见的特性，这个是来自于他们多年生活的社会就是一个很自然就跟别人比较和谐不起冲突，而结果就是大部分人喜欢沉默，因为考虑到如何与人和谐相处，而避免提出不同的观点。




<strong>用户的行为改变信息体量</strong>
这种消极的特性会直接反映到用户行为，同时也会反映到网站信息获取行为。

这有一个很简单的实例，一个海外的网站Expedia准备进入日本市场，<img class="fr-fil fr-dib" src="http://img.ui.cn/data/file/6/0/7/680706.jpg" alt="Image title" width="900" />

<a href="http://www.expedia.com/" target="_blank" rel="nofollow">Expedia公司网站</a>

他们把网站给几组年龄20－50岁的海外日本人看，这里面包含男人和女人，将近80％的日本人觉得这样的网站“缺乏可信度“。这个网站可是拥有很好的创意，简洁而且统一化的设计，还有精心价格信息设计。结果，这些人根本不买账；用户的原因也很简单：

<strong>“都没有足够的信息啊“</strong>
经常在西方的网页里见到简单现代化的设计给这些用户的影响是未提供足够的信息，这个让他们产生不安从而产生出缺乏信任感<img class="fr-fil fr-dib" src="http://img.ui.cn/data/file/3/1/7/680713.png" alt="Image title" width="900" />左边为<a href="http://www.expedia.com/" target="_blank" rel="nofollow">美国的Expedia</a> ，右边为<a href="https://www.expedia.co.jp/" target="_blank" rel="nofollow">日本的Expedia</a> accessed Nov. 16th 2014.

测试还在继续，当把海报和图片放在左边或者右边，填充较多的内容在空的区域。当用户看到这个设计时，通过观察，发掘他们毫无阻力的使用起来。较大体量的信息去满足他们最根本的消极态度，而且这种自由的从众多的后选项里去选择他们想要的还能给他们一种愉悦的感觉。
<strong>难道网站设计的目的不是为了商业吗？</strong>
文章一开始讨论的乐天网站，设计和改善的结果也只是一种“加分形式“。自此就改变了我对网站设计的思考方式，把自己认为自己是设计师放在一旁，让用户自己去摸索，不用引导他们到一个点上。这个网站也提醒着我差点儿忘了的两点：

网站设计的职责和使命是什么？
网页设计师的价值是什么？

注意，世界这是一个大的实例，以用户为中心的日本网站设计将如何在日本运行下去呢？

但是，我还是看到了一点点即将到来的改变，通过科学的和以用户为中心的想法，传统的日本网站设计最终将会更加戏剧化的去阐明，怎么样在如此复杂的商业环境去保护网页设计和网页设计师的作用。";s:10:"post_title";s:82:"日本设计那点事儿----第二弹（为什么日本网站设计这么特别）";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:190:"%e6%97%a5%e6%9c%ac%e8%ae%be%e8%ae%a1%e9%82%a3%e7%82%b9%e4%ba%8b%e5%84%bf-%e7%ac%ac%e4%ba%8c%e5%bc%b9%ef%bc%88%e4%b8%ba%e4%bb%80%e4%b9%88%e6%97%a5%e6%9c%ac%e7%bd%91%e7%ab%99%e8%ae%be%e8%ae%a1";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-21 12:07:49";s:17:"post_modified_gmt";s:19:"2016-07-21 04:07:49";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=534";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}