���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"2350";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-10-19 19:20:20";s:13:"post_date_gmt";s:19:"2016-10-19 11:20:20";s:12:"post_content";s:6179:"你已经花费了好几个星期在做客户交给你的设计，不得不在痛苦纠结中经历了九个糟糕的设计才能得到最终那唯一一个好的设计，像心甘情愿的（也可能不情愿的）豚鼠一样和你的团队和朋友反复进行测试，终于按照要求完成了完美的网页设计解决方案。然后你把它展示给客户，然后，事情被你搞砸了。是不是听起来很熟悉？

你不是一个人。像客户展示设计是设计师的技能包中需要掌握的最难的技能之一，而且有很多的新手挣扎其中。客户和设计师带着不同的角度、期望和语言来到展示会议中——产生传达错误和理解错误一点也不惊奇。

这就是为什么强大的设计展示能力对于客户的设计项目的成功十分重要的原因。如果因为你的展示能力太糟根本得不到客户认可，设计得再牛逼也没有意义。

而来之不易的经验或许是教会你好的展示技巧的最好的老师，通过一些小小的准备和多一点的自信就可以避免最常见的错误。以下是三个新手设计师展示设计时常犯的错误及避免的方法。

<img class="alignnone size-full wp-image-75346" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/10/201610141476428411.jpg" alt="" width="650" height="330" data-bd-imgshare-binded="1" />

&nbsp;
<h2>错误1：美感优于性能</h2>
这是一个很容易掉进去的陷阱——毕竟，你努力不放过任何一个像素为了在界面中得到融合了渐变、纹理以及你的全部才华的最佳结果，再加上那个新的配色方案的补充让整个信息结构达到完美。你应该把那些全部都指出来，不是吗？错了。

设计师犯的最大的错误是让他们的客户仔细浏览界面上的每一个视觉特征。首先，客户已经能够看到屏幕上显示的内容，没有必要把它们全部都指出来，浪费他们的时间；第二，他们不是设计师，美学的东西对他们来说是次要的。客户只关心性能；他们关心的是这个设计能不能帮助他们实现商业目标。
<h3>解决</h3>
如果你发现自己正在浏览每一个像素，停下来好好思考下。你的目的是要解释<strong>为什么</strong>这个设计是这个项目最好的解决方案，而不是这个设计包含了<strong>什么</strong>。解释这个设计是如何符合商业目标的。通过分开测试不同的原型设计并收集结果，确保你有真实的数据来支持你的断言——一旦客户看到数据可以证明你为什么选择这个特定的特征，他们更加可能会为这个项目买单。

如果你把重心放在收集的客观的数据和做每一个决定时的原因而不是描述你做的界面多么漂亮的语言上时，你在展示设计时会感到更加有自信。
<h2>错误2：不展示高保真原型图</h2>
一原型图胜千言。同时也胜过至少一千个你尽力仅仅通过语言和便利贴来解释设计概念的客户会议。对于很少或者没有网页设计经验的客户来说，理解复杂的线框图或者纸上的测试原型图是很困难的——他们不会精通你所习惯使用的界面术语，并且他们制定出结构和导航的样式的能力也是有限的。而且让客户感觉自己像个哑巴肯定是你最不想做的事情。
<h3>解决</h3>
高保真原型图是消除设计师和客户之间的隔阂的一个很好的方式。使用一个动态的原型图意味着你将拥有一个交互界面的解决方案，可以让你毫不费力地展示设计的语境和功能。

如果这是你第一次与客户合作，做出一个内容优先的原型通常是个不错的主意。这样你就可以开始在早期就得到关于品牌的观点和感觉的反馈，并避免在通用的文字排版上出现困惑。不管你选择什么样的原型工具，展示出一个完美的原型将会使你的客户对这个项目很满意，同时增加你作为设计师的可信度。

如果你不确定对于你的特定的项目来说用哪种原型工具最好，可以查看Cooper的交互文章<a href="https://www.cooper.com/prototyping-tools" target="_blank">《最好用的工具列表》</a>或者这个更短的，<a href="https://speckyboy.com/7-useful-prototyping-tools-websites-mobile-apps/" target="_blank">《深入的选择》</a>。
<h2>错误3：只展示一个设计</h2>
我们都明白——时间和资源都很紧迫，谁愿意创作了大量设计却仅仅在客户看了第一眼后就变成了垃圾？事实是，正如设计和品牌战略家Dave Holston所指出的，只有设计大神才有展示一个设计想法的特权，余下的我们这些凡人应该遵守“三个原则”。
<h3>解决</h3>
三个原则非常简单。在一个客户会议中展示三个设计，而不是一次只展示一个然后被客户枪毙掉。根据Dave的观点，你需要做到的是：
<ul>
 	<li>以客户为导向的设计：逐字逐句地根据客户的要求来做，但是说实在的，这样非常无聊。</li>
 	<li>以设计师为导向的设计：当你全神贯注于客户的要求时，这种方式是你喜欢的并且你知道这是更好地解决商业问题的方法。</li>
 	<li>“wow！”设计：完全出乎意料的设计，不管是什么原因，这么做就是了。</li>
</ul>
客户可能会拒绝这个选项，但是有了“wow”设计，他们更有可能选择一个中间的选项，这当然就是以设计师为导向的设计了。良好的展示对你来说就是在做基本的心理工作。
<h2>向客户展示设计——最后总结</h2>
一个强大的设计展示会议会对一个项目的成败产生重大影响。客户花钱找你就是把你当做专家，所以不要害怕展现出你最专业的一面——利用数据、证据、原型图和一点心理学来建立起你的权威，拥护你的最棒的设计。从长远来看，客户会因此而感谢你的。

&nbsp;

原文地址：<a href="https://speckyboy.com/mistakes-presenting-design-ideas/" target="_blank">Speckyboy</a>";s:10:"post_title";s:60:"向客户展示设计想法时常犯的错误及解决方法";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:180:"%e5%90%91%e5%ae%a2%e6%88%b7%e5%b1%95%e7%a4%ba%e8%ae%be%e8%ae%a1%e6%83%b3%e6%b3%95%e6%97%b6%e5%b8%b8%e7%8a%af%e7%9a%84%e9%94%99%e8%af%af%e5%8f%8a%e8%a7%a3%e5%86%b3%e6%96%b9%e6%b3%95";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-10-19 19:20:20";s:17:"post_modified_gmt";s:19:"2016-10-19 11:20:20";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=2350";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}