�̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1328;s:11:"post_author";s:1:"3";s:9:"post_date";s:19:"2016-02-28 17:04:43";s:13:"post_date_gmt";s:19:"2016-02-28 09:04:43";s:12:"post_content";s:4797:"我们在日常使用金融APP时常觉得不便，信息填写繁琐，授权协议冗长。很多设计师在设计金融产品时，往往是从业务角度出发规划流程。究竟一个移动金融产品该如何进行体验设计？应当考量哪些因素？

<img title="bangka_guan1.png" src="http://www.tang-consulting.com/Public/ueditor/php/upload/20160607/14652867223805.png" />

唐硕在与合作伙伴的持续创新中，不断沉淀对移动金融产品体验设计的理解。体验是移动金融时代的灵魂。用户的去留取决于用户的价值感知与使用感受。然而落地到设计时，除去体验，我们还应同时考虑到监管要求与业务需求，在三者间取得平衡。

&nbsp;

“绑定银行卡”，几乎是金融APP中的通用流程。然而其不仅被公认为是获取用户的高门槛环节，现有很多产品的设计也并不完善。今天我们从体验、业务与监管三方面来谈移动金融APP的绑卡体验设计。
<p dir="ltr">为什么需要绑卡？</p>
为保障用户的资金安全，金融交易中有很多监管要求会涉及实名认证。以基金开户为例，监管要求基金公司在用户交易前必须完成基金账户与交易账户的开通。采用银行卡信息进行实名认证来完成开户，高效便捷。

&nbsp;

除了监管要求，设计绑定银行卡的业务流程，实际上也是为了绑定用户。个人金融交易的基本特征之一即是非一次性。让用户在多次购买行为中，反复在移动设备上输入银行卡信息，会给用户带来很多不便。绑卡提升用户重复购买金融产品时的效率，从而提高交易的转化率，达成业务与体验的双赢。<img title="bangka_guan2.png" src="http://www.tang-consulting.com/Public/ueditor/php/upload/20160607/14652855582030.png" />
<p dir="ltr">魔鬼藏在细节里</p>
绑卡时繁琐的信息字段并非凭空而来。大多数金融机构在请款时，会选择与银联等第三方通道合作。而为了简化用户后续交易，采取的模式是通过首次提供银行卡、银行预留手机号及手机验证码的方式，完成支付授权协议。这些基本信息字段由通道决定。

<img title="bangka_guan6.png" src="http://www.tang-consulting.com/Public/ueditor/php/upload/20160607/14652857017190.png" />

绑定银行卡需填写的基本信息字段

不能删减需填写的内容，并不代表过程不能被设计。现有的很多APP在用户第一次进入时就要求用户进行绑卡。然而用户进入APP，首先关注的是要购买哪些金融产品，其次是购买数量。因此将绑卡设置在已选定产品并填写购买金额后，可能更符合用户的习惯。

&nbsp;

此外，绑卡除了填写基本信息外，还有提高安全性的密码设置。面对“首次绑卡”与“再次绑卡”两种行为，密码设置与验证的设计也有所差异。

&nbsp;

首次绑卡承载着业务“开户”的重要作用，额外步骤的增加会导致跳出率上升。同时，用户在进行绑卡操作前，并没有将自己的关键信息提供给APP，因此在心理模型上认为自己并不需要被保护。所以在这个场景下，密码设置可以设计在最后。

<img title="bangka_guan3.png" src="http://www.tang-consulting.com/Public/ueditor/php/upload/20160607/14652862918379.png" />

首次绑卡密码设置后置

而“再次绑卡”时，用户身份已完成验证，此时的绑卡仅仅是单纯的银行卡信息录入，实际上已脱离了监管的开户要求。并且可以认为，进行这个动作的用户应是APP的深度用户，其对于密码设置或验证的过程已很熟悉。如果这时仍将密码验证放在最后，对于忘记密码或意外退出的用户，之前填写的信息就会全部作废，体验会很糟糕。

&nbsp;

<img title="bangka_guan4.png" src="http://www.tang-consulting.com/Public/ueditor/php/upload/20160607/14652863407069.png" />再次绑卡密码设置前置

&nbsp;
<p dir="ltr">绑卡并不孤立</p>
&nbsp;

如果产品自身有足够吸引力，用户愿意主动进行购买，绑卡流程就能通过支付环节自然而然的完成。

&nbsp;

因此，不应把绑定银行卡孤立的作为一个功能点，或作为用户进入APP的必经步骤。把绑卡融入交易场景，同时提升金融产品本身的吸引力，匹配用户的价值预期才是王道。

&nbsp;

金融产品设计，离不开对体验、业务与监管的综合考量。即便是一个如“绑定银行卡”的常见功能设计，背后也投射了对于用户价值与商业价值的平衡把握。体验设计无小事，移动场景下的金融APP设计更应如此。";s:10:"post_title";s:96:"满足了用户需求，却连及格都谈不上｜从“绑卡”谈移动金融APP体验设计";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:180:"%e6%bb%a1%e8%b6%b3%e4%ba%86%e7%94%a8%e6%88%b7%e9%9c%80%e6%b1%82%ef%bc%8c%e5%8d%b4%e8%bf%9e%e5%8f%8a%e6%a0%bc%e9%83%bd%e8%b0%88%e4%b8%8d%e4%b8%8a%ef%bd%9c%e4%bb%8e%e7%bb%91%e5%8d%a1";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-28 17:05:12";s:17:"post_modified_gmt";s:19:"2016-07-28 09:05:12";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1328";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}