���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1679";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-08-04 16:28:44";s:13:"post_date_gmt";s:19:"2016-08-04 08:28:44";s:12:"post_content";s:6587:"<blockquote>一个好的成熟的设计团队是能通过设计驱动产品，让它像一个轮子一样不断的前进，迭代。</blockquote>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/08/shejiqudong.jpg"><img class="size-full wp-image-386326 aligncenter" src="http://image.woshipm.com/wp-files/2016/08/shejiqudong.jpg" sizes="(max-width: 680px) 100vw, 680px" srcset="http://www.woshipm.com/wp-content/uploads/2016/08/shejiqudong.jpg 680x, http://www.woshipm.com/wp-content/uploads/2016/08/shejiqudong-404x190.jpg 404x" alt="shejiqudong" width="680" height="320" data-original="http://image.woshipm.com/wp-files/2016/08/shejiqudong.jpg" /></a>

在很多公司里面，一个产品的好坏更多的是取决于产品经理、商务或者开发，而不是设计。因为很多设计师都有一种“等需求”的想法，等待产品经理的需求列表，按部就班的做事情，这样会让设计团队越来越不重要。所以作为设计师应该主动转变思路，从等待需求做设计转变为在没有需求的情况下用设计去驱动产品。

具体流程可以概括为：<strong>在现有版本通过数据挖掘和用户反馈，把握产品的需求点和新版本的着力点；通过高保真Demo和可用性测试让产品落地；最后收集新的用户反馈和数据进行下一版本的迭代。</strong>

一颗树要想长成参天大树，首先要有发达的根系，然后要有强壮的树干，最后要有茂密的树叶，只有这样才能让每个环节都吸收充足的养分，良好地生长。其实产品也一样，我们以此类比，梳理出设计驱动产品的设计脉络：
<ul>
 	<li>追根溯源</li>
 	<li>根生固本</li>
 	<li>枝繁叶茂</li>
 	<li>细枝末节</li>
</ul>
具体案例：电脑管家11.0版本改版
<h2>一、 追根溯源</h2>
在产品设计之初通过数据挖掘和用户反馈把握产品需求点，找到新版设计的突破点。

以电脑管家为例，在10.0版本创造性的推出了大小界面，我们希望小界面服务小白用户，做到快捷方便。而大界面服务于对电脑有一定研究的资深用户，所以将复杂操作和功能放在了大界面。

通过对比8.0和1.0版本的数据我们发现：10.0版本的tab指数，页面切换的点击率上去了，但是按钮的点击率下去了，这说明用户会在大小界面来回切换但是他并不会去点击这个功能。

同时很多用户反馈，8.0升级到10.0，大小界面不统一，功能感知弱，活跃度低下。

针对这些数据和用户反馈我们列出了管家11.0的改版需求：
<ol>
 	<li>完善大小界面</li>
 	<li>功能模块的整体包装设计</li>
 	<li>提高用户活跃度</li>
</ol>
<h2>二、根生固本</h2>
依照第一步的得到的改版方向去做整体的交互框架。

<strong>2.1 大小界面不统一</strong>

10.0的版本tab是放在上面的，大小界面相差很多，用户反馈很不适应。于是我们在11.0的版本把tab进行重新规划，将tab区域整体移到放到下方，让上方区域全部去做整体的状态感知。

<strong>2.2 功能模块的整体包装设计</strong>

在10.0的版本中，我们在界面只放了一个按钮，就是一键操作。而将其他的附加功能隐藏起来，用户必须通过一级二级甚至是三级的路径才能寻找。这造成了很多用户找不到功能。所以在11.0版本中，我们将附加功能在主界面做一个曝光，让用户可以在主界面直接找到功能的入口。

同时我们让很多功能的展现数据化、可视化，让用户知道软件每一步在做什么。而不是像以前只是通过文字去展示状态。这极大的提高了用户对产品功能和自身电脑状态的感知。

<strong>2.3 提高用户活跃度</strong>

通过数据我们发现很多人打开电脑管家其实不是一个单一的行为，例如在查杀病毒之后，还会继续清理磁盘垃圾。所以我们在11.0的版本的结果页做了很多其他功能的入口。还是以查杀病毒为例，在结果页并不是单纯只显示一个结果，告诉你发现了多少病毒杀灭了多少病毒，我们还做了很多功能的拉动。去引导用户继续使用其他功能。
<h2>三、枝繁叶茂</h2>
这一步是确定视觉的过程，我们会定出产品主色调，相应模块的热区范围。图标的定义，如图标大小、线的宽度等。然后根据这些定义做出所有的页面并完成最后的标注。

最终形成了电脑管家11.0.
<h2>四、细致末节</h2>
在第三步我们实际已经打造出了一个完整的产品。那为什么会有第四步？因为在一个大型的项目中一般会有一个主设计师去定义好一个框架并做完一个模块，剩下的模块会交给其他设计师做。但是我们会发现这些设计师只会单纯的依照主设的框架去设计，他们往往会忽略用户场景。

一个成熟的产品，每个功能使用的场景是不相同的，不同场景也造成了每个功能的配合点不同。

<strong>以电脑管家的加速功能为例：</strong>

在设计之初我们定义的主流程是：打开管家，选择加速，开始扫描，完成加速。

但真实的情况下用户不会这样去做，他们希望在电脑卡慢时能马上加速，并不会去找打开管家去寻找加速的button。

因此我们最后选择了大界面＋小火箭浮窗的形式，玩家需要加速的时候点一下小火箭就可以快速的完成加速。

之后我们会输出高保真的Demo。

因为在一个大的项目或者大版本迭代中视觉稿并不能很好的发现问题，所以我们需要Demo来验证设计，模拟真实情况下的用户手感。同时Demo也能更直观的向负责人或者开发阐明设计思路，设计需求，从而降低沟通成本缩短开发周期，保证产品的顺利落地。

最后我们会进行可用性测试和专家访谈。从中收集数据和用户反馈，并对这些数据和反馈进行整理，列出下个版本的优化点。这其实就是回到了整个设计脉络的第一步，完成了一个闭环。
<h2>总结：</h2>
通过可用性测试和反馈找到新版本的需求点，高保真Demo+可用性测试让产品落地，然后通过数据挖掘和反馈再进行后续版本的优化。

所以一个好的成熟的设计团队是能通过设计驱动产品，让它像一个轮子一样不断的前进，迭代。";s:10:"post_title";s:63:"从一个案例说起，如何用设计驱动重塑设计团队";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:189:"%e4%bb%8e%e4%b8%80%e4%b8%aa%e6%a1%88%e4%be%8b%e8%af%b4%e8%b5%b7%ef%bc%8c%e5%a6%82%e4%bd%95%e7%94%a8%e8%ae%be%e8%ae%a1%e9%a9%b1%e5%8a%a8%e9%87%8d%e5%a1%91%e8%ae%be%e8%ae%a1%e5%9b%a2%e9%98%9f";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-04 16:28:44";s:17:"post_modified_gmt";s:19:"2016-08-04 08:28:44";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1679";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}