���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1922";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-08-12 16:39:55";s:13:"post_date_gmt";s:19:"2016-08-12 08:39:55";s:12:"post_content";s:10217:"你们以为设计是抓着支Lamy在Moleskine上画画草图？是AI、PS点点鼠标照着Dribbble 这级别的东西临摹？这种锻炼，只会让你们在美工路上，迈上一步又一步扎实的脚印。如果你不打算当艺术家、或者继续被叫做美工，可以停一停那样的练习了。

至少在我熟悉的平面设计领域里，我反对一切无目的的设计练习。多做些实际的，有客户要求的设计，就是设计师最好的自学。接下一个再一个哪怕再小的项目，哪怕赚到什么钱，这也打发空余时间的最好手段。

能判断设计师水平高下的，不是单纯的表现形式美，而是通过设计你为客户解决了问题。

所以Dribbble上的大多，只有作品，没有因果，那些只是一幅幅Visual Arts而已，对你而言，可做启迪，却从中学不到设计。

所以，你把一个ICON画得照片一般又如何？

设计是通过你的作品来解决问题的。A PROBLEM SOLVING SKILL

“问题”不可能是你虚拟出的，我们所能虚拟出的“问题”，通常是理想化、不靠谱、无意义的。

而真正能锻炼你的“问题”，来自复杂的需求以及难搞的客户。

那为什么要通过实际项目来自学？
<h4><strong>1. 锻炼沟通、妥协、争取的能力</strong></h4>
因为你的客户或者老板总能有千奇百怪的需求，与各种下限之下的条件所限。

你要学习如何跟他们沟通。如何面对专业但没审美的负责人、不想担责任的市场部、描述不清想法的小老板、沉迷高大上的大领导。并与他们一起完成项目。

因为最终，这些都会是你设计师之路上的日常。这些，看一万年Behance和Dribbble也学不到。

编者注：遇到描述不清楚需求的客户，来这儿学学方法：<a href="http://www.uisdc.com/deal-with-mockup-require" target="_blank">《职场好经验！如何应对客户想看效果图的要求》</a>

e.g. 我们给商飞的C919和ARJ21做产品手册时，面对的是上上下下众多部门的意见、遥不可及但有生杀大权的大领导，可用的飞机渲染图只有不到6张，且不能使用局部、飞机不能在低空云层中、色调不能偏向不吉利的黑灰白、供应商产品照片没大图、数据时常有变化、等等说多都是泪的问题， 而我们要做出一本60页的产品手册，对标的是波音、空客的设计公司的作品。

要感谢市场研究中心的诸位，与我们默契地合作了那么些年，出品虽不能拳打波音脚踢空客，但好歹差强人意，肯定比俄罗斯的好很多了。XD

<img class="alignnone size-full wp-image-196531" src="http://image.uisdc.com/wp-content/uploads/2016/08/tk201608111.jpg" alt="tk201608111" width="600" height="746" />
<h4><strong>2. 理解完整的流程</strong></h4>
学会设计一个张名片、一个单页，或者一幅海报、一份用在微信上传播的KV。从开始的接BRIEF，到学会去思考这是给什么人看的，在什么场景，什么时间，如何通过视觉去传达客户所要表现的信息；再到具体的制作工艺、或与程序员们配合、或和印前印后切磋。

这些实打实的经验，是设计师最宝贵的财富。也是未来客户信服你的凭据。

当然这些，不把手弄脏，是学不会的。

e.g. 下图是，好友所开，招待过众多明星的私房菜馆的名片，制作环节上也蒙印刷单位朋友厚爱，各种工艺一一试来，一份名片，制作出了近十种效果，让我们来比对选择。大家玩得开心，我们作为设计方，从中也看到了下次改进的各种可能。感觉又学到一招。

<img class="alignnone size-full wp-image-196532" src="http://image.uisdc.com/wp-content/uploads/2016/08/tk201608112.jpg" alt="tk201608112" width="800" height="600" />
<img class="alignnone size-full wp-image-196533" src="http://image.uisdc.com/wp-content/uploads/2016/08/tk201608113.jpg" alt="Processed with VSCO with e2 preset" width="800" height="600" />
<h4><strong>3. 实打实的成就感</strong></h4>
网上发个设计被一群后生晚辈夸赞一番能有多大成就感？

而当你实打实地完成了一个项目，无论大小，你就与这世界上的某样事物产生了链接。

平日偶遇，淡然说一句，哦，这是我客户。这曾是每个广告人的最大得意。

对于设计师更是如此，那些品牌、产品、形象，诞生自你的脑细胞。有如自己的一部分留在了别处，在这世界上存了个备份。而参与越多真实的项目，这样的成就感便会伴随你，抽打你，让你成就更好的作品。

e.g. 第一个让我获得这样成就感的设计—— SHLUG，上海LINUX用户组。

混IRC的时代认识了那帮黑客级的家伙，处于好玩和练手，免费（因为人家是开源组织，我可没破坏规矩哦）为他们设计了这个标志，沿用至今，想想可能都有十年历史了，所以也是带给我成就感最久的一个设计。又因为这标志也结实了许多朋友，当然，让我一个不用LINUX的人也天天得以混在他们群里抽科打诨。可以牛逼哄哄地跟客户吹，嗯，上海LINUX圈的大佬我认识一拨呢。

<img class="alignnone size-full wp-image-196535" src="http://image.uisdc.com/wp-content/uploads/2016/08/tk201608115.jpg" alt="tk201608115" width="800" height="533" />

e.g. 2 这是最近一个让我成就感满满的设计。摆在这里说，是因为当时并没有把这个项目当正式的设计工作来做，朋友帮忙性质居多，跟生意肯定有区别。

对那时一直在做飞机、游艇、高级酒店类客户的我，也算是项练习，从来没碰过餐饮嘛。

所以更多满足的是自己的对品牌的理解，正巧两位老板与我对品牌的理解搭得上脉，又足够信任。自然一稿做好，双方满意。

这项目带来的，不只是餐饮类品牌的设计经验，更多客户、更多美食体验。而是听到不知情的朋友们讨论起这家店时，淡淡的那句，哦。这牌子是我设计的。

<img class="alignnone size-full wp-image-196571" src="http://image.uisdc.com/wp-content/uploads/2016/08/nl20160811.jpg" alt="nl20160811" width="800" height="800" />
<img class="alignnone size-full wp-image-196572" src="http://image.uisdc.com/wp-content/uploads/2016/08/zz20160811-1.jpg" alt="zz20160811 (1)" width="800" height="800" />
<img class="alignnone size-full wp-image-196573" src="http://image.uisdc.com/wp-content/uploads/2016/08/zz20160811-2.jpg" alt="zz20160811 (2)" width="800" height="532" />

好了，诸多好处。这估计就有小朋友要问了，哪里去找那么多实际的项目呢？

你们生的时代，其实不知比我们好上多少了。

现在这时代，有那么多威客类网站可以去试试运气嘛。当然，那种低廉的价格，低等的客户，你们可能瞧不上。但一个公司，居然愿意花钱把他们重要的形象工作、沟通工作交给你们。

首先，我想说他们是傻逼的。但，他们能给你们带来真真实实的历练。

你们会更早接触到那么多无脑的甲方，这不好么？社会上这类甲方的比例其实是占大多数的哟。

可以早接触早适应是好事。

另外，开始让你身边的朋友知道，你愿以不高甚至很低的价格，帮他们做设计。这样你身边肯定会有一群“就差设计师了”的朋友、或者朋友的朋友出现。让他们给你带来更多的历练吧。

努力把每个外人眼里的傻案子、傻客户，变成好设计，每一款问心无愧的商业作品，这样的内容十足的项目经验，才是设计师成长的台阶。

不论是对你就业、找工作、换工作。都可带来意想不到的妙处。

嗯。我想估计还有人问，我软件也不是很熟，接了项目，怎么做呀。

呵呵，接下了项目，你就有学会软件的最大动因了。

我因为接了人生第一张海报，彻底学会了AI。

因为接了第一条动画小广告片，领着现在已经开了设计公司的小设计师，一起学会了AE。

而第二条演示小短片，又学会了MOTION。

是有多难？带着需求和压力去学软件，立竿见影。

编者注：对于UI设计师，更建议要挑选老板，因为是直接面对用户的，所以建议阅读这篇：<a href="http://www.uisdc.com/solve-designer-life-problem" target="_blank">http://www.uisdc.com</a>

<strong>「技多不压身的设计师才有高薪资！」</strong>
<ol>
 	<li>平面设计：<a href="http://www.uisdc.com/designer-self-study-2" target="_blank">《超赞！设计师完全自学指南》</a></li>
 	<li>交互设计：<a href="http://www.uisdc.com/interaction-designers-guide" target="_blank">《交互设计师修炼指南！教你从零开始成为优秀交互设计师》</a></li>
 	<li>UI设计：<a href="http://www.uisdc.com/beginner-ui-design-study" target="_blank">《超实用新手指南！零基础如何自学UI设计？》</a></li>
 	<li>前端开发：<a href="http://www.uisdc.com/none-based-front-end" target="_blank">《天猫高手来教你！零基础如何系统地学习前端开发？》</a></li>
 	<li>抠图技巧：<a href="http://www.uisdc.com/photoshop-matting-techniques" target="_blank">《从菜鸟到高手！PHOTOSHOP抠图全方位攻略》</a></li>
 	<li>配色方案：<a href="http://www.uisdc.com/3-color-matching-skills" target="_blank">《色彩搭配速成！3个实用方法帮你全面搞定配色》</a></li>
 	<li>DPI指南：<a href="http://www.uisdc.com/designers-guide-to-dpi" target="_blank">《基础知识学起来！为设计师量身打造的DPI指南》</a></li>
 	<li>交互设计自学路径图：<a href="http://www.uisdc.com/non-designer-interactive-design" target="_blank">《零基础入门！给非科班生的自学路径图之交互设计篇》</a></li>
</ol>
<strong>原文地址：</strong><a href="https://www.zhihu.com/question/26390567/answer/115972767" target="_blank">zhihu</a>";s:10:"post_title";s:72:"光临摹可不行！平面设计师在空余时间应该怎样自学？";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:198:"%e5%85%89%e4%b8%b4%e6%91%b9%e5%8f%af%e4%b8%8d%e8%a1%8c%ef%bc%81%e5%b9%b3%e9%9d%a2%e8%ae%be%e8%ae%a1%e5%b8%88%e5%9c%a8%e7%a9%ba%e4%bd%99%e6%97%b6%e9%97%b4%e5%ba%94%e8%af%a5%e6%80%8e%e6%a0%b7%e8%87%aa";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-12 16:39:55";s:17:"post_modified_gmt";s:19:"2016-08-12 08:39:55";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1922";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}