~ːZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:851;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-25 10:33:41";s:13:"post_date_gmt";s:19:"2016-07-25 02:33:41";s:12:"post_content";s:14241:"本文整理自腾讯移动互联网设计中心总监周陟在2016国际体验设计大会「设计管理峰会」上的演讲。

今天我分享的主题是“可拓展的设计思维”。为什么会想到这个主题，因为近两年我们经常在面试的时候听设计师讲到“设计思维”这个词，但我们发现这其实是一种非常静态的思考。

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/5/0/9/712905.png" alt="Image title" width="900" />

关于设计思维的方法论可以看这个图，这个图没有任何问题，使用的过程当中我们也知道每一步应该怎么分解和运用。但是，比如说我们问他怎么发现，他说观察，用什么方法观察？他说用同理心去观察，那如何培养同理心呢？大部分设计师在这个问题上就卡住了。如果你继续往下追问why why why的时候，很多设计师就不能给你准确的答案。所以我们看到很多一线设计师在自己去解读设计思维以及运用设计思维做项目的时候往往经不起追问的，当问题越来越具体的时候，实际上答案却越来越模糊。

我一直在思考为什么我们不停地提这个设计思维和方法，最后在实践的时候，运用起这套流程来却不是那么有效？我认为，无论你在设计的哪个细分岗位，当你参与到整个设计流程当中时，除了要了解设计思维最原始的方法论以外，还要做以下几点补充：

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/0/1/9/712910.png" alt="Image title" width="900" />

以上几点，我希望让它们有落地执行的可能性，所以这里介绍一些办法。

<strong>一、怎么学会传达自己的概念</strong>

我们在工作当中经常会遇到这种情况，很多设计师会去问他的leader或者总监：我究竟是要变成通才还是专才？我自己的答案是：不能变为简单的通才或者专才，而是要变成具备通才职业能力、具备专才职业视角的设计师。

通才最重要的是具备强大的沟通、说服及解释的能力，能把自己的概念或产品以一种非常具有设计逻辑的方式解读出来，这是通才需要培养的最重要的能力。

专才体现在什么地方，在视觉设计或者交互设计领域经常听到一句话“用英文排版会比中文排版显得更漂亮”。这可能是大家的一个共识。如果你问为什么，专才就会帮你回答这样一个问题，他会去研究，会给出自己分析的过程和案例，告诉你为什么英文在设计排版中会比中文更好看。

&nbsp;

传达概念的时候设计师经常会举生活中的案例。比如，贴在苹果上面的标签，每次吃苹果的时候都要把它撕下来再洗，有时候标签撕的不太干净就只能用指甲抠掉，所以吃苹果的这个初始体验是比较差的，但是并没有任何一家超市、出售方或者种植方尝试去解决这些问题。因为这个标签从商业上来说是提高效率的，不管是仓储、运输还是最后超市售卖的时候都可以大大提高效率，但是如果在我们的产品中大量地出现这样一些看上去无关紧要，好像也无伤大雅，大家习以为常的事情，这些事情不断地累积，体验就会被消耗。

当我们说一个产品的功能太复杂，一个页面内容太多的时候，产品经理比较喜欢举这样的案例，他会说为什么开车那么复杂的事情用户都能学会，很多人疯了一样地去学，不仅需要去驾校考证，上路了还要绑安全带，看红绿灯、路况等。

从设计思维的角度来看，如果把这些案例转换成一个通用的抽象概念的话，会是什么样呢？苹果上贴的标签可以被认为是用户被动接受的东西。 无论是做手机、网站还是做APP，大量产品存在着被动习惯化的细节，这往往就是体验设计可以进行优化的地方。开车，游泳这些东西，是整个社会大环境下可以主动变为你的知识和技能的部分，这些部分要在体验上面实现大跨度的提升，就需要依靠技术的革新。像提升开车体验的话，无人驾驶是一个选择。如果拍照的话，无人机是你的选择，这些情况下就需要一些技术突破。

&nbsp;

所以我想说的是，在传达概念的过程当中设计师不能停留在案例层面，而是要思考这个案例能辐射到多大的产品范围和多大的生活领域，然后将其抽象成一个模式，用这个模式解释类似的现象或问题，让没有设计专业背景的人更容易理解你所讲的东西。

&nbsp;

<strong>二、学会适配方法</strong>

在以往的面试过程中，我们会发现很多设计师的作品集中有几页会讲到设计的推导过程，里面会说一些专业名词，很多专业名词我都没有听过，问他的时候发现他也不是很了解。就是在设计的过程当中很容易陷入只讲究方法论，而不讲究方法论背后的原因的状态。

不管使用什么样的方法论，方法本身没有问题，问题在于这个方法使用的出发点以及设计目标，在设计目标的基础上建立的设计原则是否能够支持你的方法论。

&nbsp;

设计方法是从抽象到具像的过程，并不是所有的方法都能生效，这里面有四个维度的因素会影响到这个问题：

1、方法的变量

方法本身存在变量的空间，因为变量也是由人设定出来的。

2、团队的理解能力

团队会涉及到很多人的交流和沟通，特别是大的项目里面成员的能力参差不齐，他能不能理解你使用这个方法的目的，是需要你去解释的。

3、团队的执行能力

有好的方法，没有高效的执行，得出的结果就会走样。在用研的过程当中体现地非常明显，有些同学做用研报告，往往只做到收集、分析和统计，但是怎么去解读这一步做得并不够，这个在我们看来是执行出了问题。

4、方法的局限性

每个方法都有其局限性，我们在内部有一个观念就是：设计本身也是需要被设计的。因为每个项目的问题都不一样。

&nbsp;

<strong>三、更新工具</strong>

很多设计师会选择自己非常熟悉，非常经典的一些工具包，但我们认为工具的选择也说明了你的思维选择。其实人在使用工具的过程当中工具也在塑造你的思维。用不同的工具包也是在切换自己的思维模式，这样才能更容易得出一些最佳实践。你会发现前端开发团队的同学会经常更新自己的组建库以及工具包等等，视觉或交互领域的设计师很少做这样的事情。

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/1/1/9/712911.png" alt="Image title" width="900" />

这是我们团队目前用的比较合适的、好用的工具。选择的标准很简单，学习曲线低，产出效果好，所有工具最后都是产出高保真原型。为什么强调高保真原型？过去从低保真到中饱真到高保真的整个设计流程都不够精益、不够快，互联网时代变化速度非常快，需要直接把原型变为需求。

&nbsp;

<strong>四、学会结合商业</strong>

设计师怎么去结合商业？我们有一个简单的公式。

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/2/1/9/712912.png" alt="Image title" width="900" />

这在过去讲设计思维课的时候也曾提到，当你思考一个产品的功能或者一个迭代要不要做的时候，用这样的公式可以很快评估出这件事情是不是可行的，这个公式要怎么去解读呢？

第一，把你要做的事情变为对的事情。比如设计师接到的需求可能是做一个凳子，但是作为设计师应该解读这个需求背后的东西，你设计的不是一个凳子，而是坐的方式，是希望用户优雅地坐还是轻松地坐，这个东西是可以抽象化的，当你抽象化以后就知道这个东西究竟是什么。因为对的东西不一定是用户想要的，这个产品出来以后是怎么样击中用户的。

像上面这个例子就是我们随便想的一个案例，现在大部分的设计师日常自己都会接一些小单，未来也有开设计公司或者是做Studio的打算，在谈到给一些清单或报价特别是计税的时候头就大了，不知道怎么弄，这个就是一个具有可衡量性的语句，这个语句既解决了需求也描述了你怎样去击中用户。

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/3/1/9/712913.png" alt="Image title" width="900" />

这是是我们从商业设计画布变形过来的，我们叫UCD画布，在与产品经理或老板沟通的时候，可以把你产品的设计思维、设计需求、和用户相关联的东西都可以映射到这张画布上。

&nbsp;

<strong>五、理解产品</strong>

其实过去很多设计团队都会讲到产品的感觉，但是从来没有人讲怎么去解释产品的感觉。

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/6/1/9/712916.png" alt="Image title" width="900" />

我们团队内部有这样一个习惯，就是把上面（上图）那段话填清楚。把它填清楚了你的产品逻辑基本也就成型了。

比如应用市场这种产品，应用市场最重要的核心KPI就是每日可控分发量，为了提高每日可控分发量一定要把它分解到不同的功能和页面里面去。比如手游，如果你需要提高产品的周留存，解决活跃下载用户的问题就会变得非常重要。因为大部分人下了游戏就去玩了，应用市场跟他没有关系了。怎么样能让这种活跃的下载游戏的用户回到你的用户榜来，就需要解决游戏下载后服务的问题。这也是很多工具转内容或工具转社区产品在做的事情，解决一些下载后、购买后、服务后、服务后再服务的问题。

通过什么样的手段来达成目标呢？比如像《皇室战争》这样的游戏，如果新手想不花钱还是需要一些技巧的，这些技巧谁告诉他，攻略。所以可以采用攻略换道具的方式，如果我是个非常有技巧，非常有经验的玩家，我也可以写攻略啊，所以这个就是产品设计的策略。做这样的攻略换道具的流程，流程里面可能会牵涉到页面，可能会牵涉到活动运营。如果我们发现这个礼包提升了，说明活跃度和留存度也提高了。所以完整的设计逻辑一定是从愿景目标到产品目标达成一个闭环，这样你的需求就会非常清楚。

&nbsp;

设计师关注自己整个设计过程的时候，还应该关注后面的东西。在我们自己的概念里面，我个人认为现在非常流行的概念就是全栈设计师。你的设计稿和设计思路需要渗透到整个产品当中去。一个东西从概念的诞生到最后的落地，参与其中的设计师需要具备不同的综合能力，这个能力不一定是自己动手干，可以与比你更专业的人协作，相信好的过程导致好的结果。

<strong>产品设计完成并发布只是开始。</strong>

互联网产品的发布只是个开始，大部分的服务都是在后面产生的，设计师关注自己整个设计过程的时候，不能只关注设计稿，我们还应该关注后面的东西。现在有个非常流行的概念就是“全栈设计师”，但是我发现很多自称“全栈设计师”的设计师都是处于乱点精油术的状态，就是我学习很多的软件把同样效果的东西做出来，这有什么意义呢，对于整个的设计过程和完整设计项目来说，我更愿意提全过程设计师。

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/8/1/9/712918.png" alt="Image title" width="900" />

<strong>全过程设计师大概有什么特征？</strong>

第一，从来不忽略必要的步骤。整个设计过程是非常严谨，非常完整的，无论是一个要一两个月的大项目还是非常小的项目，比如像Google venture提的一个概念Design Sprint,它可以在五天内解决任何的创新或者设计方面的问题，这种方法也是有步骤的。第一天干什么，第二天干什么，不能忽略必要的步骤。

第二，具备从开始到完成的思维能力。一个产品从概念的诞生到最后的落地，设计师如果都去参与的话需要具备不同的综合能力，这个能力不一定是要自己动手干。

第三，他肯定也欢迎别人更专业的协作。

第四，相信好的过程导致好的结果。在遇到比较Top的项目里面，有一些老板其实不认可好的过程得到好的结果，这个时候设计总监和Leader就要让老板相信好的过程一定会导致好的结果。

第五，分析趋势而不是简单的接受趋势。最近两三年很多人都在不断的讨论扁平化这个趋势是不是会延续，会延续多久，下一波的风格会是什么样子？如果只是简单地接受这个趋势你就不能理解扁平化这个趋势究竟是怎么产生的以及最后谁会替代它。

第六，会把想法做成具备情境的文档。很多设计师在设计过程中总觉得自己的输出物就是设计稿，其实是不对的，你画的思维导图，你的草图，你对问题的解读，你画在白板上任何一个线条都是解决你思维的工具，当你把这些做成文档时，它是具有说服力的。

最后一个，会在跟随时做的比领先者更好。在工作中，我们发现有些产品哪怕起步晚一点，哪怕不是行业第一，有的设计师就能把这个产品做得很好，甚至比领先者做得都好。我们自己的事业群有很多这样的例子。

&nbsp;

我再重复一下，其实可拓展的设计思维，就是这五个部分，每个设计师都可以在自己的日常设计过程当中去积累、去提升，最终你的目标就是变成一个全过程设计师。";s:10:"post_title";s:90:"腾讯移动互联网设计中心总监周陟：要成为全过程设计师，你的设计";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:198:"%e8%85%be%e8%ae%af%e7%a7%bb%e5%8a%a8%e4%ba%92%e8%81%94%e7%bd%91%e8%ae%be%e8%ae%a1%e4%b8%ad%e5%bf%83%e6%80%bb%e7%9b%91%e5%91%a8%e9%99%9f%ef%bc%9a%e8%a6%81%e6%88%90%e4%b8%ba%e5%85%a8%e8%bf%87%e7%a8%8b";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-25 10:33:41";s:17:"post_modified_gmt";s:19:"2016-07-25 02:33:41";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=851";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}