�̐Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1053";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-23 19:23:13";s:13:"post_date_gmt";s:19:"2016-07-23 11:23:13";s:12:"post_content";s:8558:"<img class="load" title="没事别想不开去创业公司，不小心就会碎成渣！" src="http://file.digitaling.com/eImg/uimages/20160723/1469285741672713.jpg" alt="没事别想不开去创业公司，不小心就会碎成渣！" width="640" height="360" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160723/1469285741672713.jpg" />

最近身边朋友换工作的越来越多了，有的已经从体制内辞职，有的在传统高大上公司递交辞呈的路上。他们想出来创业，或是加入创业公司。

我不知道这到底是好事还是坏事，但这就是中国这些年的现实。旧经济在摧枯拉朽般节节败退，新经济如雨后春笋般向着太阳。颠覆太大，反转太快，按照窦文涛的口头禅－－这是要变天啊。

媒体大肆鼓吹着大众已经被点燃的神经，什么“创业点亮人生，时代为你燃灯”，blablabla。

天确实变了，但是这天是不是为你变的，很难说。就像一线城市繁华的夜景，和你有没有关系，很难说。押上自己所有的时间和机会筹码，自己创业或加入创业公司，是不是一步好棋，也很难说。

创业公司不是想进就能进的，不仅是行业门槛，还要有更高的职场素质要求，你确定你行么？

来源：<a href="http://mp.weixin.qq.com/s?__biz=MzA3NjU2MDUzMA==&amp;mid=2673016596&amp;idx=1&amp;sn=0d79a8d6f8bc752617d7c1c4f4773366&amp;scene=2&amp;srcid=0723HQuIDPBiuRVzc6UaUEbP#rd" target="_blank">Spenser的二次学习日记</a>
本文已经获得转载授权，版权归原作者Spenser所有
如需转载本文，请联系原公号“spenser的二次学习日记”
<h3>比如不能做到以下几点的，我个人认为不适合去创业公司</h3>
<h3>1. 不能All in 的不要来创业公司</h3>
我自己是宁波人，我们那一片，选择做生意的，比选择走仕途的要多。在我们那里有一句著名的口号－－“白天当老板，晚上睡地板”。

创业，一定要有All in (全部投入)的身心状态。

<strong>我理解的All in 的状态是：平日和周末是没有差别的，上班和下班是没有界线的。别人周日晚在电视前看综艺节目，你在电脑前和客户焦头烂额，都要习惯。</strong>

而且最重要的是，你要享受这种All in的状态。

为什么渴望下班？为什么期待周末？因为你觉得工作是为老板的业绩，时间卖给了公司，不属于自己，没有归属感，只有下班后和周末的时间才由自己支配。当你觉得这份事业是自己的梦想，时间都用在为自己成就的时候，你才会享受这个过程。你不会数着点下班想着去哪里玩，而只会抱怨为什么时间永远不够用，因为你知道，所有的时间，都是在为自己卖命。

你要告别文艺小资的生活，比如一下午的美好时光，只负责慵懒；告别任性的来一段说走就走的旅行，诗和远方；你要开始明白，在创业公司，工作就是生活，要不然你干嘛来创业公司啊。

除了主观意愿外，客观上创业公司也必须保持这种All in 的状态。

创业公司和大企业不一样，和事业单位也不一样，创业公司每一天都是战战兢兢，如履薄冰。一只眼睛看着外面商业环境的变化，随时准备调整战略战术适应市场，另一只眼睛盯着内部的团队，随时要调整和救火。
<h3>2. 玻璃心的不要来创业公司。</h3>
创业公司在成为独角兽公司前，在未进入大众的视野前，在获得市场的认可前，都是脆弱的。本身创业公司能活下来的比例就不高，能混得好的就更少。创业公司在起步发展阶段，没法做你的个人名片背书。在有名的大公司，在外界你就是甲方啊，你说我们要招聘了，简历下一秒就收到手软看不过来；你出门和其它公司谈合作，公司Title就是溢价的筹码。但是创业公司不是啊，十年前谁知道阿里巴巴会是今天这样，三年前多少人预见滴滴打车是现在的规模。创业公司就是这样，你空有一个好故事好前景，人家不信啊。所以，不管别人怎么看，你只能相信自己的判断，用自己的左手温暖右手。

加入创业公司，说明你多半是个爱冒险，爱折腾，不甘平庸的野心家，你无法预见五年后的自己会是什么样。别说五年了，两年后的样子都不知道。但这就是创业公司啊，有未来无限美好的想象空间，A轮B轮C轮IPO，然后突然身价就不一样了。但也不保证第二天就触礁沉亡，除了经验和能力，没有实现商业变现的可能。

人生的大起大落，会在创业公司重复上演，心情也经常会像坐过山车一样。这种感觉怎么形容呢？

请让我引用杜绍斐的原话：
<blockquote>“每一个自媒体人或者说正在创业的人，都在这样的状态下反复，每晚睡前都觉得自己一无是处马上要完蛋了，第二天早上又觉得自己太牛逼了，世界都是我的了。”</blockquote>
是的，我们经常是这样神经质的。<strong>上一刻都被自己感动了，下一刻又觉得自己被掏空了。</strong>

比如你辛辛苦苦培养的人终于养到可以分担你压力的时候，却被别的大公司两倍薪水挖走了；比如你发现大公司的办公室政治，创业公司一样也有；比如你和别人谈情怀谈梦想谈未来的估值，别人却和你谈薪水谈期权谈福利待遇。

拜托，我们是创业公司。

你会觉得这个世界对你一点也不友好，商业怎么这么邪恶，人心怎么这么世俗。

所以冯唐才能写出那么血腥现实的文字－－“世界这么多凶狠，他人心里那么多地狱，内心没有一点混蛋，如何走得下去。”

职场作家和全职作家，见识，内心，段位，果然还是不一样的。

所以，如果没有自带鸡血，没有大心脏，没有一刻笃定的心，不要来创业公司，不然你会很折磨，很焦虑，很没有安全感。现实每天都是锤子，玻璃心的，早就被碎成渣了。

<img class="load" title="没事别想不开去创业公司，不小心就会碎成渣！" src="http://file.digitaling.com/eImg/uimages/20160723/1469285976464892.jpg" alt="没事别想不开去创业公司，不小心就会碎成渣！" width="640" height="360" border="0" vspace="0" data-original="http://file.digitaling.com/eImg/uimages/20160723/1469285976464892.jpg" />
<h3>3. 没有快速成长能力的不要来创业公司</h3>
一个成熟的公司，每个人都是这个公司系统体系里的螺丝钉，安插在被需要的位置。一切按照流程走，不犯错，不犯浑，到一个阶段学习一个阶段需要的知识内容，一步步的晋升。而创业公司不一样，在互联网的大环境下，发展速度是第一位的，慢了就等于失败了。所以加入创业公司的员工，也就需要不断的更新自己。尤其在初期阶段，身兼数职是标配，今天要站台，给投资人讲故事，给新人画大饼，明天要管后勤，什么财务行政一堆琐事，看到哪个岗位缺人了恨不得肉身贴上去。所谓有条件要上，没条件创造条件也要上。

很多人在创业公司待不下去，并不是因为其它原因，而是现在的公司已经不是你刚进来时候的公司了，你原有的能力已经不再匹配目前的职位。公司在野蛮生长，你却在岁月静好，怪谁呢。

张泉灵从主持人蜕变为投资人，成长速度已经很快了，却还是觉得自己走得太慢。也经常会有朋友劝我：<strong>慢慢来，不要太急，你太焦虑了。但我心里知道，和别人比起来，其实我已经慢成龟了。</strong>

但话说回来，这难道不是在创业公司最大的魅力么，<strong>能够在短时间内迅速给你撕裂般的成长。接的住，世界就是你的，接不住，不要走这趟浑水。</strong>

怎么说呢，创业有创业的乐趣，稳定有稳定的好处，很多人口口声声说要辞职创业，其实只是对现状不满的说辞罢了，不要套上创业的帽子。而且话又说回来，创业并不是一种职业，而是一种把事情做到极致的态度，一种哪怕全世界都嘲笑，只笃定自己的信仰。这两点做到了，你就是在创业。

对了，还有一点－－";s:10:"post_title";s:63:"没事别想不开去创业公司，不小心就会碎成渣！";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:189:"%e6%b2%a1%e4%ba%8b%e5%88%ab%e6%83%b3%e4%b8%8d%e5%bc%80%e5%8e%bb%e5%88%9b%e4%b8%9a%e5%85%ac%e5%8f%b8%ef%bc%8c%e4%b8%8d%e5%b0%8f%e5%bf%83%e5%b0%b1%e4%bc%9a%e7%a2%8e%e6%88%90%e6%b8%a3%ef%bc%81";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-26 19:24:31";s:17:"post_modified_gmt";s:19:"2016-07-26 11:24:31";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1053";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}