[��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"238";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-18 18:57:40";s:13:"post_date_gmt";s:19:"2016-07-18 10:57:40";s:12:"post_content";s:6537:"<div class="content-banner"><img src="http://cdc.tencent.com/wp-content/uploads/2015/10/Blog-banner1-20151014.jpg" alt="" /></div>
<div class="content-text">
昨天面试了一个毕业生。每次我都会以“你有什么问题想问我的”作为面试的最后一个环节 。一来想了解应聘者对我们和整个面试过程还有什么疑惑的，二来也想通过这个问题，再看看应聘者关注什么，是进一步了解对方的机会。所以昨天那位毕业生最后一个问题是：我怎么才能成为一名及格的设计师？<span id="more-8660"></span>

出于对应聘者严谨和负责的态度，我跟她确认，你所谓的及格是指哪一级别的标准呢？因为在腾讯，我们是有职业发展体系的，在体系下每一个级别都有不同的评判标准，能力模型都列得蛮详细的。她说是高级以上的，很想知道标准是什么，怎样才能做到。

其实每次通道面试，我都会跟大家说，主要的评判点是影响力，在一定的时间要求和绩效要求之下，重要的就是看你在团队和项目里面的影响力啦。而且，晋级评审陈述的关键是，你要讲出来“世界因你而不同的那部分”，因为只有那一部分才是你的价值所在。这样，我们可以拿掉运气部分，看真正的专业实力了。不同的级别，不同的影响力表现，这里不一一展开。

前面铺垫了这么多，其实是想分享，除了能力模型里面的要求，关于个人努力部分，怎样做才能成为一名好的设计师。感谢那位同学的提问，让我在短时间内小小总结了一下前面十几年职业生涯里的思考。
<h2>一、热爱</h2>
怎样成为一名及格的设计师，我想第一个必要条件是热爱吧。这也是我招人除了颜值以外，非常重要的一个标准。

假如你不是对这个领域有充分的热爱，就无法在遇到困难的时候面对和坚持。工作和成长的路上，总是困难重重，初入行的新人因为转行成本低，最容易在这个时候放弃自己的初心。只有真的热爱，才会在这些时候有坚持的勇气。一如沉迷游戏的玩家，为了游戏，不吃不睡，把很多的事情放一边。所以我们也看到，只有那些对某事物热爱到痴迷的程度，才会多年如一日全身心的为此投入，才会不计较那些无关紧要的得失，才能成为那个领域的专家。
<h2>二、经验</h2>
记得以前很多很多人说，设计是青春饭，只有年轻的时候才有好的灵感。在我工作多年以后，才知道那都是懒惰的借口。首先我们得明白创意怎么来的？真是石头爆出的悟空，平白无故就产生了吗？最近有朋友推荐我看《推背图》，说原来运势这种东西是真有，而不是一直以来他所认为的唯心主义的推测。其实我对于此领悟得还算早。运势占卜并不完全是神鬼之说，是有一定的科学依据的。比如实验室里面的各种物理化学试验，都是同一逻辑，不同的事物在一定的条件下会发生什么样的反应是有规律的。只要我们通过各种试验，掌握了规律，那么试验的结果应该是可以被预测的。如此逻辑，社会和处于社会里面的个人，也是一样。 如果我们掌握了反应的条件规律，那么趋势也是可以被预测的。所谓先知，就是对这些条件的捕捉特别敏感之人。

扯远了，其实创意也是一样。创意并不是平白无故产生的，也是在一些条件下你的思维产生的反应而已。你积累的材料多了，接受刺激的敏感度高，创意就活跃。如果没有积累的东西，又不勤快，就像各种“惰性”物质一样，很难发生反应。

所以，一个好的设计师，必然是经过了时间的积累，我不相信凭空而出的东西，就像这个世界上并没有真正意义上的创造一样。如果没有足够的材料，根本无法产生反应。

所以，在这一点上，我是不认为工作与生活要分开的，只有全天候，才能比别人积累更多。而设计的终极目标其实是让人与人之间更好的沟通，而设计师就是在设计沟通的媒介和方式。如果不是对人，对人性有充分的了解，是做不出好的设计的。而对人和人性的了解，也离不开生活中点点滴滴的积累和感悟。这也是设计很好玩的地方，我们随时随地都有很多好玩的东西发生。
<h2>三、悟性</h2>
前面讲的两条都很实在，可衡量。说到悟性，又有点虚了。悟性看似天生。有些东西，确实也是天赋，或者说，后天的训练中，有些人就是轻易达到，有些人就是比较困难。所以，每个行业的人都有每个行业不同的特征。设计还是需要一点悟性的。否则，光是一腔热情，然后经过很多年经验的积累，那些沉淀下来的东西也就一直躺在那里，它不会变成你的宝藏。多学习多思考，锻炼逻辑思维，对事物用心看，而不只是用眼睛看，然后多试错，是悟性的训练方式吧。暂时悟性这东西，知道很重要，但是不知道怎样才能很好提高。后面我想通了再说吧。
<h2>四、智慧</h2>
好的设计师必须是一个有智慧的人！以前有人说，招人就要招聪明的人，可教训告诉我，聪明的人如果找不好，会带来无穷的麻烦。所以，我们应该招有智慧的人，才是最好的合作伙伴。那么，什么才是智慧呢？这几点列的很好，也是我一直努力的标准。

在1980年代末期，麦克斯普朗克人类发展学会发起了一项名为“柏林智慧研究”的研究项目，并给智慧下了一个定义，智慧即要具备：
– 学术知识
– 生活实用知识
– 出众的判断力
– 出色的解决问题能力
– 从经验中学习的能力
– 谦虚
– 情绪回弹力，或称能从挫折中迅速恢复的能力（达观）
– 心胸开阔，或称能坦诚地向世界展示真实的自己的这种成熟心态
– 对人本性有深刻了解，包括对来自不同文化背景的人的同情理解，感同身受的能力

前面的这些，是面试时思考一分钟后得出的答案，瞬间能提炼出来的一定是在我脑海里面非常突出的印象。可能对初入设计行业的同学有用，所以写下来，希望可以分享给更多的人。
并共勉！

</div>";s:10:"post_title";s:57:"毕业生问：怎么样成为一名及格的设计师？";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:171:"%e6%af%95%e4%b8%9a%e7%94%9f%e9%97%ae%ef%bc%9a%e6%80%8e%e4%b9%88%e6%a0%b7%e6%88%90%e4%b8%ba%e4%b8%80%e5%90%8d%e5%8f%8a%e6%a0%bc%e7%9a%84%e8%ae%be%e8%ae%a1%e5%b8%88%ef%bc%9f";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-19 12:38:02";s:17:"post_modified_gmt";s:19:"2016-07-19 04:38:02";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=238";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"1";}}