FǐZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1316;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-06-28 16:52:21";s:13:"post_date_gmt";s:19:"2016-06-28 08:52:21";s:12:"post_content";s:11654:"<section class="headimg"><img src="https://pic.36krcnd.com/avatar/201607/28032323/h6hbz0sx8e524p08.jpg%21heading" alt="那些创业失败的人都去哪儿了？" /></section>
<div><section class="textblock">曾经一位很资深而奇特的商学院教授讲，<strong>成功学就是扯淡。</strong>首先，每个人成功的因素各不相同而不可复制，如同将托尔斯泰的名言“幸福的家庭都是相似的，不幸的家庭各有各的不幸”进行镜像取反。其次，有些核心的成功因素也不足为外人道也，正如名言<strong>“能力之外的资本等于零”</strong>，你懂的。

斯 坦福商学院有个重量级的讲座系列叫做View From The Top，会定期请到全球政商界的顶尖人物来分享心灵鸡汤和成功学，乔布斯和比尔盖茨都曾来过。甚至有八卦传言，乔布斯就是在这个讲座上认识了他后来的妻子 Laurene Powell Jobs。Laurene 当时还是斯坦福商学院的学生，参加讲座时故意坐在前排，引起乔布斯注意并在讲座后热情追求，最终修得正果。（画外音：老师让我们前排就坐，不余欺也）

然而这位教授就说View From The Top然并卵，不如搞一个View From The Bottom，<strong>找一些著名的创业失败者来讲，因为许多创业的坑是共通的，分享出来大家一起避免而造福社会。</strong>

<img src="https://pic.36krcnd.com/avatar/201607/28024801/0jt4chloxw8f3dlc.png%21heading" alt="那些创业失败的人都去哪儿了？" data-img-size-val="489,224" />

在心中埋下多年的这枚种子，在回答完这个问题（<em>拿了投资人的钱却创业失败，在商业圈子里的后果都会有哪些？ - 参考文末阅读</em>）后，开始发芽。于是找到几个朋友一起，把通讯录仔细过了一遍，找出所有创业失败的朋友（共有80-90个案例），并统计他们创业失败的原因以及创业后的去处，形成如下的结果。
<h2><strong>英雄为何失意</strong></h2>
在研究创业者为何失败时，简单将理由分为六大类。（注：因为取样的问题，这里的大部分创业者从事新兴行业，所以可能会有取样偏差）

<strong>模式问题</strong>，占43%。各种主打市梦率的创业公司，在新经济的大旗下，尝试各种颠覆一切的新模式，从电商到移动互联网，从O2O到企业端服务。但是随着市场风云变幻，概念或模式往往会迅速由香转臭。随着泡沫的破灭，这些企业会迅速因为融不到钱而倒闭或泯然于人群之中。

<strong>运营问题</strong>，占23%。在模式清晰或者找准赛道的情况下，创业企业往往也会因为跑得不够快或者竞争太激烈或者自身太失败等多种情况，运营不下去而彻底失败。

<strong>团队打架</strong>，占21%。如果以上两条都在天灾的话，团队打架是绝对的人祸，而人祸往往比天灾更可怕。

<strong>股东出手</strong>，占7%。不怕神一样的对手，就怕猪一样的队友。而当股东想强势介入的时候，几乎就可以直接宣布创业企业的终止。

<strong>家庭原因</strong>，占4%。“世上只有妈妈好……”

<strong>政策问题</strong>，占2%。你懂的，不解释了。

<img src="https://pic.36krcnd.com/avatar/201607/28024938/w7iqst0o3dpvw0ze.png%21heading" alt="那些创业失败的人都去哪儿了？" data-img-size-val="720,351" />
<h2><strong>失意英雄落何处</strong></h2>
第一部分是探讨创业者失败后的去处。首先是定义，“创业者”严格指公司最核心的一到两号人物；“失败”可理解为公司退出失败（至少是让天使投资人有10倍的回报），以及创业者在公司退出成功之前离开。其次将去处划分为三大通路：<strong>继续创业、打工和投资。</strong>这里不考虑休息这条通路，因为几乎没有人选择直接退休或者去养老。

<img src="https://pic.36krcnd.com/avatar/201607/28025213/54xbwlehd3x40nus.png%21heading" alt="那些创业失败的人都去哪儿了？" data-img-size-val="634,378" />

由上图可以发现，在创业失败后的第一步，<strong>41%的创业者会选择继续创业；40%的会选择去打工而安稳一阵；19%的会凭借创业这段经历，晋级为投资人。</strong>看起来创业失败后，打工和继续创业是一个区别不大的选择。

然而再多看一步，就会发现其中的蹊跷。
<ul class=" list-paddingleft-2">
 	<li>40%在第一步选择去打工的创业者，在短暂调整后，会有13%绝对数的创业者选择继续创业，3%绝对数的创业者会接下来去做投资，从而只有24%的失败创业者在当下老老实实打工</li>
 	<li>在失败后直接选择创业的人一开始只有41%，但是通过做投资和打工短暂调整后，又有14%的创业者接着再创业，将比例提升到55%</li>
 	<li>在当前的稳态（用红色数字标出）：继续创业的人提升到55%，打工的人大幅降低到24%，投资的人基本持平在21%</li>
 	<li>考虑到创业失败的概率极高以及一旦开始投资后流出概率极低（5.6%=1%/21%），<strong>大部分人都会以投资作为终点</strong></li>
 	<li>如果连续动态得观测这些创业者的变化，结果如下图，这是一个马可夫链的问题。为了不掉粉，就不列出来转换矩阵以及更改下图的数字了。</li>
</ul>
<img src="https://pic.36krcnd.com/avatar/201607/28025231/sw9ijozxeyfdwlvw.png%21heading" alt="那些创业失败的人都去哪儿了？" data-img-size-val="720,349" />

枯燥的数字大家不爱看，还是举几个身边的例子，容易有更直观的认识。

人 物A，非常一般的大学毕业，在运营商做点基础的技术工作。不堪忍受运营商的慢节奏，在2001年左右出来单干，以开发PC客户端产品为主，那也是PC客户 端比较黄金的年代，站住一个细分领域就能生存。一开始做得不错，但是对于风险投资完全没概念，拒绝了IDG等大牌VC的投资条款，从一个师兄+老乡所掌管 的大集团那里拿了投资，其实也不是标准的投资，就是每月实报实销公司花费；师兄还答应他尽快将其概念多多的公司装入到上市壳公司中。结果大集团后来出现重 大变故，现金流当月断掉，A的公司立即垮掉，A也因此生了一场大病。后来另一家美股上市公司爱惜A的才能（曾提出过收购A的公司，但遭其拒绝），将其招致 麾下负责一重要项目，同时休养一段。在该上市公司混了一年多，也因为项目终止的缘故，更因为按捺不住冲动的创业癌，又出来创业。

人物B，海 外名校MBA回国后立即创业，正处在移动互联网爆发的前期。但是产品一直没找到合适的方向，或者说PMF不够，而且也不是很决绝，当初也考虑过做投资的各 种机会。所以这次创业很快失败，然后加入一大外企负责中国市场，做得风生水起，然后转行开创基金做投资了，算是回到了初心。

人物C，重点大 学商科毕业，在外企混了一两年销售之后自己创业，小打小闹各种折腾，赚了点小钱在北京买房，但觉得这不是长久之计，也感到自身需要提高，于是成功申请到海 外名校MBA并完成学业。读书期间也是思考各种创业机会，但毕业后终究还是服从于现实，回归到大外企做销售。几年后依旧按捺不住创业的癌，再次回归到创业 大潮，不过这次是互联网+O2O创业了，也很快拿到知名VC投资。但是风口选得太早，VC也对其业务发展太慢表示不满意，逼其转型以及强行搭配合并其他公 司未果之后，股东会直接将C撵走。C闲逛一段时间后，到某外企混中国区首代，但不久后，再次走上创业之路，这次选择的仍是风口浪尖上的方向及模式。

人 物D，重点大学工科毕业，在运营商混迹多年之后，产品感觉和技术感觉却越发强悍。携技术、产品及人脉优势出来创业，最早的一批移动互联网创业及App开 发，其方向绝对是超前于时代和代差打击同类产品，并迅速拿到顶级VC的投资。同时利用其运营商资源，迅速打开通路，获得运营商顶级合作资源。然而成也萧何 败萧何，成功路径依赖害死人，运营商的顶级合作，旁人从技术上和从关系上都难以拿到，却被创业者D搞定了，然而也限制了创业者D向toC产品方向的转换， 明明一个可以积累大用户量的toC产品，却做成了跪舔运营商分成的toB生意。然而凭借其产品优势，曾有上市公司提出收购，却因为回报倍数不够而遭投资人 搅黄。最后眼睁睁看着移动互联网起来，将其产品和技术优势一点点抹平，公司也做得越来越索然无味。在经历快十年的折腾后，投资人不管了，创业者D也黯然离 场。但是D仍然不甘心，小打小闹尝试着各种似懂非懂的创业项目。

人物E，重点大学工科毕业，在软件公司工作并做过高级程序员及项目经理。后 来出来创业，尝试付费社区方向，然而仍然是太早成为先烈，四五年前哪里能想到今天的值乎和分答以及各种视频VIP付费。主营项目拖拖拉拉多年，不死不活难 以融到钱，只有靠各种外包维持团队，好在团队异常团结没有散掉，但却一直没有找到大方向。最后实在撑不住了，考虑到家庭等多重原因，人走团队还继续尝试各 种新方向和外包，E找了一个创业公司先安稳几年。
<h2><strong>英雄如何疗伤</strong></h2>
任何一次创业失败后， 创业者在心理上、在身体上、在社会关系上、在家庭关系上以及在个人财富上都会遭受一次或重或轻的创伤，都需要一段或短或长的时间进行调整，因此短暂的打 工，往往是最佳选择，修复伤口同时积累资源。甚至有基金搞出了EIR ( Entrepreneur In Resident），这简直就是为失败创业者提供的专属“病床”。国内提供EIR的基金包括：真格、经纬等，傅胜就是EIR疗伤成功后放出的“猎豹”。

短暂的休整之后，往往又重新开始战斗，而在此选择战斗往往还是奔赴创业的最前线。<strong>这种戒不掉的癌，第一是来自不服气</strong>，眼睁睁看见原来一起撒尿和泥的朋友起高楼，而自己距离成功也曾如此接近，再来一次肯定会赢，或多或少会有赌徒心态。要是在深圳的创业圈呆呆，很快就能听到有人和你讲述当年和马化腾在一层楼或者一条街创业的故事。<strong>第二是来自拴不住，再大的草原也圈不住这些创业过的野马再次奔腾的心</strong>，创业过的人很难再次接受大公司里面惯有的官僚文化、颐指气使以及大象漫步。<strong>第三是来自于“恶劣”的外因</strong>，有过创业经验的人，无论是成败与否，在如今的资产荒中都是投资人眼中的香饽饽，威逼利诱都会让他们出来再试一把。

而只有当创业疲了累了，他们往往才会选择投资作为终结状态，天使或者VC投资是一种进可攻退可守的职业，或许这也算一种癌的治愈。

不管怎么样，生活还是要继续。无论是选择打工，还是投资，还是继续创业，他们都是孤胆英雄。

</section></div>";s:10:"post_title";s:42:"那些创业失败的人都去哪儿了？";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:126:"%e9%82%a3%e4%ba%9b%e5%88%9b%e4%b8%9a%e5%a4%b1%e8%b4%a5%e7%9a%84%e4%ba%ba%e9%83%bd%e5%8e%bb%e5%93%aa%e5%84%bf%e4%ba%86%ef%bc%9f";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-28 16:52:48";s:17:"post_modified_gmt";s:19:"2016-07-28 08:52:48";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1316";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}