�ːZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:1322;s:11:"post_author";s:1:"3";s:9:"post_date";s:19:"2015-07-28 17:00:13";s:13:"post_date_gmt";s:19:"2015-07-28 09:00:13";s:12:"post_content";s:14514:"仲量联行酒店集团和中国旅游饭店业协会于2012年所共同发布的<a href="http://www.traveldaily.cn/article/66322.html" target="_blank">《中国饭店市场城市景气分析》</a>报告指出，目前中国平均每四天就有一家国际品牌酒店开业，中国已经成为世界上增长最快、竞争最激烈的酒店市场之一。然而，当来自西方的酒店集团遇见东方的消费者时，由于语言以及文化的差异，往往无法将好的产品所创造出的价值成功的推广至中国市场，获取中国消费者的芳心。知名数字智商调研公司L2在其<a href="http://www.traveldaily.cn/article/68642.html" target="_blank">2013 L2 Think Tank的酒店数字智商研究</a>中指出，很多国际酒店虽然都专注于在中国市场进行快速扩张，但它们在在线渠道的竞争当中已经错失了良机，其中最突出的问题之一就是，虽然许多国际酒店都对其面向中国市场的酒店页面提供了中文的选择，但它们却没有针对其国际酒店页面或预订流程提供中文版本。
<blockquote>任职于北京某互联网公司的张先生是典型的商务旅客，他是多家国际酒店品牌的会员，并且经常通过酒店官网预订，他表示之所以这样主要是因为酒店的照片，“因为你不会觉得像是一个酒店的官网，而是会被拥有故事情节的照片所引领而很自然而然的就完成了预订。”然而，他认为许多国际酒店集团的中文网站存在着几个问题:信息过于单一，仅介绍酒店本身，对于酒店所在地周边信息介绍不够充分，也未提供针对特定兴趣群体所需要的信息；网站缺少互动，未提供社交网站的内容与在线客服等。此外，在预订某些产品时页面经常自动跳转至英文页面，以及许多网站的设计让用户很容易迷失。</blockquote>
针对国际酒店集团的中文网站在用户体验方面所面临的困境，唐硕用户体验设计咨询公司（以下简称唐硕咨询）的CEO黄峰说道这是由于多个因素所造成的；其中最根本的原因在于，许多国际酒店集团的中文版网站的规划与设计皆由位于欧美的总部或外国设计团队所主导，沟通成本高，且因为语言的不同与时差关系整体沟通效率低。且这些位于总部的团队或咨询公司，通常第一时间会以国内知名的OTA网站作为其调研对象，以了解国内用户的使用习惯，并经常套用类似的版面设计或作法。其次，国际酒店集团对于品牌视觉识别系统的规范具有高要求，往往面向中国市场的中文网站会几乎完全套用英文网站文案，只将其译成中文同时使用与其他语言完全相同的视觉与色彩元素，中文使用者在阅读网站内容时很容易会感受到语句不通顺、别扭的情况，且会发现酒店照片或视频中的人物均以西方面孔居多。然而，最严重的问题是非本地化的营销和预订环节。这些问题使得中国的旅游消费者在浏览或预订酒店产品时很难完全融入到“故事情境”中。因此，他认为绝大部分的酒店品牌中文官网充其量是个中译版本的网站，他们真正忽略了最关键的因素“以中文使用者为核心的网站体验设计流程。”他补充道，“不同地域的用户差异不仅局限于语言，他们对内容的关注、使用习惯、决策制定、视觉以及情感偏好都存在差异性。同时，相较于传统的电子商务网站，旅游相关网站的品牌故事与内容质量在用户体验中扮演着非常重要的角色。”

2011年，全球最大的国际酒店管理集团<a href="http://www.ihg.com/hotels/gb/en/reservation" target="_blank">InterContinental Hotels Group</a> (简称洲际集团)，即开始考虑打造更符合中国消费者需求的品牌入口网站，以提升其在中国的在线市场占有率。<a href="http://www.ihg.com/hotels/cn/zh/reservation" target="_blank">洲际集团大中华区网站</a>与互动营销产品经理James Xu表示，该酒店品牌的目标是“本土国际化(Glocal)”，他进一步说明“随着时间的推移和功能的进一步优化， 我们希望新中文网站能够成为中国客户与洲际交流的一个门户网站， 所有的客户所需要的服务都能够通过网站来获得或者提供合适的指引，促进网站预订量的增长。”

然而，与其他国际酒店面临着相同的情况，洲际集团旗下拥有洲际、英迪格、皇冠假日、假日酒店和智选假日酒店等多个品牌。且每个品牌均面向不同的消费群体与需求，如何让使用中文的消费者可以轻松完成对洲际集团旗下从经济中档到高端五星不同品牌在网站上的搜寻、浏览、询价及预订等行为成为了该集团迫切的任务。

唐硕咨询两年前开始帮助洲际集团规划并设计其<a href="http://cn.ihg.com/" target="_blank">全新中文入口网站</a>和移动服务，对于国际酒店集团如何才能打造更为贴近中文使用者需求的E-Service，黄峰提出了以下五大网站整体设计规划与执行的建议：

<strong>• </strong><strong>以用户为核心(Customer Centric)的E-Service设计研发流程</strong>

黄峰表示，国际酒店集团应回归最基本的用户需求点，根据其所服务的客户群进行详细的用户研究与评测以挖掘用户对酒店品牌、产品的需求偏好及期望，并深入了解酒店目前的各个渠道在旅行者的旅游生态链(Travel Ecosystem)中扮演着什么角色，渠道之间如何进行互相协作，以打造适合该细分目标群体线上与线下跨渠道的服务体验。他以洲际集团为例，其旗下拥有多个品牌，其中洲际的品牌主要定位为高端消费族群，一般为国内外企的中高层管理人员与政府官员，他们被品牌的洋范儿及其悠久的历史所吸引，此族群受过良好教育，具备国际化的视野并孰稔英语，对于文案以及视觉的审美观都具较高的要求，因此国际酒店品牌不能因为一昧的本地化而忽略了消费者真正的需求。酒店应通过现场观察、实际访谈和进行可用性测试以及对跳出率、ROI等数据进行分析的方式，来深入了解本地用户的需求。”

<strong>• 国际化的水准，本地化的思维</strong>

国际酒店集团一般对全球各地官网的内容拥有统一的要求，绝大部分的内容与图片都由总部完成后再译成各国语言，然而面对文化背景具有极大差异的中国市场，国际酒店应如何在保持品牌官网的统一性与当地化之间如何平衡呢?黄峰表示“国际酒店不应陷入本地化的误区中，而是要拥有本地化的思维但同时保持国际化品牌的定位与水准。”他特别指出事实上国际酒店集团旗下中高端的品牌，东西方之间的网络使用者习惯与视觉上的偏好差异性并不大，主要的差异呈现在所涵盖的内容、预订环节以及社交媒体运用的思维逻辑上。且，多品牌酒店旗下各个档次酒店之间的设计细微处取决于网站的目标和定位，以及市场营销活动的设计上，因此，在本地化的过程中，整体的品牌视觉应统一维持国际化的水准，不应该在未洞悉真正目标群体的需求前就以中文拼音为其域名，或过多的在网页上使用所谓中国色，如红色以求中国消费者的青睐。

但他强调，内容本身而言确实要优先考虑将中国用户关注和使用最多的信息简洁明了地呈现在网页上，例如高端用户更注重酒店的设施服务，年轻族群则更关注性价比。同时，国际酒店经常忽略的的是中国消费者所认知的一些必要元素，如装修时间、房间大小、是否提供“免费”Wifi或 “免费”早餐等信息。此外，输入框的设计与交互方式也需要足够的本地化，这意味着尽量使用本地用户已有认知结构中的语言。他表示“国际酒店要如何在国际化与本地化之间抓到“度”的平衡是其所要面对的最重要的挑战之一。”

<strong>• 跨渠道整合并充分与社交媒体融合</strong>

以洲际集团为例，唐硕咨询为其提供的是跨渠道用户体验设计服务（Cross Channel eService），这意味着洲际集团可以实现包括Web、WAP、APP、微信、微博、email、SMS等数字渠道的整合和其间的用户互动。此外，黄峰认为中国市场拥有其独特的社交媒体生态，因此，国际酒店集团需要积极加以利用微博、微信等重要的社交媒体渠道，他进一步强调“社交媒体不应是官网上的一个分享功能仅此而已，而应跨多渠道全面的与产品和服务融合在一起。且酒店在决定如何开展社交媒体功能前应先从策略出发深入的去了解目前消费者在其App、手机等各个渠道以及社交媒体之间如何与品牌进行互动的。”

<strong>• 酒店品牌故事与目标族群的视觉偏好</strong>

酒店品牌是创造国际酒店官网中文用户体验最关键的因素之一，黄峰表示国际酒店集团应善于利用其历史悠久的品牌故事，以“说故事的方式”通过文案、图片或视频来吸引中国消费者。网站页面的布局、配色、字体与大小等诸多元素皆会因为东西方文化的差异而有所不同，页面或品牌的颜色更象征着不同的含意。然而，相较其他有形产品的电子商务网站，酒店所销售的是无形的产品，因此最能直接影响用户感知的因素是照片。照片会传递情感是影响用户从Looker(浏览者)转变为Booker(购买者)的重要因素。国际酒店应更好的利用酒店本身地理位置优势的内容，例如使用海边风光景色图片来强调度假酒店的氛围，以吸引休闲游客。

<strong>• 一步到位的产品预订流程</strong>

黄峰说在其与酒店合作过程中发现，预订与支付环节往往是许多中国消费者放弃使用国际酒店官网最重要的因素，许多国际酒店集团网站的预订页面没有指引步骤，且因酒店使用中央预订系统，在预订时其页面经常会跳转到英文页面，这个步骤往流失了大量的潜在顾客。而早已熟悉国内主要OTA预订流程的中国用户，在面对西方式思维的繁杂预订流程时很容易迷失，同时，国际酒店通常仅提供国外信用卡支付的选择，中国消费者则更倾向使用前台现付、支付宝、银联等本地化支付选择。

随着国内消费的大幅增长，许多国际酒店集团在华扩张步伐加速，本土客人已渐渐成为主流客源，其中多个品牌均争相推出中国式的服务。然而，当我们在观察国际酒店品牌的时候，往往仅将注意力放在其所提供的产品与服务、营销手法与酒店本身的设计风格等光环上，甚少关注其所面对中国市场中文官网的使用者体验。究竟国际酒店应如何寻找合适的咨询公司来与其共同打造酒店中文官网? 洲际集团的James分享了其经验“酒店需要寻找能够非常了解中国市场以及国内客人习惯的合作伙伴， 并且能够提供切合实际的意见和设计， 同时还要有和国际集团及企业合作的经验和能力，以及对酒店集团乃至酒店业能够有一定了解。”黄峰则表示，国际酒店在与网站设计谘询公司合作时需要充分的沟通、相互的认知与尊重，且双方需要一段时间来彼此磨和。然而，国际酒店集团是否能给予本地设计团队充分的授权、酒店是否从网站执行人员乃至高层拥有一致的共识、高层管理人员对于执行团队的认同以及其决策能力才是影响网站最终是否成功的关键因素。其强调“消费者随著时间其需求会改变，网站与内容都是静态的，而服务与用户的场景(Scenario Context)却是动态、活的，酒店中文官网能用不等于易用，易用不等于好用，必须经过由内及外的本地化，才能给予用户最顺畅的网站使用体验，以创造最大的价值。”

<strong>编辑语:</strong>

国际酒店集团的本地化电子商务之路，看似跨出了一小步，然而，此后还有漫漫长路需要突破。眼前从如何跟上中国消费者本地化需求上的变化、内部流程与多渠道的整合、至集团能否改变思维提供更多授权等各个面向均面临着挑战。借用今年11月即将举行的PhoCusWright旅游年度峰会的主题 “Cult of Context”所强调的“语境化”之下的旅游消费新浪潮的体验：面对中国市场国际酒店集团电子商务本地化成功的秘诀在于满足中国旅行者个性化的需求。中国旅行者对于那些平庸的设计以及那些强调“中文化”但却名不副实的网站或服务已无法再给予宽容。

基于全中文语境的前提下，历经两年的打造全新的洲际酒店入口网站似乎更符合国内用户的使用习惯，以下我们总结了9个亮点：

• 精简域名且统一资源成为所有旗下品牌的唯一入口网站。

• 页面设计更为简洁，相较原来的中文版首页，着重三大重点包含快速预订、营销活动与优惠信息以及洲际旗下各个品牌的Logo。

•酒店页面所使用的图片更为本地化，使用东方面孔与酒店所在城市相关的旅游景点图片。

• 订房中心服务电话位于首页左上方凸显的位置，并于每个内页中均显示客服电话。

• 提供智能化城市选择，城市输入框支持拼音排序，以及国内用户所熟悉的热门城市列表功能。

• 已提供支付宝服务，但尚未提供银联或其他本地银行的支付选择，预订酒店无需信用卡的担保或加入会员，可直接进行预订并提供国内消费者更偏好的到店支付选择。

• 其集团重新设计的云服务器系统，使得网站响应与加载速度更快。

• 预订流程大幅简化，并于预订页面环节上方设有引导客户购买的步骤图，仅三步即可完成预订。

• 简化原本冗长的房型类别， 使用国内消费者更为熟悉的描述用语。";s:10:"post_title";s:69:"当西方遇见东方：国际酒店品牌的本地电子商务之路";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:198:"%e5%bd%93%e8%a5%bf%e6%96%b9%e9%81%87%e8%a7%81%e4%b8%9c%e6%96%b9%ef%bc%9a%e5%9b%bd%e9%99%85%e9%85%92%e5%ba%97%e5%93%81%e7%89%8c%e7%9a%84%e6%9c%ac%e5%9c%b0%e7%94%b5%e5%ad%90%e5%95%86%e5%8a%a1%e4%b9%8b";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-28 17:00:48";s:17:"post_modified_gmt";s:19:"2016-07-28 09:00:48";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:25:"http://qisumu.com/?p=1322";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}