�+�Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1924";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-08-12 16:47:50";s:13:"post_date_gmt";s:19:"2016-08-12 08:47:50";s:12:"post_content";s:12707:"<strong>服务设计的发展？</strong>

早在1982年美国人最早提出服务是需要进行设计的这么一个概念。再到2000年，出现了第一家专业的服务设计公司Live work。随后到了2004年，第一个服务设计国际交流平台出现。2011年，韩国服务设计协会成立。2015年国内服务设计逐渐被重视起来。

<strong>什么是服务设计？</strong>

服务设计是一个链路，一个完整的系统。在这个链路上有许多接触点（touchpoint），这些接触点就是提供者对接收者的一个服务点。客户体验的过程可能在银行，机场，办公室，厕所，咖啡厅，医院，零售商店或者街道上，服务设计将人与其他诸如沟通、环境、行为、物料等相互融合，并将以人为本的理念贯穿于始终。

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/743763.png" alt="743763" width="1882" height="1114" data-bd-imgshare-binded="1" />

<strong>服务设计的对象？</strong>

服务设计所适合的对象是所有提供服务的行业，他可以是饭店、学校、机场、医院、公共交通、餐厅、银行；也可以是手机、电视和网络，也就是线上和线下都可以称为服务设计对象。
<strong>服务设计的方法？</strong>

如角色模型、用户体验地图、服务路径、问题卡片、关键人物地图、人物分析网格、乐高桌面模型等等，前一篇文章大魔王媛媛有提到过用户体验地图，这就是其中一种方法，在这个用户体验路径中我们能了解到用户在体验整个产品中获得的兴奋点和痛点，收集相关信息之后再对这些个接触点去进行服务设计并优化。

<img class="alignnone size-full wp-image-70472" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/A57B544B-FE28-4C11-9CF0-F21056D88A64.png" alt="A57B544B-FE28-4C11-9CF0-F21056D88A64" width="1026" height="652" data-bd-imgshare-binded="1" />

但是我们在做服务设计的时候并非所有设计都必须考虑用户体验。

举个例子，当我们在地铁或者飞机场过安检的时候，经常要把一些我们认为不违规的物品从行李箱拿出来，然后行李箱才能托运，但是在背包安检的时候这个物品又被检测出来不能带上飞机，这个时候用户体验是非常差的，但是出于安全的考虑，在这部分服务中就舍弃掉了用户体验，所以我们在做用户体验的时候我们也必须考虑优先级。

<img class="alignnone size-full wp-image-70468" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/33ABC5C2-9AB4-4B17-9A77-EE5A86B9DD13.png" alt="33ABC5C2-9AB4-4B17-9A77-EE5A86B9DD13" width="497" height="300" data-bd-imgshare-binded="1" />

<strong>我们对于服务的理解，决定了我们将会获得什么样的服务</strong>

举个茶山老师在韩国的例子，在他的ixdc的分享视频中提到：

在韩国的乐天快餐店当服务员学习，他注意到了一个细节，每当客人点过餐后，厨房内负责制作套餐的小伙伴，必须大声重复喊出可人刚刚点过的那份套餐的名字。这样做，既是为了提醒其他小伙伴们马上做准备，也是为了反馈给客人：“我们正在为您快速配餐”。所以这里的一个关键词是－－－反馈。在服务设计中不但强调“反馈”，还强调“反馈感”，不但要强调线上的反馈，更要注意线下的反馈内容和效果。

<img class="alignnone size-full wp-image-70470" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/4548A6A2-9616-43D7-A7DC-6159D7342EF2.png" alt="4548A6A2-9616-43D7-A7DC-6159D7342EF2" width="465" height="308" data-bd-imgshare-binded="1" />

再举个例子：

很多人都使用过高德地图，当我们开始用导航的时候，他首先会向我们展示整条线路以及方向，再切换到起始地局部路线的展示。其实服务设计就是一个全局化，用户在在某个区间的行为轨迹，在针对轨迹内每个接触点做设计，如同驾驶员在驾驶的时候他聚焦还有多少路要转弯的时候，状态是很紧张的，但是如果一开始他就知道整体方向的时候整个驾驶都是一种享受。所以服务设计师最重要的一个基本能力就是懂得在适当的时候放大和缩小地图。

我们在日常生活中也遇到过比较差劲的人性化的设计（人性化设计也是服务设计的一种）：

<img class="alignnone size-full wp-image-70474" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/D29D2894-DA8C-43CC-9E22-2CCE68100F80.png" alt="D29D2894-DA8C-43CC-9E22-2CCE68100F80" width="392" height="340" data-bd-imgshare-binded="1" />

<strong>服务体验的优先级：</strong>

体验的优先级：<strong>顾虑－不满－体验－感动</strong>

我们经常说用户体验，中国的用户体验走过了10年，是在不断的强调体验，强调达到用户期待值以上的方案来感动用户，但是我们却忽略了顾虑和不满这两个最初的过程。

拿一个我今天刚好去看家具时候碰到的例子：

今天去家具广场买沙发，那么我就逛了几个牌子的店，期间我看中了一款单人沙发，带搁脚的小椅子，类似下图，我满心期待的坐上去之后发现一个很尴尬的问题，我到底要不要把脚搁上去呢，拖鞋我会觉得比较尴尬，万一我的脚很臭（虽然很香）在这个场合就会蜜汁尴尬，但是不脱鞋把搁脚椅子弄脏我也很不好意思，所以我心存顾虑可能只是就坐一下沙发并不会把脚放上去，但是这个沙发让我心存芥蒂之后可能我就不会购买了。然而另一家店同样有这个可以搁脚的沙发，他们的服务设计就比较贴心了，他们在搁脚沙发上面垫了一块透明的塑胶，不仅可以防止被客户弄脏，还能告诉客户这是可以放脚的不用脱鞋也没关系，同时不影响美观，这就很贴心了，讲真，要不是真的是因为那款沙发难看了一些，我就买下来了，所以那样做了措施，也是一种双赢的结果。

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/743783.png" alt="743783" width="412" height="389" data-bd-imgshare-binded="1" />

再举一个之前自己觉得比较尴尬的案例：

<img class="alignnone size-full wp-image-70477" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/WeChat_1470494340.png" alt="WeChat_1470494340" width="400" height="712" data-bd-imgshare-binded="1" />

这张图大家应该都不陌生，这是阿里当时在支付宝里推出的一个活动，意思是告诉用户这6年来你剁了几次手，贡献了多少钱。这张图是我ps过之后发到了朋友圈的，我为什么要ps一下再发上去呢，因为别人这6年都tmd花的比我多呀，他们发出来不就是让别人看看他们花了这么多钱，是个有钱人巴拉巴拉….所以那时候支付宝他们没有充分考虑到顾虑的优先级，坦白的说有些人很有钱但是他们不在淘宝买东西，自然这6年花的钱就并不多，所以他们就不会将这张图在微信进行转发，自然还有花钱比较少的一部分用户，也不愿意在朋友圈分享这个图片，自己感觉没面子，不好意思，所以效果其实并不理想。所以在服务体验的优先级上我们需要考虑到用户的顾虑和不满这两个问题是否解决，解决了之后再设计最面的体验问题和怎样让用户为之感动。

<strong>服务设计强调的是”幸福感”</strong>

来看下面一张图

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/743786.png" alt="743786" width="754" height="500" data-bd-imgshare-binded="1" />

<strong>服务设计和用户体验的主要区别：</strong>

主要区别之一就是服务设计的收益者是双方（提供者和接收者），而用户体验则聚焦于用户。

举个例子：在星爸爸喝咖啡，冬天我们知道很多餐厅包括星爸爸都会有一些座位靠近门口或正对门口，很多用户都不愿意坐在那个位置因为门一开一股冷风吹进来让人感觉非常糟糕，这时候是否可以通过坐在那个位置可以额外积分的方式来补偿用户，让用户心理好受点，同时星爸爸也获得了这个用户这次的消费，双赢。再或者如果用户自己带咖啡杯来喝咖啡，我们同样给他额外的积分，这样既节约了资源又给客户赚到了积分，这就是服务设计和用户体验的主要区别之一。

<img class="alignnone size-full wp-image-70475" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/E7ECC253-1970-4CE6-980B-8A0D91CDB179.png" alt="E7ECC253-1970-4CE6-980B-8A0D91CDB179" width="460" height="307" data-bd-imgshare-binded="1" />

所以用户体验则更多聚焦于用户，有时为了提升用户体验，而牺牲提供体验方的利益或者方便。

<strong>一些想法：</strong>

针对于我们目前的工作中，在部门内，团队合作中，是否可以运用到一些服务设计。例如：茶山老师有分享到，他说他在阿里做交互的时候，在写交互说明的时候最后加了一个内容叫做，交互总览，因为平时交互在做交互稿的时候它们只是把每一张单独领出来写交互说明，往往最后没有一个完整的思路或者流程，将这些写进文档之后，就算交互离职或者不在了，其他人同样能知道这个交互当时做这个交互时候的思路和流程，这就是一个我们可以在团队内部推行的一种服务设计，不仅帮自己理清思路完善流程，也帮助别人能更好的看懂交互稿。

那么我们视觉设计同样可以做一些服务设计来帮助我们的上游（产品，交互，用研），下游（iOS，安卓，测试）来更好的理解并且知道我们如此设计的目的，比如我们在做UI设计的时候的用色，排版，信息层级的展示，字体的大小，一个页面的设计思路可以写一份文档说明。举个例子：首页的信息展示，哪些信息更重要，要怎么显示，我们通过用户调研或者线上访谈之后的结论做出几种方案，经过怎么样的内部评估之后最后设计成了哪一种展示效果，这样的展示效果满足了用户的哪些需求，是否解决了用户的问题反馈。

以上是我做为视觉设计想到的一个服务上下游的点，通过这一的一个思路，能让上游理解为什么要这么设计，整个的设计思路是怎样的，这样他们就不会觉得你的设计稿就是将交互设计填个色那么简单，对下游的开发来说，他们有时候会为了时间成本以及技术难点的考虑，砍掉一些功能，或者操作，有了这样一份文档增加了视觉设计的说服力，为了提高用户体验并且同时达到了业务目标，他们就没理由推脱你的设计方案。

以下是一个例子，写的并不完整，这只是我个人的一些初步思路，因为我想，做为一个视觉设计，我们更重要的是站在用户的立场上设计出让用户觉得好用易用的设计，同时能达到业务目标，更重的是达到以上两点之后我还能服务团队内部，提高整一个ued或者产品开发团队的效率，以及帮助他们认识我们设计的价值，这样的设计才是有价值的，更是被重视的！而不是一拍脑袋我觉得这样设计用户肯定喜欢，这样的设计是没有用的。

<img class="attachment-full" src="http://78rbeb.com1.z0.glb.clouddn.com/wp-content/uploads/2016/08/743793.png" alt="743793" width="760" height="506" data-bd-imgshare-binded="1" />

<strong>总结</strong>

整篇文章写下来可能部分同学还是没有清楚服务设计的和用户体验设计，其实服务设计包含了用户体验设计，也包含人性化设计或者情感化设计等等。服务设计的一个重要特征就是服务设计受益者是服务的提供者和服务的接收者双方。如果一个设计只有接收者单独受益，那不能称之为服务设计，只能说是针对用户的用户体验设计。

最后，国内的服务设计还有很长的路要走，其实服务设计就在我们身边，细心观察，好的服务设计能让你喜出望外，更好的服务设计能让你心存感激。

想努力，趁现在。";s:10:"post_title";s:27:"关于服务设计的思考";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:81:"%e5%85%b3%e4%ba%8e%e6%9c%8d%e5%8a%a1%e8%ae%be%e8%ae%a1%e7%9a%84%e6%80%9d%e8%80%83";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-12 16:47:50";s:17:"post_modified_gmt";s:19:"2016-08-12 08:47:50";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1924";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}