��Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"2220";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-09-05 16:31:03";s:13:"post_date_gmt";s:19:"2016-09-05 08:31:03";s:12:"post_content";s:13870:"<div class="article-text">

又到了一年两度的招聘季时节，这个时间肯定有一大堆人都在海投面试。恰好最近又做了一份笔试题，顺便就来聊一聊交互设计笔试题要怎么做吧，最后附上40个常见的交互面试题，帮你打一场有准备的战斗！

国内大学几乎没有交互设计专业，所以如果想找个大牛带你学，最好是有从业经历和作品的。

我碰到过的交互设计笔试题有两种，一种就是两三个小时内给你三四道题，然后你做完立马交卷。这种笔试题一般会有一道设计题，其他都是论述题。这里的设计题你大概写一下思路，然后把原型图加上说明扔上去就可以了。论述题的话可以参考这份交互设计面试题汇总，如果这里涵盖不到的，可以搜索一下该公司去年或者前年的题目，剩下的就只能交给运气了。另一种形式是给你一道题目，然后给你一周时间出一套方案出来。不用担心，这些题目一般都不会太难，他们不能让你一周出一个app的整套方案，一般是一个功能模块或者一个运营活动，我这里主要讲的是第二种。

既然是设计笔试题，那么最终的方案肯定是最重要的，最终的方案涉及到的是个人的基本功问题，这里爱莫能助。但是，如果只是把一堆原型图扔上去，却又犯了一个大忌，毕竟交互设计师不仅仅是一个线框仔，更重要的是“设计前的逻辑推导”，方案的好坏可能无法一眼看出来，但是可以通过交互设计师的思路去验证方案的准确性。除此之外，还可以通过流程的完整性去保证方案的可行性。

设计前的逻辑推导，主要有这几个方面：用户需求、目标用户和使用场景。笔试题的题干可以看作是产品经理提交给你的需求，分析完这些需求之后需要分析目标用户，之后推导用户的典型使用场景，最后才是给出设计方案。

而流程的完整性方面，可以参考交互设计流程图，这是一个相对完整的设计流程，在做设计题的时候，你可以看看你能涵盖多少流程。我只能说，流程越完整，整个方案的说服力就越强，不过可能没那么多时间精力去做而已。

下面就通过我之前做的一个笔试题来详细讲讲。笔试题的题干如下图：

<img src="http://bbs.uigreat.com/uploadimgs/201609021011330_258384614.jpg" alt="" />

这是一个典型的运营活动的设计，运营活动有典型的三个目的：拉新、促活和增留存。这个题目设计到的主要有后两个方面。

拿到题目之后，你就把他当成一个需求。这个时候你会怎么做呢？如果是在公司，一般是还会追问目标用户等信息，然后再去分析需求。当然笔试中就直接进入分析环节。

<img src="http://bbs.uigreat.com/uploadimgs/201609021011341_93631079.jpg" alt="" />

一般我都是采用关键字提取的分析方法，然后会提取出一些设计点。不过在这次笔试题中，我觉得有一些地方有些奇怪，我把这些点罗列出来做进一步的讨论。

<img src="http://bbs.uigreat.com/uploadimgs/201609021011342_80564777.jpg" alt="" />

罗列完设计点之后，我发现有一些设定会干扰到我的设计，但是又没有产品经理来商量，所以在这里我倒推了一下产品需求（正常情况下其实是没有这一步的）。

<img src="http://bbs.uigreat.com/uploadimgs/201609021011343_1960595836.jpg" alt="" />

然后根据我的这个需求重新去验证我之前的设计点，然后才进入正式的设计工作。

<img src="http://bbs.uigreat.com/uploadimgs/201609021011344_1417116601.jpg" alt="" />

分析完需求之后的正式工作有目标用户分析和用户需求分析。

<img src="http://bbs.uigreat.com/uploadimgs/201609021011345_877657348.jpg" alt="" />

分析完之后可以开始画任务流程图，这里的流程图只是为了捋一捋思路而已，跟之后的页面流程图还是有一定区别的。

<img src="http://bbs.uigreat.com/uploadimgs/201609021011346_1256945766.jpg" alt="" />

有了任务流程之后，就可以开始设计工作了。然后我在这次笔试题中为了确保流程的完整性，我选用了一个可用性测试。作为最后的方案展示，我就先把可用性测试给展示出来，然后再陈述方案。测试提问大纲可以参考一下我罗列的这些点。

<img src="http://bbs.uigreat.com/uploadimgs/201609021011347_1813953367.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/201609021011348_1425587404.jpg" alt="" />

正式的方案陈述我一般就是两个部分，页面流程图和页面详解。具体见下面：

<img src="http://bbs.uigreat.com/uploadimgs/201609021011349_2009425339.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/2016090210113410_1902475616.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/2016090210113411_491830047.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/2016090210113512_660777012.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/2016090210113513_2053987555.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/2016090210113514_1852778263.jpg" alt="" /><img src="http://bbs.uigreat.com/uploadimgs/2016090210113515_1542517209.jpg" alt="" />

之前苦于交互设计没有面试的题库，所以一路下来自己都有留心收集一些面试题，今天就来做个汇总。

本来交互设计也是设计类，设计类的面试只要看作品说话而已。但是，偶尔有也会有些面试官完全都不理你的作品，然后会问一些比较宽泛的问题，今天的汇总就是主要针对这部分题目。题目大多都能回答，但是偶尔一个题目打过来还是会有点懵，所以事先做好准备会相对比较好。

最最重要的当然是介绍你的作品！介绍你的作品！介绍你的作品！（重要事情说三遍）

讲的思路就是你从什么地方找到设计的依据，然后做了什么设计。

下面就是面试的其他问题：

<strong>1、自我介绍。</strong>

答：（自我介绍算是面试的第一个题目，交互设计也一样。回答的时候要贴近交互设计来回来，一般就是说一些项目经历。但是如果没有的话，可以往交互设计师需要的素质上去扯。）

<strong>2、一些名词解释：“交互设计”、“信息架构”、“用户体验”、“故事版”等等。</strong>

答：（平时注意一下即可）

<strong>3、介绍一款app。</strong>

答：（笔试和面试题都有可能会遇到这种问题，注意挑选小而美的app，不然会讲不清楚。比如豆瓣一刻，艺术云图、故宫博物院，讲的时候要讲述交互设计上的亮点）

<strong>4、说说我们公司的产品都有哪些优缺点。</strong>

答：（这是一道血泪题，当初面试一家公司的时候就是跪在这个题目，所以面试前一定一定要自己先走查一遍，走查方法可以查看：交互设计走查表）

<strong>5、交互设计师需要什么样的素质？</strong>

答：同理心、逻辑思维、沟通能力、洞察力、总结能力、学历能力。（前两个我觉得最重要，必答，后面的看看自己有哪些就添加到回答里即可。记得说完一个素质之后要说明为什么这个对于交互设计师来说是必要的）

<strong>6、交互设计师在做什么？</strong>

答：（主要产出就是三部分：信息架构、任务流程以及页面线框图。其他的可以往用研上面扯一点）

<strong>7、你有什么优缺点？</strong>

答：（优点要贴近职位，缺点要远离职位）

<strong>8、我们为什么要录用你？</strong>

答：（自己为什么适合这个岗位，可以回答有关的素质，见题5）

<strong>9、举例一个好（坏）的交互形式。</strong>

答：（交互形式的好与坏都是根据场景来回答的，所以一定要说明场景）

<strong>10、你会因为什么原因拒绝我们公司？</strong>

答：①名不符实 ②个人能力得不到锻炼，个人价值的不到体现（总感觉这个回答还不够好）

<strong>11、你能为这个岗位带来什么？</strong>

答：（回答自己跟其他人不同的地方，参考一下我的回答）①年轻的想法的碰撞；②计算机背景有利于了解互联网的产品；③计算机背景有利于和开发沟通；④能做事。

<strong>12、说说你的职业规划。</strong>

答：（这个问题自己确实要想清楚）

<strong>13、你是如何理解互联网？</strong>

答：（很难回答，我那时候的回答大意就是”互联网拉近人与人，人与物“，然后再发挥一下）

<strong>14、面试官质疑你的能力？</strong>

答：①本科没有交互设计这个专业（后来知道原来有）；②交互设计师的背景各种各样，计算机出身的也不少；③我逻辑性不错，同理心也不错，适合做交互；④我学习能力很好，能快速上手

<strong>15、如果你和产品有分歧，你会怎么做？</strong>

答：摆事实、讲道理。

<strong>16、如果你和产品一致，但是和老板有分歧你会怎么做？</strong>

答：摆事实、讲道理。

<strong>17、你比较喜欢Material design设计还是iOS设计，为什么？</strong>

答：（我一般回答MD设计，主要讲了已瞎几个点：空间层级、动效、卡片控件和悬浮按钮。

<strong>18、当你感到不满时，你会怎么发泄？</strong>

答：（应该是hr面的时候问的，据实回答即可）

<strong>19、你父母对你的期待是什么？</strong>

答：（应该也是hr面的问题）

<strong>20、你为什么会来应聘本公司的交互设计？</strong>

答：（可以回答该公司的发展；也可以回答该公司设计上的优势）

<strong>21、你对本公司有多少了解？</strong>

答：（实现准备好相关资料）

<strong>22、能否接受加班？</strong>

答：能能能。

<strong>23、除了薪水，你还希望得到什么福利？</strong>

答：个人的成长。

<strong>24、你有想过创业吗？</strong>

答：（随便回答，但是如果有的话，最好把时间定在几年后）

<strong>25、你有什么问题要问我？</strong>

答：①交互设计师的素质；②交互设计方法论；③问刚刚面试中面试官提问的问题；④新人培养计划

<strong>26、xx事件从设计师的角度要怎么去改善。</strong>

答：（上次提问的是“电梯吃人事件”，我主要从“引导”、“反馈”和“容错”三个方面去回答的）

<strong>27、电商设计和你的项目设计有什么区别？</strong>

答：（讲一点小小的区别，我那时候是从理性和感性层面上来说的）

<strong>28、电商对用户有什么意义？</strong>

答：（类似的，其他公司可能会问他们产品可以带给用户什么）

<strong>29、你关注哪些产品公众号？</strong>

答：（很奇怪的问题，随便回答一下就好了，比如优设）

<strong>30、设计检验的方法有哪些？</strong>

答：自查：《如何建立交互设计自查表？》；他查：可用性测试、专家审查、A/B test；通过数据来检验。

<strong>31、举例用数据做交互的例子</strong>

答：①通过观察不同模块的渗透率，要分析渗透率低的模块的原因并解决问题；②观察任务流程每一步的流失率，并解决问题；③数据可以用于排序问题的设计；④如果数据带有时序，可以检验设计是否正确。（所有的都要举例子说明）

<strong>32、怎么自学交互的？</strong>

答：书、知乎、公司ued专栏、公开课还有朋友讨论学习。

<strong>33、看过什么书？哪本书的作用最大。</strong>

答：书单可以看这里：《超全面！给交互设计初学者的完全自学指南》，我觉得作用最大的书籍是《简约至上》。

<strong>34、pc端和移动端的设计有什么区别？</strong>

答：①场景多样化；②交互方式不同，鼠标和触屏；③输入方式不同，移动端有丰富的传感器；④移动端和人的绑定比较紧密，可以做推送；⑤移动端要考虑电池的问题；⑥屏幕大小不同。

<strong>35、为什么要做交互设计？</strong>

答：因为喜欢做，而且觉得自己能胜任交互的工作。

<strong>36、举例好的交互形式。</strong>

答：瀑布流、摇一摇、扫一扫、下拉刷新等等。

<strong>37、为什么我要招你这个本科生而不是研究生？</strong>

答：（这个问题确实很奇葩）①同等条件下，本科生便宜；②本科生更年轻更有精力。

<strong>38、用几句话总结你设计的亮点。</strong>

答：（说一说自己的设计和其他人不一样的地方）

<strong>39、tob和toc的交互设计有哪些不同之处。</strong>

答：①目标不一样，toc更多的是提高活跃度，tob是优化流程；②toc相对简单，tob比较复杂，所以要求逻辑性更好；③tob更加重视对于业务流程的理解

<strong>40、你希望的待遇是多少？</strong>

答：（这也是个血泪的问题，回答不好分分钟挂掉。对于应届生来说，我觉得你还是尽量让公司提就好了，实在非要提问的话，可以跟他要去年的数值做参考）

</div>
<div class="well">

文章来源: <strong class="mll">Yeah秋强</strong>

</div>";s:10:"post_title";s:48:"职场干货！如何解答交互设计笔试题";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:144:"%e8%81%8c%e5%9c%ba%e5%b9%b2%e8%b4%a7%ef%bc%81%e5%a6%82%e4%bd%95%e8%a7%a3%e7%ad%94%e4%ba%a4%e4%ba%92%e8%ae%be%e8%ae%a1%e7%ac%94%e8%af%95%e9%a2%98";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-09-05 16:31:03";s:17:"post_modified_gmt";s:19:"2016-09-05 08:31:03";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=2220";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}