���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:4:"1384";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-08-01 10:25:06";s:13:"post_date_gmt";s:19:"2016-08-01 02:25:06";s:12:"post_content";s:7716:"<h4>1. UIUX<b>是干嘛的？是应该读HCI吗？</b></h4>
美国的情况来看，一般学生毕业了大多追求这两种出路：一种是FLAG（LinkedIn没了，这个词改叫什么好？）之类的科技公司，做用户体验设计师或者产品设计师（名称不一样，略有差别），另一种是口碑很好的设计咨询公司，比如IDEO，frog，Huge，RG/A，总之就是帮助mastercard做品牌重设计那种公司。

这边有个特别好的文章，写的是各种名称不同的XX设计，具体职能是什么，推荐阅读：<a href="http://www.fastcodesign.com/3032719/ui-ux-who-does-what-a-designers-guide-to-the-tech-industry" target="_blank">www.fastcodesign.com</a>

不管你学的是HCI，还是偏向产品和体验的User centered design（IDEO和斯坦福d.school那个流派），还是更靠创业一点的更全面的设计（课表里有创业课+设计+产品那种），基本都是互通的，去哪类就业都没有太大阻碍，职位的细小差别一般也没有什么问题，看个人的喜好和长处。。

HCI在每个学校也不同，重点是一定要去官网了解课程安排。一般都是理论课加上项目，名校就会有很高大上的客户来给项目，比如CMU有NASA，有美国银行，有沃尔沃等等。这种做项目的，作品集容易攒，毕业也容易找工作，算是以业界就业（Industry）为导向的。还有些比较学术，会有很多理论，会有很前沿的科技，会写paper。硕士里这么学术的我了解不多，我估计（懒得搜，未证实）MIT是这个路线的。这个毕业了也不用担心工作，都这么牛逼了你担心啥。

<img class="alignnone size-full wp-image-194789" src="http://image.uisdc.com/wp-content/uploads/2016/07/hl201607295.png" alt="hl201607295" width="600" height="350" />

非常大的一个坑在这里：除了叫HCI的，很多名字不叫这个但内容差不多的。他们可能叫什么创业，创新，体验，产品，服务，设计……建议找候选专业的时候，不要只搜HCI，去CS和设计的大院系，把底下所有的小专业都看一遍，可能会遇到课程设置非常好，但名气不够响所以相对好申一点，甚至相比HCI更符合你的喜好的，我自己的专业就是这样。在这里顺便提下，很多来问我的人以为我是HCI的，但我从没有明示暗示过我是HCI专业的，只能说CMU的HCI名气太响。我是在一个简称MII-PS，中文直译为“产品与服务整合创新”的专业，我很喜欢这个专业，而且你看，这名字里一个human，computer，interaction的词都没有，好多学弟学妹都是认识我才知道这个专业。CMU有各种花里胡哨的专业，什么娱乐科技（ETC，游戏设计/编程相关），可触碰设计（好像叫Tangible Design，实体交互，他们的作品很酷炫）又特别爱搞交叉学科，欢迎仔细研究CMU的专业设置，不要死盯着HCI了……

一般来说CS底下的设计类都是STEM，但最好官网确认或者邮件小米确认。STEM当然有优势，但不是无限制的，比如期间不能失业累积超过三个月的时间，但真失业的话，当志愿者什么的都可以，总之有雇主就好，还是挺容易解决的。STEM长的话，可以避免第一年H1B就没抽到的问题，这些入学以后都会讲，我们当年入学的时候也很懵哔，到毕业时跟大家一起准备材料弄申请就好。

<img class="alignnone size-full wp-image-194791" src="http://image.uisdc.com/wp-content/uploads/2016/07/hl2016072912.png" alt="hl2016072912" width="600" height="380" />
<h4><strong>2. 设计相关专业转UIUX需要注意什么？</strong></h4>
首先是候选专业的问题。

为了保证至少拿到一个offer，要拉开梯度投申请。当然，每个人都有一些“给了我offer我也不会去”的学校，那种就真的别申了，除非你前面那句不是真心的。

除了梯度以外，注意前一题那个大坑。最容易申请到的是那些跟你原来专业有那么一丢丢关联的专业。

其次是怎么跨专业展示自己的优势。

比如你原来学EE或者工设，在申请结合了EE和工社的产品设计专业时，就可以用上以前的作品集了。如果你以前学建筑的，和产品设计软件设计都不相关怎么办呢，找思维，方法论和技能上的共通点，比如解决问题的能力，用户研究的能力，两者设计过程中重合的地方，手绘功底，这些都可以帮助你把PS和作品集做得更好。

比如说我自己是广告学背景，我就着重表现了设计能力和传播学，心理学的知识，发过国际会议paper应该还是满impressive的，至少证明学习能力不差，海外实习也是加分，因为可以证明自己适应多元文化。自己在本专业的优秀程度也很重要（GPA全专业第一，不过那只是上个学期，等申请完了出了下学期的分GPA就降回去了哈哈），不要以为转专业前成绩差都是专业的祸，转完就能突飞猛进了，站在对方立场想，是招一个一直优秀的，还是招一个不优秀但承诺只要过来上学就会优秀的人呢？

<img class="alignnone size-full wp-image-194796" src="http://image.uisdc.com/wp-content/uploads/2016/07/hl201607292.png" alt="hl201607292" width="600" height="542" />

最后是对UIUX的真心向往。

我在PS里提到了自己怎么接触到互联网和设计，为什么感兴趣，虽然不是科班出身，但零零散散地做了哪些努力。不要流露出天真和无知，别让人觉得你是感觉互联网有钱好混才转的就行。
<h4><strong>3. 如何准备作品集</strong></h4>
作品集的确很费心费力，看好学校的要求，比如UPenn的IPD专业要PDF，有些专业没有格式限制。内容可以参考我搜集整理的一个博客：<a href="http://alldesignprocess.tumblr.com/" target="_blank">http://alldesignprocess.tumblr.com</a>
<h4><b>4. 一些细节</b></h4>
比如上哪儿校订PS。我自己申请过，也让留学中介申请过，大部分留学中介的水平，不坑你都算好的了。。。还帮我写PS呢，就是我中文写，他们翻译呗，翻出来一个第三人称单数都能写错的鬼东西。。。我还是推荐多做功课，自己DIY，请学长学姐吃饭，给他们发红包。

比较推荐的是<a href="https://www.fiverr.com/" target="_blank" rel="nofollow noreferrer">http://fiverr.com<i></i></a> 基本上是五美元十美元就能找英语母语国家的人帮你校对一篇PS。我当时的PS犯了个很弱智的错误，还好校对救了我，不然估计没学上了。

<strong>「优设七月份人气最高的<a title="查看 PS教程 中的全部文章" href="http://www.uisdc.com/tag/ps%e6%95%99%e7%a8%8b" target="_blank">PS教程</a>合集」</strong>
<blockquote><strong>绘制漂亮的渐变图标：</strong>
<a href="http://www.uisdc.com/photoshop-elegant-gradual-button" target="_blank">《PS教程！教你绘制超漂亮的渐变按钮图标》</a>

<strong>Q版卡通形象：</strong>
<a href="http://www.uisdc.com/photoshop-design-cute-avatar" target="_blank">《热门教程！手把手教你把真人变成Q版卡通形象》</a>

<strong>PS抠图神器！</strong>
<a href="http://www.uisdc.com/photoshop-edge-modulation-feature" target="_blank">《PS抠图神器！两个实例帮你彻底掌握「调整边缘」的逆天功能》</a></blockquote>
<strong>原文地址：</strong><a href="https://zhuanlan.zhihu.com/p/21618838?f3fb8ead20=db397eca1540e731e87a65d7d8111b0f" target="_blank">zhuanlan.zhihu</a>";s:10:"post_title";s:69:"留学生来收！过来人和你聊聊设计领域的转专业申请";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:198:"%e7%95%99%e5%ad%a6%e7%94%9f%e6%9d%a5%e6%94%b6%ef%bc%81%e8%bf%87%e6%9d%a5%e4%ba%ba%e5%92%8c%e4%bd%a0%e8%81%8a%e8%81%8a%e8%ae%be%e8%ae%a1%e9%a2%86%e5%9f%9f%e7%9a%84%e8%bd%ac%e4%b8%93%e4%b8%9a%e7%94%b3";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-08-01 10:25:06";s:17:"post_modified_gmt";s:19:"2016-08-01 02:25:06";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:25:"http://qisumu.com/?p=1384";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}