���Z<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":24:{s:2:"ID";i:911;s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-25 21:28:36";s:13:"post_date_gmt";s:19:"2016-07-25 13:28:36";s:12:"post_content";s:9944:"<blockquote>从接触交互设计到现在也有一段时间，而这是第一次比较全面的接触游戏交互，网上也蛮少有游戏交互的实习体验，目前为猪厂用户体验中心交互实习生一枚，想把自己的一些体验和工作感受整理一下，分享给有需要的同学</blockquote>
<a class="highslide-image" href="http://image.woshipm.com/wp-files/2016/07/jiaohushixishenee.jpg"><img class="size-full wp-image-379958 aligncenter" src="http://image.woshipm.com/wp-files/2016/07/jiaohushixishenee.jpg" sizes="(max-width: 680px) 100vw, 680px" srcset="http://www.woshipm.com/wp-content/uploads/2016/07/jiaohushixishenee.jpg 680x, http://www.woshipm.com/wp-content/uploads/2016/07/jiaohushixishenee-404x190.jpg 404x" alt="jiaohushixishenee" width="680" height="320" data-original="http://image.woshipm.com/wp-files/2016/07/jiaohushixishenee.jpg" /></a>

注：以下更多的是讲游戏交互实习生的体验，而不是说游戏交互需要什么能力或者技巧。
<h2>1.理解并且快速学习</h2>
我所负责的是一款卡牌养成收集类的二次元游戏，一开始可能做游戏交互可能对很多游戏的特定名称不理解，也会有一些特殊的游戏类型，例如MOBA、FPS等。当一开始知道负责的是二次元游戏的时候确实有点懵，虽然并不讨厌二次元内容，但是对二次元也很少接触，更别说很多各种不懂的翻译和专属用词。但既然接受了这个挑战，就要尽自己的全力去做好。

如果负责的是偏二次元粉丝的游戏，就需要快速的对二次元人群有认知习惯，具体做法可以从各种角度收集（例如bilibili、A站、贴吧、知乎……）总而言之，做交互设计很重要的能力就是需要面对不同的领域时候有快速学习的能力。
<h2>2.深入理解项目</h2>
因为对二次元了解甚少，一开始接到的任务目标就是快速的熟悉游戏，但问题也随之而来。

快速的升级或许可以让你熟悉游戏的任务流程和玩法，但是并不能给带来更好的体验价值，如果你不是核心玩家或者用户群，很难从用户的角度去看待老玩家真正遇到痛点的问题。

例如我所负责的游戏有二次元人群的粉丝倾向，游戏的核心玩法是关于卡牌收集养成，游戏的风格是偏向古典风，战斗界面会比较华丽炫酷，往往会干扰玩家的视觉，玩家在浏览战斗信息需要上—下—上—左（点击确定 ），一开始对游戏不够理解，觉得这是很麻烦的操作体验，但实际通过理解游戏的核心玩法之后会发现对于老玩家来说，首先其操作的固有习惯已经让玩家适应了这样的操作，更重要的是玩家在出卡牌前需要和队友确认自己的出牌才能打出更好的效果/buff，而谨慎的操作能够避免团灭。所以玩家能够忍受这些小的操作体验打断，这些都是基于深层次的产品体验后才能了解。
<h2>3.理解业务目标</h2>
理解游戏的业务目标也很重要，在优化游戏的换装功能部分时，现在很多游戏开发商的产品都有提供给玩家通过充值来购买虚拟物品提升游戏形象，一开始也提出了这样的功能需求，但是通过和导师的沟通明确了如果这样做的话会降低游戏的口碑，而这个游戏更倾向的是让玩家收集卡牌而不是为了变强而变强，在剧情和美术上也都花了很多的开发成本，目的就是让游戏能够给玩家更好的体验，所以游戏是通过玩家刷副本掉落素材来获得换装，既能够吸引增加玩家的留存率，又能维持游戏的平衡性。
<h2>4.明确目标人群</h2>
这里的目标人群不是指前期的游戏目标人群，而是指游戏的运营期。因为所负责的游戏已经上线了近一年的时间，游戏已经进入平稳运营阶段，在一开始开服前三个月会有大量的人群涌入，形成一个高峰期，而往后的阶段是是用户慢慢流失。目前的新手玩家已经趋于少数，留下来的是核心玩家，所以要明确优化的目标人群是这些老玩家，在一开始做分析报告的时候，由于自己是该游戏的新玩家，并且不是二次元圈子的用户群，所以在理解游戏的玩法和专属用词上较弱（例如cost、叠c、乖离等），所以也会提出很多服务新玩家的体验和功能。但对于一个到了运营阶段并且有一定用户群的产品来说，应该更多的围绕符合老玩家的一些活动和设计优化去做，所以要让自己尽快成为核心玩家或者老玩家才能真正的为玩家做出优化体验的改变，这大抵也是常说设计师要把自己当用户的体现吧。
<h2>5.不止交互设计</h2>
在做游戏交互的时候 ，需要看接触的是哪个游戏部门，如果你所负责的是正在开发的游戏项目，那会根据情况不断的跑查和QA测试反馈问题，不断的出界面需求和优化功能；如果你所负责的游戏已经上线一段时间后进入了平稳运营期，那需要做的需求和交互会少一些，新功能的需求会根据策划的要求做出体验，当然也可以自己体验的时候提出一些优化方案再和策划讨论，所以这个时候需要自己多去体验不同游戏，寻找可以优化的点。但前期是你的体验是处在核心玩家的范围，对游戏的核心玩法有足够的了解，你的方案才能够打动游戏策划和被程序员认可。如果在没有需求的时候会帮忙GUI做一些运营需要的banner和输出一些icon,可能有些人会觉得这不是交互设计应该做的事，但在团队里面，你的多能力会得到更多的锻炼，这些小的积累都会加深你对负责产品的理解和提高影响力，能够帮助加快项目进度和提升合作效率，做游戏交互，gui完成风格稿设定和通用控件库之后，UI设计界面的时候也是需要可以用ps熟练快速地进行布局排版。
<h2>6.整理交互文档</h2>
虽然之前在创业公司有过实习经验，但是还是没有写过完整的交互文档的经验，游戏的交互文档同时也需要描述各种页面的规则，极限状态，跳转逻辑，交互状态和样式，有时候还需要插入音效的描述、场景特效的描述，呈现文档的方式有很多，网易最常用的是excel、PPT等，工具用什么在于便于协作和完成信息的传达。一般会将体验分成四级问题：

一级问题：严重阻碍体验，用户无法自我纠错，页面逻辑混乱，重大的体验打断和BUG

二级问题：阻碍体验但是可以继续，用户无法自我纠错，上层领导比较关注的问题，重复强调的问题：二次确认、必须要过的规范：角标、惯性缓动、品牌页

三级问题：规范中的其他问题；降低体验流畅性，但用户可以通过努力自行解决；能够一眼看出的问题但不影响实际体验：如不符合交互原则的问题（一致性问题）

四级问题：体验改善问题，建议性问题

然后可以根据四项分类开始从游戏的单独模块记录体验问题，并且可以概括内容后提出你的解决详细方案、方案截图等。
<h2>7.沟通的重要性</h2>
做交互设计很重要的一点就是沟通，交互设计是连接着产品经理/策划，一边又连接着GUI、开发的一个桥梁角色，如何说服别人理解你的方案，并且达到一致的认知很重要，写好交互文档只是其中的，有一次就因为没有沟通清楚策划的需求而导致方案需要重头来过。但这里可能会面临一个问题，其实在公司每个人都会很多事务要忙，也没有人经常会被你抓住然后bibi，所以很重要的是先梳理你的整体思路，对方案的不确定在哪？你有什么想法或者疑问都可以把这些点都用红点标记出来之后，约上你需要了解的对象分点简述，并且及时的记录想法，时间控制在十分钟内最佳。
<h2>8.对整体设计的思考</h2>
在实习的开始阶段导师会让我做一些游戏体验报告或者竞品分析，很容易就陷入了对局部细节的一些体验细节纠结，例如在遇到挫折时页面需要文字提示，这个按钮的颜色太明显，那个页面应该……并不是说不需要这些细节体验，这些微交互能够为用户带来一些方便，但是作为实习生而言，其实可以从更大的产品方向出发，可以找导师和策划了解整个产品的思路后，延展出一些新的想法，多尝试不同维度的思考对个人的眼界和认知都有很大的提高，有时候也可以结合APP的功能来思考游戏。例如微信的摇一摇功能能不能在游戏里产生什么样的交互乐趣？如果将聊天做成一个游戏你会有什么想法？也许想法不成熟或者因某些限制不能够实现，但是请不要放过每一次思考的机会，养成好的设计思维对能力提升很重要。
<h2>总结：</h2>
虽然游戏交互与互联网产品的交互设计不太一样，不过游戏本身也是产品，也是围绕着设计目标、用户目标来体验设计的价值，记得在1688的《U一点料》上有段话对我影响深刻：设计目标=给用户带来某价值，为价值提供变现的设计策略，游戏也莫非如此吧。从某种角度上游戏比普通产品更加复杂，一个游戏内容包含着游戏目标，任务，成长系统，社交，工具，可以说是多个产品的一个平衡点，但也有很多的不同的地方，例如操作方式需要双手，需要有更强的沉浸感，需要音效和场景的配合，而APP大部分都是单手操作，因为要考虑到使用场景，还有尽快的完成任务，这些都需要更多平时的积累和思考，共勉。

&nbsp;";s:10:"post_title";s:58:"我做游戏交互实习这段时间，总结了这8个点";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:172:"%e6%88%91%e5%81%9a%e6%b8%b8%e6%88%8f%e4%ba%a4%e4%ba%92%e5%ae%9e%e4%b9%a0%e8%bf%99%e6%ae%b5%e6%97%b6%e9%97%b4%ef%bc%8c%e6%80%bb%e7%bb%93%e4%ba%86%e8%bf%998%e4%b8%aa%e7%82%b9";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-25 21:28:36";s:17:"post_modified_gmt";s:19:"2016-07-25 13:28:36";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";i:0;s:4:"guid";s:24:"http://qisumu.com/?p=911";s:10:"menu_order";i:0;s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";s:6:"filter";s:3:"raw";}}