�ʐZ<?php exit; ?>a:1:{s:7:"content";O:8:"stdClass":23:{s:2:"ID";s:3:"220";s:11:"post_author";s:1:"1";s:9:"post_date";s:19:"2016-07-18 18:36:14";s:13:"post_date_gmt";s:19:"2016-07-18 10:36:14";s:12:"post_content";s:11338:"今天从交互角度给大家讲讲弹框的设计，喜欢的同学可以赞下~有不足之处可以留言告诉我哦~

近期大家都在反馈说文章的配图好少，如果多一些图结合文字会更容易理解。所以我绞尽脑汁，找了不少图，等会慢慢给你们上~嘿嘿嘿~~~

<strong>正文:</strong>

最近很多文章都在说弹框设计，其实一个弹框就是一个弹框而已，没那么多讲究。我用一句话就可以概括，这句话叫做——扩展句，然后我把它扩展成了一篇文章。（有没有被我调皮的样子萌到？爱你们~）

本来传统意义上的弹框一般有三种：

<strong>1.系统自动弹出的提醒</strong>

<strong>2.帮助用户快速的做出选择</strong>

<strong>3.对用户的操作给予反馈</strong>

但是现在还多了一种，而且很多产品都在用这种弹框方式，因为它很赚钱 -- 广告。所以广告类的弹框已经被我列入弹框设计的第四个类别，今天就跟大家具体来说说这四块内容。<strong>这篇文章注定篇幅比较长，但绝对是值得你收藏的文章。</strong>

在说之前，先来给这几个类别定个清晰的术语(逼格起来没):

系统自动弹出的提醒 -- <strong>系统提示</strong>

帮助用户快速做选择 -- <strong>操作引导</strong>

对用户的操作给予反馈 -- <strong>信息反馈</strong>

广告 -- <strong>广告弹框</strong>(想不到了，脑子不好使)

<strong>系统提示</strong>

其实系统提示这一种弹框，就可以写很长的篇幅，但是为了不把大家越带越深，免得逻辑理不清，所以我说几个相对重要的。

有一种是大家见得最多的，就是评分类弹框。这种自动弹出的提醒，每次都会让我有想卸载App的冲动(就是那种无法克制的冲动，不知道你们懂不懂那种感觉)。

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/1/2/7/706721.png" alt="Image title" width="900" />

这类弹框，需要遵守的四个设计准则:

1.<strong>不要在用户第一次登录就立马出来。</strong>别人都没用你产品，你就要别人评价，是想怎么样？

2.<strong>注意弹框的频率。</strong>别一会就弹一会就弹的，弹出鱼尾纹怎么办。

3.<strong>专门定个入口。</strong>有些用户确实人品不错，他会在使用之后去给产品评价，所以留个这样的入口，层级可以深一点，让用户自己去操作，会更好。如:

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/2/3/7/706732.png" alt="Image title" width="900" />

微信直接在页面里留个评价入口。虽然层级深，但是总比一直弹框提醒和干脆取消这种弹框提醒的方式要好得多。要记住，用户想要评价自然会去做，如果不想，你做得多了反而会有负面效果。

4.<strong>老生常谈的四个字:注意美化。</strong>想要让自己产品在同行业中脱颖而出，在功能做的较好的前提下，要展示出与众不同的特色。如:

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/2/2/7/706722.png" alt="Image title" width="900" />

小红书在这方面做得还是很不错的。当然还有很多其他的，我就是正好看到他们家的，大家可以借鉴下。多思考思考，有时候细节真的是可以决定成败的。

再来说说另一类系统提示弹框。就是产品更新之后，进入页面会让用户查看更新详情，也可以点击“知道了”选择不看(也有人会把它设计为引导页，不过这里不对引导页做说明，后期会专门另写一篇文章详说)。如:

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/4/2/7/706724.png" alt="Image title" width="900" />

同样可以用上面说到的四个点中的几个来设计这类提醒:

1.注意弹框频率(这类提醒一般只有更新产品之后第一次打开会弹出)

2.专门定个入口(一般来说在评价的相同层级留个路口，展示新功能详情会更好)

3.美化(这个就不多说了)。

举了两个例子，用了四个准则来说明这类弹框的设计方法，我把它们称作为<strong>系统提示类的弹框设计四大准则</strong>。当然还有系统会提醒用户是否接收推送消息等等，这些弹框都是系统提示类弹框，这里就不多说了。只要遵守这四个准则，设计思路都是一样的。

<strong>操作引导</strong>

什么是操作引导？上个图:

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/7/2/7/706727.png" alt="Image title" width="900" />

看到这个是不是很疑惑（路人甲:这哪里是框，耍我啊）？有人可能会认为这类引导顶多算是弹出层，算不上是框，但只是名词的差异而已。所以这里我把它也归为弹框，其实概念还是一样的，它也是操作引导的一个弹框提醒。

再来看看操作引导的第二种弹框:

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/8/2/7/706728.png" alt="Image title" width="900" />

有印象么？这类弹框经常会出现在一些用户没有把握的页面，避免用户操作失误。不过目前很多人都觉得这类弹框有利有弊，有的地方出现的不合时宜，打断了用户的使用状态。所以在设计这类弹框时要非常谨慎，得通过多次讨论、研究确认是否有必要出现。

这类弹框，也有四个设计准则:

1.<strong>注意出现的频率。</strong>如果是自动弹出做引导，那必须注意频率，它们一般在下载之后第一次打开应用才会出现。

2.<strong>文案要简洁明了。</strong>有些弹框很有趣，出现的文案让你不知道该选择什么，其实明明就两个选项。如:这是真的，因为我怕把这个App发出来会被人说，所以自己随便弄了个，丑是丑了点，随便看看。里面的文案内容我是照抄的。这种弹框会让用户纠结的，就算是几秒钟也是纠结，所以设计的时候一定要注意文案。

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/1/3/7/706731.png" alt="Image title" width="900" />

3.<strong>按钮的主次之分。</strong>这个准则正好可以用在上面那个图上。颜色或字体的粗细都是可以进行区分的，要学会引导用户，去做你想让他做的事情。

4.<strong>美观依然重要。</strong>

在设计操作引导类的弹框时，遵守这四个准则，设计出来的弹框一定不会差。

<strong>信息反馈</strong>

信息反馈类的弹框相信大家经常会有看到，只是印象不深，因为这个弹框给人一种好像不存在的感觉，但是实际上是存在的。来个图:

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/9/2/7/706729.png" alt="Image title" width="900" />

（好像暴露了什么~）有印象了吧？这类弹框一般出现在会有反馈的操作之后，提醒用户页面正在加载中、保存成功、已删除、已刷新等等。就不过多上图了，相信你们能理解。

那么这类弹框同样也有四个准则:

1.<strong>提供一个小动效，如菊花。</strong>为什么呢？因为这类反馈弹框都会让用户等待，所以要跟用户产生互动，让用户知道现在已经在加载，而不是卡住了。如果实在懒，不想做图片动效，那来个省略号动效也行吧。

2.<strong>让用户选择关闭。</strong>不知道你们有没有遇到一种情况，就是点击了某个按钮之后会有加载，然后不知道为什么就是加载不出来，速度非常缓慢，一直在转菊花，然后点哪里都没反应，只有一层黑色蒙版的背景，结果只能退出应用重新打开它。是不是很烦？所以提供一个关闭按钮，绝对是非常合理的。

3.<strong>文案简洁明了。</strong>一个信息反馈类弹框，千万不要有多余的文字，有些App为了彰显独特的个性，非要来一些非主流的文案，说实话，用户一点都不关心。不要把时间浪费在这类所谓的“细节”上，意思明确且简单是最好的。

4.<strong>美观，还是那么重要。</strong>

反馈信息类弹框的设计较为简单，也没那么多篇幅，但是如果要细说还是有很多内容了，这里就不延展开来讨论了。只要遵守这四个准则，基本能完成这类弹框的设计了。

<strong>广告弹框</strong>

最后一类，这是最近常看到的一类，它存在于各类弹框中，当然也包括系统提示、操作引导、信息反馈。有些产品的弹框是为了广告而弹，这也是很常见的。来看看出现最多的一种方式:

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/0/3/7/706730.png" alt="Image title" width="900" />

有时候外卖点完会让你分享红包，这类弹框是非常典型的广告类弹框。还有很多其他的，不过今天我先说说这一种。

也是一样，广告类弹框的设计也需要遵守四个准则:

1.<strong>广告内容明确，主体不要偏。</strong>做过平面设计的同学都知道，每次领导来一个需求，要求你设计一张banner或者海报之类的物料，恨不得把所有东西都摆上去，显得内容丰富(其实我们都知道，low爆了)。但是在设计App广告弹框时，必须要记住，你要宣传的东西得很清晰，很明确。

2.<strong>按钮设计要突出。</strong>想要让用户使用你宣传的东西，就干脆点，别小家子气的来几个小按钮，然后内容特别多，你是要让用户看还是让用户用呢。何况一个弹框就那么一点大小，真要说很多的话就专门留个路口给用户好好介绍下。

<img class="fr-fin fr-dib" src="http://img.ui.cn/data/file/3/3/7/706733.png" alt="Image title" width="900" />

3.<strong>优化文案。 </strong>

4.<strong>还是美观。</strong>这两点就不重复了，上面都说过了。广告类弹框的四个设计准则就是这样了。

<strong>总结</strong>

一定要记住无论什么类型的弹框，必须要做到文案简洁。不要让用户看半天还没明白你要说的是什么，然后才没办法也无所谓的点了确定或取消（大部分这种情况，他们都会点击取消）。

四个弹框种类的四大设计准则都说完了，不知道大家有没有注意到四类弹框都提到的一点:<strong>美观</strong>。

很多团队都认为弹框就是一个提醒，有就好了，不用在意这么多。但是一个App的好坏就在这里能看出。弹框是交互设计中非常重要的一个点，这类设计不仅考验交互设计师的综合能力，也能从产品看出整个团队的整体水平如何。这就是一个细节，但是细节往往决定成败。

写到现在，看起来好像很多，但只要理解了，其实也就这样吧。

今天说的内容非常干，应该能帮到很多设计师重新开始重视弹框的设计。如果想要深入了解弹框设计，可以在公众号留言，我会根据大家的留言，看看大家是否想了解更高层次的弹框设计，然后拆开各个种类来写，帮大家更好的去理解。";s:10:"post_title";s:33:"四类弹框的四大设计准则";s:12:"post_excerpt";s:0:"";s:11:"post_status";s:7:"publish";s:14:"comment_status";s:4:"open";s:11:"ping_status";s:4:"open";s:13:"post_password";s:0:"";s:9:"post_name";s:99:"%e5%9b%9b%e7%b1%bb%e5%bc%b9%e6%a1%86%e7%9a%84%e5%9b%9b%e5%a4%a7%e8%ae%be%e8%ae%a1%e5%87%86%e5%88%99";s:7:"to_ping";s:0:"";s:6:"pinged";s:0:"";s:13:"post_modified";s:19:"2016-07-19 12:42:59";s:17:"post_modified_gmt";s:19:"2016-07-19 04:42:59";s:21:"post_content_filtered";s:0:"";s:11:"post_parent";s:1:"0";s:4:"guid";s:24:"http://qisumu.com/?p=220";s:10:"menu_order";s:1:"0";s:9:"post_type";s:4:"post";s:14:"post_mime_type";s:0:"";s:13:"comment_count";s:1:"0";}}